[Survived] StringLiteral
src/api/dual-source-client.ts:50:38
     fetchFn: () => Promise<T>,
     ttl?: number,
   ): Promise<T> {
-    const cached = this.cache.get<T>(`triple:${key}`);
+    const cached = this.cache.get<T>(``);
     if (cached) {
       return cached;

[Killed] BlockStatement
src/api/dual-source-client.ts:51:17
     ttl?: number,
   ): Promise<T> {
     const cached = this.cache.get<T>(`triple:${key}`);
-    if (cached) {
-      return cached;
-    }
+    if (cached) {}
 
     const result = await fetchFn();
killedBy: DualSourceApiClient source preference should cache results from triple source
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

  Object {
-   "data": Array [
-     "cached-provider",

[NoCoverage] ArrayDeclaration
src/api/dual-source-client.ts:83:21
       const custom =
         customProviders.status === "fulfilled"
           ? customProviders.value
-          : { data: [] };
+          : { data: ["Stryker was here"] };
 
       // Merge all three sources

[Survived] StringLiteral
src/api/dual-source-client.ts:97:7
    */
   async getProvider(provider: string): Promise<Record<string, ApiGuruAPI>> {
     return this.fetchWithCache(
-      `${CACHE_KEYS.PROVIDER_PREFIX}${provider}`,
+      ``,
       async () => {
         const [primaryAPIs, secondaryAPIs, customAPIs] =

[NoCoverage] ConditionalExpression
src/api/dual-source-client.ts:129:11
       // Check if custom has this provider
       const hasCustom = await this.customClient.hasProvider(provider);
 
-      if (hasCustom) {
+      if (false) {
         try {
           return await this.customClient.getServices(provider);

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:129:22
       // Check if custom has this provider
       const hasCustom = await this.customClient.hasProvider(provider);
 
-      if (hasCustom) {
-        try {
-          return await this.customClient.getServices(provider);
-        } catch (error) {
-          // Fallback to secondary/primary if custom fails
-        }
-      }
+      if (hasCustom) {}
 
       // Check if secondary has this provider

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:130:13
       const hasCustom = await this.customClient.hasProvider(provider);
 
       if (hasCustom) {
-        try {
-          return await this.customClient.getServices(provider);
-        } catch (error) {
+        try {} catch (error) {
           // Fallback to secondary/primary if custom fails
         }

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:140:25
       // Check if secondary has this provider
       const hasSecondary = await this.secondaryClient.hasProvider(provider);
 
-      if (hasSecondary) {
-        try {
-          return await this.secondaryClient.getServices(provider);
-        } catch (error) {
-          // Fallback to primary if secondary fails
-        }
-      }
+      if (hasSecondary) {}
 
       return await this.primaryClient.getServices(provider);

[NoCoverage] ConditionalExpression
src/api/dual-source-client.ts:140:11
       // Check if secondary has this provider
       const hasSecondary = await this.secondaryClient.hasProvider(provider);
 
-      if (hasSecondary) {
+      if (true) {
         try {
           return await this.secondaryClient.getServices(provider);

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:141:13
       const hasSecondary = await this.secondaryClient.hasProvider(provider);
 
       if (hasSecondary) {
-        try {
-          return await this.secondaryClient.getServices(provider);
-        } catch (error) {
+        try {} catch (error) {
           // Fallback to primary if secondary fails
         }

[Killed] ConditionalExpression
src/api/dual-source-client.ts:163:11
       // Check custom first (highest precedence)
       const hasCustomAPI = await this.customClient.hasAPI(apiId);
 
-      if (hasCustomAPI) {
+      if (true) {
         try {
           return await this.customClient.getAPI(provider, api);
killedBy: DualSourceApiClient getAPI should check custom first, then secondary, then primary
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-provider:v1"

Number of calls: 0

[Killed] ConditionalExpression
src/api/dual-source-client.ts:163:11
       // Check custom first (highest precedence)
       const hasCustomAPI = await this.customClient.hasAPI(apiId);
 
-      if (hasCustomAPI) {
+      if (false) {
         try {
           return await this.customClient.getAPI(provider, api);
killedBy: DualSourceApiClient getAPI should return custom API if available
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-provider", "v1"

Number of calls: 0

[Killed] BlockStatement
src/api/dual-source-client.ts:164:13
       const hasCustomAPI = await this.customClient.hasAPI(apiId);
 
       if (hasCustomAPI) {
-        try {
-          return await this.customClient.getAPI(provider, api);
-        } catch (error) {
+        try {} catch (error) {
           // Fallback to secondary/primary if custom fails
         }
killedBy: DualSourceApiClient getAPI should return custom API if available
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-provider", "v1"

Number of calls: 0

[Killed] ConditionalExpression
src/api/dual-source-client.ts:174:11
       // Check secondary next
       const hasSecondaryAPI = await this.secondaryClient.hasAPI(apiId);
 
-      if (hasSecondaryAPI) {
+      if (true) {
         try {
           return await this.secondaryClient.getAPI(provider, api);
killedBy: DualSourceApiClient getAPI should check custom first, then secondary, then primary
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-provider", "v1"

Number of calls: 0

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:174:28
       // Check secondary next
       const hasSecondaryAPI = await this.secondaryClient.hasAPI(apiId);
 
-      if (hasSecondaryAPI) {
-        try {
-          return await this.secondaryClient.getAPI(provider, api);
-        } catch (error) {
-          // Fallback to primary if secondary fails
-        }
-      }
+      if (hasSecondaryAPI) {}
 
       return await this.primaryClient.getAPI(provider, api);

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:175:13
       const hasSecondaryAPI = await this.secondaryClient.hasAPI(apiId);
 
       if (hasSecondaryAPI) {
-        try {
-          return await this.secondaryClient.getAPI(provider, api);
-        } catch (error) {
+        try {} catch (error) {
           // Fallback to primary if secondary fails
         }

[NoCoverage] ConditionalExpression
src/api/dual-source-client.ts:199:13
       `api:${provider}:${service}:${api}`,
       async () => {
         // For custom provider, check if it's actually a direct API call
-        if (provider === "custom") {
+        if (false) {
           // Try to find the API by name first (service parameter)
           const hasCustomByName = await this.customClient.hasAPI(

[NoCoverage] EqualityOperator
src/api/dual-source-client.ts:199:13
       `api:${provider}:${service}:${api}`,
       async () => {
         // For custom provider, check if it's actually a direct API call
-        if (provider === "custom") {
+        if (provider !== "custom") {
           // Try to find the API by name first (service parameter)
           const hasCustomByName = await this.customClient.hasAPI(

[NoCoverage] StringLiteral
src/api/dual-source-client.ts:202:13
         if (provider === "custom") {
           // Try to find the API by name first (service parameter)
           const hasCustomByName = await this.customClient.hasAPI(
-            `custom:${service}:v1`,
+            ``,
           );
           if (hasCustomByName) {

[NoCoverage] ConditionalExpression
src/api/dual-source-client.ts:204:15
           const hasCustomByName = await this.customClient.hasAPI(
             `custom:${service}:v1`,
           );
-          if (hasCustomByName) {
+          if (true) {
             try {
               return await this.customClient.getAPI(provider, service);

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:204:32
           const hasCustomByName = await this.customClient.hasAPI(
             `custom:${service}:v1`,
           );
-          if (hasCustomByName) {
-            try {
-              return await this.customClient.getAPI(provider, service);
-            } catch (error) {
-              // Continue to try other approaches
-            }
-          }
+          if (hasCustomByName) {}
         }
 

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:205:17
             `custom:${service}:v1`,
           );
           if (hasCustomByName) {
-            try {
-              return await this.customClient.getAPI(provider, service);
-            } catch (error) {
+            try {} catch (error) {
               // Continue to try other approaches
             }

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:219:15
         const hasCustomAPI = await this.customClient.hasAPI(apiId);
 
         if (hasCustomAPI) {
-          try {
-            return await this.customClient.getServiceAPI(
-              provider,
-              service,
-              api,
-            );
-          } catch (error) {
+          try {} catch (error) {
             // Fallback to secondary/primary if custom fails
           }

[NoCoverage] ConditionalExpression
src/api/dual-source-client.ts:233:13
         // Check secondary next
         const hasSecondaryAPI = await this.secondaryClient.hasAPI(apiId);
 
-        if (hasSecondaryAPI) {
+        if (false) {
           try {
             return await this.secondaryClient.getServiceAPI(

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:234:15
         const hasSecondaryAPI = await this.secondaryClient.hasAPI(apiId);
 
         if (hasSecondaryAPI) {
-          try {
-            return await this.secondaryClient.getServiceAPI(
-              provider,
-              service,
-              api,
-            );
-          } catch (error) {
+          try {} catch (error) {
             // Fallback to primary if secondary fails
           }

[NoCoverage] ArrowFunction
src/api/dual-source-client.ts:323:20
                 maxTotal: PAGINATION.LARGE_FETCH_LIMIT,
                 chunkSize: PAGINATION.CHUNKED_FETCH_SIZE,
               },
-            ).then((result) => ({
-              data: result.data,
-              total: result.totalFetched,
-              hasMore: false,
-            })),
+            ).then(() => undefined),
             this.secondaryClient.listAPIs(),
             this.customClient.listAPIs(),

[NoCoverage] BooleanLiteral
src/api/dual-source-client.ts:326:24
             ).then((result) => ({
               data: result.data,
               total: result.totalFetched,
-              hasMore: false,
+              hasMore: true,
             })),
             this.secondaryClient.listAPIs(),

[NoCoverage] ArrayDeclaration
src/api/dual-source-client.ts:336:26
           primaryResults.status === "fulfilled"
             ? primaryResults.value
             : {
-                results: [],
+                results: ["Stryker was here"],
                 pagination: {
                   page: 1,

[NoCoverage] ObjectLiteral
src/api/dual-source-client.ts:337:29
             ? primaryResults.value
             : {
                 results: [],
-                pagination: {
-                  page: 1,
-                  limit: 0,
-                  total_results: 0,
-                  total_pages: 0,
-                  has_next: false,
-                  has_previous: false,
-                },
+                pagination: {},
               };
 

[NoCoverage] BooleanLiteral
src/api/dual-source-client.ts:342:29
                   limit: 0,
                   total_results: 0,
                   total_pages: 0,
-                  has_next: false,
+                  has_next: true,
                   has_previous: false,
                 },

[NoCoverage] BooleanLiteral
src/api/dual-source-client.ts:343:33
                   total_results: 0,
                   total_pages: 0,
                   has_next: false,
-                  has_previous: false,
+                  has_previous: true,
                 },
               };

[NoCoverage] MethodExpression
src/api/dual-source-client.ts:386:19
                 id,
                 title: preferredVersion?.info.title || "Untitled API",
                 description:
-                  (preferredVersion?.info.description || "").substring(0, 200) +
+                  preferredVersion?.info.description || "" +
                   (preferredVersion?.info.description &&
                   preferredVersion.info.description.length > 200

[NoCoverage] ConditionalExpression
src/api/dual-source-client.ts:387:20
                 title: preferredVersion?.info.title || "Untitled API",
                 description:
                   (preferredVersion?.info.description || "").substring(0, 200) +
-                  (preferredVersion?.info.description &&
-                  preferredVersion.info.description.length > 200
+                  (false
                     ? "..."
                     : ""),

[NoCoverage] ConditionalExpression
src/api/dual-source-client.ts:387:20
                 title: preferredVersion?.info.title || "Untitled API",
                 description:
                   (preferredVersion?.info.description || "").substring(0, 200) +
-                  (preferredVersion?.info.description &&
-                  preferredVersion.info.description.length > 200
+                  (true
                     ? "..."
                     : ""),

[NoCoverage] EqualityOperator
src/api/dual-source-client.ts:388:19
                 description:
                   (preferredVersion?.info.description || "").substring(0, 200) +
                   (preferredVersion?.info.description &&
-                  preferredVersion.info.description.length > 200
+                  preferredVersion.info.description.length <= 200
                     ? "..."
                     : ""),

[NoCoverage] ConditionalExpression
src/api/dual-source-client.ts:388:19
                 description:
                   (preferredVersion?.info.description || "").substring(0, 200) +
                   (preferredVersion?.info.description &&
-                  preferredVersion.info.description.length > 200
+                  true
                     ? "..."
                     : ""),

[NoCoverage] StringLiteral
src/api/dual-source-client.ts:389:23
                   (preferredVersion?.info.description || "").substring(0, 200) +
                   (preferredVersion?.info.description &&
                   preferredVersion.info.description.length > 200
-                    ? "..."
+                    ? ""
                     : ""),
                 provider:

[NoCoverage] ConditionalExpression
src/api/dual-source-client.ts:392:19
                     ? "..."
                     : ""),
                 provider:
-                  preferredVersion?.info["x-providerName"] ||
-                  id.split(":")[0] ||
+                  false ||
                   "Unknown",
                 preferred: api.preferred,

[NoCoverage] LogicalOperator
src/api/dual-source-client.ts:392:19
                     ? "..."
                     : ""),
                 provider:
-                  preferredVersion?.info["x-providerName"] ||
-                  id.split(":")[0] ||
+                  preferredVersion?.info["x-providerName"] && id.split(":")[0] ||
                   "Unknown",
                 preferred: api.preferred,

[NoCoverage] BooleanLiteral
src/api/dual-source-client.ts:405:25
               limit: secondaryEntries.length,
               total_results: secondaryEntries.length,
               total_pages: 1,
-              has_next: false,
+              has_next: true,
               has_previous: false,
             },

[NoCoverage] StringLiteral
src/api/dual-source-client.ts:450:58
                 id,
                 title: preferredVersion?.info.title || "Untitled API",
                 description:
-                  (preferredVersion?.info.description || "").substring(0, 200) +
+                  (preferredVersion?.info.description || "Stryker was here!").substring(0, 200) +
                   (preferredVersion?.info.description &&
                   preferredVersion.info.description.length > 200

[NoCoverage] EqualityOperator
src/api/dual-source-client.ts:452:19
                 description:
                   (preferredVersion?.info.description || "").substring(0, 200) +
                   (preferredVersion?.info.description &&
-                  preferredVersion.info.description.length > 200
+                  preferredVersion.info.description.length >= 200
                     ? "..."
                     : ""),

[NoCoverage] StringLiteral
src/api/dual-source-client.ts:457:28
                     : ""),
                 provider:
                   preferredVersion?.info["x-providerName"] ||
-                  id.split(":")[0] ||
+                  id.split("")[0] ||
                   "Unknown",
                 preferred: api.preferred,

[NoCoverage] StringLiteral
src/api/dual-source-client.ts:458:19
                 provider:
                   preferredVersion?.info["x-providerName"] ||
                   id.split(":")[0] ||
-                  "Unknown",
+                  "",
                 preferred: api.preferred,
                 categories:

[NoCoverage] StringLiteral
src/api/dual-source-client.ts:507:7
     }>;
   }> {
     return this.fetchWithCache(
-      "api_summary",
+      "",
       async () => {
         // Get combined API list for accurate summary

[NoCoverage] LogicalOperator
src/api/dual-source-client.ts:520:13
         const apisWithScore = apiEntries.map(([id, api]) => {
           const preferredVersion = api.versions[api.preferred];
           const provider =
-            preferredVersion?.info["x-providerName"] ||
-            id.split(":")[0] ||
+            preferredVersion?.info["x-providerName"] && id.split(":")[0] ||
             "Unknown";
           providers.add(provider);

[NoCoverage] ConditionalExpression
src/api/dual-source-client.ts:520:13
         const apisWithScore = apiEntries.map(([id, api]) => {
           const preferredVersion = api.versions[api.preferred];
           const provider =
-            preferredVersion?.info["x-providerName"] ||
-            id.split(":")[0] ||
+            false ||
             "Unknown";
           providers.add(provider);

[NoCoverage] ArrowFunction
src/api/dual-source-client.ts:527:13
 
           // Add categories
           (preferredVersion?.info["x-apisguru-categories"] || []).forEach(
-            (cat) => categories.add(cat),
+            () => undefined,
           );
 

[NoCoverage] MethodExpression
src/api/dual-source-client.ts:536:32
             preferredVersion?.info["x-apisguru-popularity"] || 0;
           const score = versionCount * 10 + popularity;
 
-          const latestUpdate = Math.max(
-            ...Object.values(api.versions).map((v) =>
-              new Date(v.updated).getTime(),
-            ),
-          );
+          const latestUpdate = Math.min(...Object.values(api.versions).map(v => new Date(v.updated).getTime()));
 
           return {

[NoCoverage] StringLiteral
src/api/dual-source-client.ts:544:52
 
           return {
             id,
-            title: preferredVersion?.info.title || "Untitled API",
+            title: preferredVersion?.info.title || "",
             provider,
             score,

[NoCoverage] StringLiteral
src/api/dual-source-client.ts:548:71
             provider,
             score,
             updated: latestUpdate,
-            updatedString: new Date(latestUpdate).toISOString().split("T")[0],
+            updatedString: new Date(latestUpdate).toISOString().split("")[0],
           };
         });

[NoCoverage] MethodExpression
src/api/dual-source-client.ts:553:30
         });
 
         // Get top 10 popular APIs
-        const popular_apis = apisWithScore
-          .sort((a, b) => b.score - a.score)
+        const popular_apis = apisWithScore
           .slice(0, 10)
           .map(({ id, title, provider }) => ({ id, title, provider }));

[NoCoverage] MethodExpression
src/api/dual-source-client.ts:553:30
         });
 
         // Get top 10 popular APIs
-        const popular_apis = apisWithScore
-          .sort((a, b) => b.score - a.score)
-          .slice(0, 10)
+        const popular_apis = apisWithScore.sort((a, b) => b.score - a.score)
           .map(({ id, title, provider }) => ({ id, title, provider }));
 

[NoCoverage] MethodExpression
src/api/dual-source-client.ts:559:32
           .map(({ id, title, provider }) => ({ id, title, provider }));
 
         // Get 10 recently updated APIs
-        const recent_updates = apisWithScore
-          .sort((a, b) => b.updated - a.updated)
-          .slice(0, 10)
+        const recent_updates = apisWithScore.sort((a, b) => b.updated - a.updated)
           .map(({ id, title, updatedString }) => ({
             id,

[NoCoverage] MethodExpression
src/api/dual-source-client.ts:559:32
           .map(({ id, title, provider }) => ({ id, title, provider }));
 
         // Get 10 recently updated APIs
-        const recent_updates = apisWithScore
-          .sort((a, b) => b.updated - a.updated)
+        const recent_updates = apisWithScore
           .slice(0, 10)
           .map(({ id, title, updatedString }) => ({

[NoCoverage] StringLiteral
src/api/dual-source-client.ts:565:39
           .map(({ id, title, updatedString }) => ({
             id,
             title,
-            updated: updatedString || "Unknown",
+            updated: updatedString || "",
           }));
 

[NoCoverage] MethodExpression
src/api/dual-source-client.ts:571:23
         return {
           total_apis: apiEntries.length,
           total_providers: providers.size,
-          categories: Array.from(categories).sort(),
+          categories: Array.from(categories),
           popular_apis,
           recent_updates,

[Survived] StringLiteral
src/api/dual-source-client.ts:585:7
    */
   async getMetrics(): Promise<ApiGuruMetrics> {
     return this.fetchWithCache(
-      "metrics",
+      "",
       async () => {
         const [

[Killed] MethodExpression
src/api/dual-source-client.ts:669:22
     };
   }> {
     // Ensure limit is within bounds
-    limit = Math.min(Math.max(limit, 1), 50);
+    limit = Math.min(Math.min(limit, 1), 50);
 
     const cacheKey = `search:${query}:${provider || "all"}:${page}:${limit}`;
killedBy: DualSourceApiClient searchAPIs should search all sources and merge results
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 1
Received array:  [{"categories": [], "description": "Test API 3", "id": "p3:api1", "preferred": "v1", "provider": "p3", "source": "secondary", "title": "API 3"}]

[Survived] MethodExpression
src/api/dual-source-client.ts:669:13
     };
   }> {
     // Ensure limit is within bounds
-    limit = Math.min(Math.max(limit, 1), 50);
+    limit = Math.max(Math.max(limit, 1), 50);
 
     const cacheKey = `search:${query}:${provider || "all"}:${page}:${limit}`;

[Survived] LogicalOperator
src/api/dual-source-client.ts:671:41
     // Ensure limit is within bounds
     limit = Math.min(Math.max(limit, 1), 50);
 
-    const cacheKey = `search:${query}:${provider || "all"}:${page}:${limit}`;
+    const cacheKey = `search:${query}:${provider && "all"}:${page}:${limit}`;
 
     return this.fetchWithCache(

[Survived] ConditionalExpression
src/api/dual-source-client.ts:671:41
     // Ensure limit is within bounds
     limit = Math.min(Math.max(limit, 1), 50);
 
-    const cacheKey = `search:${query}:${provider || "all"}:${page}:${limit}`;
+    const cacheKey = `search:${query}:${false}:${page}:${limit}`;
 
     return this.fetchWithCache(

[Killed] MethodExpression
src/api/dual-source-client.ts:729:30
         };
         if (secondaryResults.status === "fulfilled") {
           const secondaryAPIs = secondaryResults.value;
-          const queryLower = query.toLowerCase();
+          const queryLower = query.toUpperCase();
           const matchingAPIs: Array<[string, ApiGuruAPI]> = [];
 
killedBy: DualSourceApiClient searchAPIs should search all sources and merge results
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 2

[Killed] BlockStatement
src/api/dual-source-client.ts:732:69
           const queryLower = query.toLowerCase();
           const matchingAPIs: Array<[string, ApiGuruAPI]> = [];
 
-          for (const [apiId, api] of Object.entries(secondaryAPIs)) {
-            // If provider filter is specified, check if API matches
-            if (provider && !apiId.includes(provider)) {
-              continue;
-            }
-
-            // Search in API ID, title, description, and provider name
-            const matches =
-              apiId.toLowerCase().includes(queryLower) ||
-              Object.values(api.versions).some(
-                (version: ApiGuruApiVersion) =>
-                  version.info.title?.toLowerCase().includes(queryLower) ||
-                  version.info.description
-                    ?.toLowerCase()
-                    .includes(queryLower) ||
-                  version.info["x-providerName"]
-                    ?.toLowerCase()
-                    .includes(queryLower),
-              );
-
-            if (matches) {
-              matchingAPIs.push([apiId, api]);
-            }
-          }
+          for (const [apiId, api] of Object.entries(secondaryAPIs)) {}
 
           secondary = {
killedBy: DualSourceApiClient searchAPIs should search all sources and merge results
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 2

[Killed] ConditionalExpression
src/api/dual-source-client.ts:734:17
 
           for (const [apiId, api] of Object.entries(secondaryAPIs)) {
             // If provider filter is specified, check if API matches
-            if (provider && !apiId.includes(provider)) {
+            if (true) {
               continue;
             }
killedBy: DualSourceApiClient searchAPIs should search all sources and merge results
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 2

[Survived] ConditionalExpression
src/api/dual-source-client.ts:734:17
 
           for (const [apiId, api] of Object.entries(secondaryAPIs)) {
             // If provider filter is specified, check if API matches
-            if (provider && !apiId.includes(provider)) {
+            if (false) {
               continue;
             }

[Killed] ConditionalExpression
src/api/dual-source-client.ts:740:15
 
             // Search in API ID, title, description, and provider name
             const matches =
-              apiId.toLowerCase().includes(queryLower) ||
-              Object.values(api.versions).some(
-                (version: ApiGuruApiVersion) =>
-                  version.info.title?.toLowerCase().includes(queryLower) ||
-                  version.info.description
-                    ?.toLowerCase()
-                    .includes(queryLower) ||
-                  version.info["x-providerName"]
-                    ?.toLowerCase()
-                    .includes(queryLower),
-              );
+              false;
 
             if (matches) {
killedBy: DualSourceApiClient searchAPIs should search all sources and merge results
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 2

[Survived] MethodExpression
src/api/dual-source-client.ts:740:15
 
             // Search in API ID, title, description, and provider name
             const matches =
-              apiId.toLowerCase().includes(queryLower) ||
+              apiId.toUpperCase().includes(queryLower) ||
               Object.values(api.versions).some(
                 (version: ApiGuruApiVersion) =>

[NoCoverage] ArrowFunction
src/api/dual-source-client.ts:742:17
             const matches =
               apiId.toLowerCase().includes(queryLower) ||
               Object.values(api.versions).some(
-                (version: ApiGuruApiVersion) =>
-                  version.info.title?.toLowerCase().includes(queryLower) ||
-                  version.info.description
-                    ?.toLowerCase()
-                    .includes(queryLower) ||
-                  version.info["x-providerName"]
-                    ?.toLowerCase()
-                    .includes(queryLower),
+                () => undefined,
               );
 

[NoCoverage] LogicalOperator
src/api/dual-source-client.ts:743:19
               apiId.toLowerCase().includes(queryLower) ||
               Object.values(api.versions).some(
                 (version: ApiGuruApiVersion) =>
-                  version.info.title?.toLowerCase().includes(queryLower) ||
-                  version.info.description
-                    ?.toLowerCase()
-                    .includes(queryLower) ||
+                  version.info.title?.toLowerCase().includes(queryLower) && version.info.description?.toLowerCase().includes(queryLower) ||
                   version.info["x-providerName"]
                     ?.toLowerCase()
