[Survived] ConditionalExpression
src/custom-specs/security-scanner.ts:15:9
   constructor() {
     this.rules = this.initializeRules();
     // Debug: Verify rules are loaded
-    if (this.rules.length === 0) {
+    if (false) {
       console.error("SecurityScanner: No rules loaded!");
     }

[Survived] ConditionalExpression
src/custom-specs/security-scanner.ts:15:9
   constructor() {
     this.rules = this.initializeRules();
     // Debug: Verify rules are loaded
-    if (this.rules.length === 0) {
+    if (true) {
       console.error("SecurityScanner: No rules loaded!");
     }

[NoCoverage] StringLiteral
src/custom-specs/security-scanner.ts:16:21
     this.rules = this.initializeRules();
     // Debug: Verify rules are loaded
     if (this.rules.length === 0) {
-      console.error("SecurityScanner: No rules loaded!");
+      console.error("");
     }
   }

[Killed] StringLiteral
src/custom-specs/security-scanner.ts:29:44
     const visited = new WeakSet();
 
     // Recursively scan the entire spec object
-    this.scanObjectWithCircularCheck(spec, "", issues, visited);
+    this.scanObjectWithCircularCheck(spec, "Stryker was here!", issues, visited);
 
     // Calculate summary
killedBy: SecurityScanner scanSpec should categorize issues by context correctly
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ConditionalExpression
src/custom-specs/security-scanner.ts:33:38
 
     // Calculate summary
     const summary = {
-      critical: issues.filter((i) => i.severity === "critical").length,
+      critical: issues.filter((i) => false).length,
       high: issues.filter((i) => i.severity === "high").length,
       medium: issues.filter((i) => i.severity === "medium").length,
killedBy: SecurityScanner scanSpec should calculate summary statistics correctly
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ArrowFunction
src/custom-specs/security-scanner.ts:33:31
 
     // Calculate summary
     const summary = {
-      critical: issues.filter((i) => i.severity === "critical").length,
+      critical: issues.filter(() => undefined).length,
       high: issues.filter((i) => i.severity === "high").length,
       medium: issues.filter((i) => i.severity === "medium").length,
killedBy: SecurityScanner scanSpec should calculate summary statistics correctly
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ConditionalExpression
src/custom-specs/security-scanner.ts:34:34
     // Calculate summary
     const summary = {
       critical: issues.filter((i) => i.severity === "critical").length,
-      high: issues.filter((i) => i.severity === "high").length,
+      high: issues.filter((i) => false).length,
       medium: issues.filter((i) => i.severity === "medium").length,
       low: issues.filter((i) => i.severity === "low").length,
killedBy: SecurityScanner scanSpec should calculate summary statistics correctly
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ArrowFunction
src/custom-specs/security-scanner.ts:34:27
     // Calculate summary
     const summary = {
       critical: issues.filter((i) => i.severity === "critical").length,
-      high: issues.filter((i) => i.severity === "high").length,
+      high: issues.filter(() => undefined).length,
       medium: issues.filter((i) => i.severity === "medium").length,
       low: issues.filter((i) => i.severity === "low").length,
killedBy: SecurityScanner scanSpec should calculate summary statistics correctly
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Survived] ArrowFunction
src/custom-specs/security-scanner.ts:35:29
     const summary = {
       critical: issues.filter((i) => i.severity === "critical").length,
       high: issues.filter((i) => i.severity === "high").length,
-      medium: issues.filter((i) => i.severity === "medium").length,
+      medium: issues.filter(() => undefined).length,
       low: issues.filter((i) => i.severity === "low").length,
     };

[Survived] MethodExpression
src/custom-specs/security-scanner.ts:35:15
     const summary = {
       critical: issues.filter((i) => i.severity === "critical").length,
       high: issues.filter((i) => i.severity === "high").length,
-      medium: issues.filter((i) => i.severity === "medium").length,
+      medium: issues.length,
       low: issues.filter((i) => i.severity === "low").length,
     };

[Survived] MethodExpression
src/custom-specs/security-scanner.ts:36:12
       critical: issues.filter((i) => i.severity === "critical").length,
       high: issues.filter((i) => i.severity === "high").length,
       medium: issues.filter((i) => i.severity === "medium").length,
-      low: issues.filter((i) => i.severity === "low").length,
+      low: issues.length,
     };
 

[Survived] ConditionalExpression
src/custom-specs/security-scanner.ts:36:33
       critical: issues.filter((i) => i.severity === "critical").length,
       high: issues.filter((i) => i.severity === "high").length,
       medium: issues.filter((i) => i.severity === "medium").length,
-      low: issues.filter((i) => i.severity === "low").length,
+      low: issues.filter((i) => true).length,
     };
 

[Killed] ConditionalExpression
src/custom-specs/security-scanner.ts:40:21
     };
 
     // Determine if critical issues block import
-    const blocked = summary.critical > 0;
+    const blocked = true;
 
     return {
killedBy: SecurityScanner scanSpec should return clean result for safe spec
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/custom-specs/security-scanner.ts:40:21
     };
 
     // Determine if critical issues block import
-    const blocked = summary.critical > 0;
+    const blocked = false;
 
     return {
killedBy: SecurityScanner scanSpec should calculate summary statistics correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/custom-specs/security-scanner.ts:59:25
     issues: SecurityIssue[],
     visited: WeakSet<any>,
   ): void {
-    if (obj === null || obj === undefined) {
+    if (obj === null || obj !== undefined) {
       return;
     }
killedBy: SecurityScanner scanSpec should detect script injection in descriptions
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ConditionalExpression
src/custom-specs/security-scanner.ts:59:9
     issues: SecurityIssue[],
     visited: WeakSet<any>,
   ): void {
-    if (obj === null || obj === undefined) {
+    if (false) {
       return;
     }
killedBy: SecurityScanner scanSpec should handle edge cases gracefully
statusReason: TypeError: Invalid value used in weak set

[Killed] LogicalOperator
src/custom-specs/security-scanner.ts:64:9
     }
 
     // Check for circular references (only for objects)
-    if (typeof obj === "object" && !Array.isArray(obj)) {
+    if (typeof obj === "object" || !Array.isArray(obj)) {
       if (visited.has(obj)) {
         return; // Skip circular reference
killedBy: SecurityScanner scanSpec should return clean result for safe spec
statusReason: TypeError: Invalid value used in weak set

[Killed] BlockStatement
src/custom-specs/security-scanner.ts:64:57
     }
 
     // Check for circular references (only for objects)
-    if (typeof obj === "object" && !Array.isArray(obj)) {
-      if (visited.has(obj)) {
-        return; // Skip circular reference
-      }
-      visited.add(obj);
-    }
+    if (typeof obj === "object" && !Array.isArray(obj)) {}
 
     if (typeof obj === "string") {
killedBy: SecurityScanner error handling should handle circular references gracefully
statusReason: RangeError: Maximum call stack size exceeded

[Killed] ConditionalExpression
src/custom-specs/security-scanner.ts:65:11
 
     // Check for circular references (only for objects)
     if (typeof obj === "object" && !Array.isArray(obj)) {
-      if (visited.has(obj)) {
+      if (false) {
         return; // Skip circular reference
       }
killedBy: SecurityScanner error handling should handle circular references gracefully
statusReason: RangeError: Maximum call stack size exceeded

[Killed] ConditionalExpression
src/custom-specs/security-scanner.ts:65:11
 
     // Check for circular references (only for objects)
     if (typeof obj === "object" && !Array.isArray(obj)) {
-      if (visited.has(obj)) {
+      if (true) {
         return; // Skip circular reference
       }
killedBy: SecurityScanner scanSpec should detect script injection in descriptions
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] EqualityOperator
src/custom-specs/security-scanner.ts:71:9
       visited.add(obj);
     }
 
-    if (typeof obj === "string") {
+    if (typeof obj !== "string") {
       this.scanString(obj, path, issues);
     } else if (Array.isArray(obj)) {
killedBy: SecurityScanner scanSpec should detect script injection in descriptions
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ConditionalExpression
src/custom-specs/security-scanner.ts:71:9
       visited.add(obj);
     }
 
-    if (typeof obj === "string") {
+    if (false) {
       this.scanString(obj, path, issues);
     } else if (Array.isArray(obj)) {
killedBy: SecurityScanner scanSpec should detect script injection in descriptions
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] BlockStatement
src/custom-specs/security-scanner.ts:73:36
 
     if (typeof obj === "string") {
       this.scanString(obj, path, issues);
-    } else if (Array.isArray(obj)) {
-      obj.forEach((item, index) => {
-        this.scanObjectWithCircularCheck(
-          item,
-          `${path}[${index}]`,
-          issues,
-          visited,
-        );
-      });
-    } else if (typeof obj === "object") {
+    } else if (Array.isArray(obj)) {} else if (typeof obj === "object") {
       Object.entries(obj).forEach(([key, value]) => {
         const newPath = path ? `${path}.${key}` : key;
killedBy: SecurityScanner scanSpec should categorize issues by context correctly
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] BlockStatement
src/custom-specs/security-scanner.ts:74:36
     if (typeof obj === "string") {
       this.scanString(obj, path, issues);
     } else if (Array.isArray(obj)) {
-      obj.forEach((item, index) => {
-        this.scanObjectWithCircularCheck(
-          item,
-          `${path}[${index}]`,
-          issues,
-          visited,
-        );
-      });
+      obj.forEach((item, index) => {});
     } else if (typeof obj === "object") {
       Object.entries(obj).forEach(([key, value]) => {
killedBy: SecurityScanner scanSpec should categorize issues by context correctly
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ConditionalExpression
src/custom-specs/security-scanner.ts:82:16
           visited,
         );
       });
-    } else if (typeof obj === "object") {
+    } else if (false) {
       Object.entries(obj).forEach(([key, value]) => {
         const newPath = path ? `${path}.${key}` : key;
killedBy: SecurityScanner scanSpec should detect script injection in descriptions
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] EqualityOperator
src/custom-specs/security-scanner.ts:82:16
           visited,
         );
       });
-    } else if (typeof obj === "object") {
+    } else if (typeof obj !== "object") {
       Object.entries(obj).forEach(([key, value]) => {
         const newPath = path ? `${path}.${key}` : key;
killedBy: SecurityScanner scanSpec should detect script injection in descriptions
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] BlockStatement
src/custom-specs/security-scanner.ts:83:53
         );
       });
     } else if (typeof obj === "object") {
-      Object.entries(obj).forEach(([key, value]) => {
-        const newPath = path ? `${path}.${key}` : key;
-        this.scanObjectWithCircularCheck(value, newPath, issues, visited);
-      });
+      Object.entries(obj).forEach(([key, value]) => {});
     }
   }
killedBy: SecurityScanner scanSpec should detect script injection in descriptions
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[NoCoverage] BlockStatement
src/custom-specs/security-scanner.ts:93:77
   /**
    * Recursively scan an object for security issues (legacy method)
    */
-  private scanObject(obj: any, path: string, issues: SecurityIssue[]): void {
-    if (obj === null || obj === undefined) {
-      return;
-    }
-
-    if (typeof obj === "string") {
-      this.scanString(obj, path, issues);
-    } else if (Array.isArray(obj)) {
-      obj.forEach((item, index) => {
-        this.scanObject(item, `${path}[${index}]`, issues);
-      });
-    } else if (typeof obj === "object") {
-      Object.entries(obj).forEach(([key, value]) => {
-        const newPath = path ? `${path}.${key}` : key;
-        this.scanObject(value, newPath, issues);
-      });
-    }
-  }
+  private scanObject(obj: any, path: string, issues: SecurityIssue[]): void {}
 
   /**

[NoCoverage] ConditionalExpression
src/custom-specs/security-scanner.ts:94:9
    * Recursively scan an object for security issues (legacy method)
    */
   private scanObject(obj: any, path: string, issues: SecurityIssue[]): void {
-    if (obj === null || obj === undefined) {
+    if (false) {
       return;
     }

[NoCoverage] ConditionalExpression
src/custom-specs/security-scanner.ts:94:9
    * Recursively scan an object for security issues (legacy method)
    */
   private scanObject(obj: any, path: string, issues: SecurityIssue[]): void {
-    if (obj === null || obj === undefined) {
+    if (false || obj === undefined) {
       return;
     }

[NoCoverage] BlockStatement
src/custom-specs/security-scanner.ts:100:36
 
     if (typeof obj === "string") {
       this.scanString(obj, path, issues);
-    } else if (Array.isArray(obj)) {
-      obj.forEach((item, index) => {
-        this.scanObject(item, `${path}[${index}]`, issues);
-      });
-    } else if (typeof obj === "object") {
+    } else if (Array.isArray(obj)) {} else if (typeof obj === "object") {
       Object.entries(obj).forEach(([key, value]) => {
         const newPath = path ? `${path}.${key}` : key;

[NoCoverage] BlockStatement
src/custom-specs/security-scanner.ts:101:36
     if (typeof obj === "string") {
       this.scanString(obj, path, issues);
     } else if (Array.isArray(obj)) {
-      obj.forEach((item, index) => {
-        this.scanObject(item, `${path}[${index}]`, issues);
-      });
+      obj.forEach((item, index) => {});
     } else if (typeof obj === "object") {
       Object.entries(obj).forEach(([key, value]) => {

[NoCoverage] ConditionalExpression
src/custom-specs/security-scanner.ts:104:16
       obj.forEach((item, index) => {
         this.scanObject(item, `${path}[${index}]`, issues);
       });
-    } else if (typeof obj === "object") {
+    } else if (true) {
       Object.entries(obj).forEach(([key, value]) => {
         const newPath = path ? `${path}.${key}` : key;

[NoCoverage] BlockStatement
src/custom-specs/security-scanner.ts:105:53
         this.scanObject(item, `${path}[${index}]`, issues);
       });
     } else if (typeof obj === "object") {
-      Object.entries(obj).forEach(([key, value]) => {
-        const newPath = path ? `${path}.${key}` : key;
-        this.scanObject(value, newPath, issues);
-      });
+      Object.entries(obj).forEach(([key, value]) => {});
     }
   }

[Killed] BooleanLiteral
src/custom-specs/security-scanner.ts:124:11
 
     for (const rule of this.rules) {
       // Check if this rule applies to the current context
-      if (!rule.contexts.includes(context)) {
+      if (rule.contexts.includes(context)) {
         continue;
       }
killedBy: SecurityScanner scanSpec should detect script injection in descriptions
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Survived] ConditionalExpression
src/custom-specs/security-scanner.ts:124:11
 
     for (const rule of this.rules) {
       // Check if this rule applies to the current context
-      if (!rule.contexts.includes(context)) {
+      if (false) {
         continue;
       }

[Survived] BooleanLiteral
src/custom-specs/security-scanner.ts:129:21
       }
 
       // Check if pattern matches using custom detect function or regex pattern
-      let isMatch = false;
+      let isMatch = true;
       if (rule.detect) {
         isMatch = rule.detect(value);

[Killed] BlockStatement
src/custom-specs/security-scanner.ts:130:24
 
       // Check if pattern matches using custom detect function or regex pattern
       let isMatch = false;
-      if (rule.detect) {
-        isMatch = rule.detect(value);
-      } else if (rule.pattern) {
+      if (rule.detect) {} else if (rule.pattern) {
         isMatch = rule.pattern.test(value);
       } else {
killedBy: SecurityScanner scanSpec should detect script injection in descriptions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "high"
Received: "low"

[Killed] BlockStatement
src/custom-specs/security-scanner.ts:132:32
       let isMatch = false;
       if (rule.detect) {
         isMatch = rule.detect(value);
-      } else if (rule.pattern) {
-        isMatch = rule.pattern.test(value);
-      } else {
+      } else if (rule.pattern) {} else {
         // Rule must have either detect function or pattern
         continue;
killedBy: SecurityScanner scanSpec should detect prompt injection patterns
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[NoCoverage] BlockStatement
src/custom-specs/security-scanner.ts:134:14
         isMatch = rule.detect(value);
       } else if (rule.pattern) {
         isMatch = rule.pattern.test(value);
-      } else {
-        // Rule must have either detect function or pattern
-        continue;
-      }
+      } else {}
 
       if (isMatch) {

[Killed] ConditionalExpression
src/custom-specs/security-scanner.ts:139:11
         continue;
       }
 
-      if (isMatch) {
+      if (true) {
         // For pattern capture - use detect function result or regex match
         let patternText: string;
killedBy: SecurityScanner scanSpec should return clean result for safe spec
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 50

[Survived] ConditionalExpression
src/custom-specs/security-scanner.ts:142:13
       if (isMatch) {
         // For pattern capture - use detect function result or regex match
         let patternText: string;
-        if (rule.detect) {
+        if (false) {
           // When using detect function, show summary
           if (rule.id === "script-tag-injection") {

[Survived] ConditionalExpression
src/custom-specs/security-scanner.ts:144:15
         let patternText: string;
         if (rule.detect) {
           // When using detect function, show summary
-          if (rule.id === "script-tag-injection") {
+          if (true) {
             patternText = "Script tags detected by XSS filter";
           } else {

[Survived] ConditionalExpression
src/custom-specs/security-scanner.ts:144:15
         let patternText: string;
         if (rule.detect) {
           // When using detect function, show summary
-          if (rule.id === "script-tag-injection") {
+          if (false) {
             patternText = "Script tags detected by XSS filter";
           } else {

[Survived] StringLiteral
src/custom-specs/security-scanner.ts:145:27
         if (rule.detect) {
           // When using detect function, show summary
           if (rule.id === "script-tag-injection") {
-            patternText = "Script tags detected by XSS filter";
+            patternText = "";
           } else {
             patternText = "Detected by custom function";

[NoCoverage] StringLiteral
src/custom-specs/security-scanner.ts:153:25
           const match = rule.pattern.exec(value);
           patternText = match?.[0] || value;
         } else {
-          patternText = "Pattern detected";
+          patternText = "";
         }
 

[Killed] BlockStatement
src/custom-specs/security-scanner.ts:157:60
         }
 
         // Special handling for examples context
-        if (context === "example" && rule.allowInExamples) {
-          // Reduce severity for legitimate examples
-          const adjustedSeverity = this.adjustSeverityForExamples(
-            rule.severity,
-          );
-
-          const baseIssue = {
-            type: rule.type,
-            severity: adjustedSeverity,
-            location,
-            context,
-            pattern: patternText,
-            message: `${rule.message} (in example context)`,
-            ruleId: rule.id,
-          };
-
-          issues.push(
-            rule.suggestion
-              ? { ...baseIssue, suggestion: rule.suggestion }
-              : baseIssue,
-          );
-        } else {
+        if (context === "example" && rule.allowInExamples) {} else {
           const baseIssue = {
             type: rule.type,
killedBy: SecurityScanner scanSpec should detect eval usage in examples
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] EqualityOperator
src/custom-specs/security-scanner.ts:157:13
         }
 
         // Special handling for examples context
-        if (context === "example" && rule.allowInExamples) {
+        if (context !== "example" && rule.allowInExamples) {
           // Reduce severity for legitimate examples
           const adjustedSeverity = this.adjustSeverityForExamples(
killedBy: SecurityScanner scanSpec should detect eval usage in examples
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "low"
Received: "medium"

[Killed] BlockStatement
src/custom-specs/security-scanner.ts:178:16
               ? { ...baseIssue, suggestion: rule.suggestion }
               : baseIssue,
           );
-        } else {
-          const baseIssue = {
-            type: rule.type,
-            severity: rule.severity,
-            location,
-            context,
-            pattern: patternText,
-            message: rule.message,
-            ruleId: rule.id,
-          };
-
-          issues.push(
-            rule.suggestion
-              ? { ...baseIssue, suggestion: rule.suggestion }
-              : baseIssue,
-          );
-        }
+        } else {}
       }
     }
killedBy: SecurityScanner scanSpec should detect script injection in descriptions
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] MethodExpression
src/custom-specs/security-scanner.ts:203:23
    * Determine the context based on the JSON path
    */
   private determineContext(path: string): SecurityIssue["context"] {
-    const lowerPath = path.toLowerCase();
+    const lowerPath = path.toUpperCase();
 
     // Check for more specific contexts first
killedBy: SecurityScanner scanSpec should detect script injection in descriptions
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] LogicalOperator
src/custom-specs/security-scanner.ts:206:9
     const lowerPath = path.toLowerCase();
 
     // Check for more specific contexts first
-    if (lowerPath.includes("example") || lowerPath.includes("examples")) {
+    if (lowerPath.includes("example") && lowerPath.includes("examples")) {
       return "example";
     }
killedBy: SecurityScanner scanSpec should handle nested objects and arrays
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ConditionalExpression
src/custom-specs/security-scanner.ts:206:9
     const lowerPath = path.toLowerCase();
 
     // Check for more specific contexts first
-    if (lowerPath.includes("example") || lowerPath.includes("examples")) {
+    if (false) {
       return "example";
     }
killedBy: SecurityScanner scanSpec should detect eval usage in examples
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] LogicalOperator
src/custom-specs/security-scanner.ts:214:7
     // to handle cases like parameters[0].description
     // But be careful not to match "paths." as "path"
     if (
-      lowerPath.includes("parameter") ||
-      lowerPath.includes("headers") ||
+      lowerPath.includes("parameter") && lowerPath.includes("headers") ||
       lowerPath.includes("query") ||
       (lowerPath.includes("path") && !lowerPath.startsWith("paths."))
killedBy: SecurityScanner scanSpec should categorize issues by context correctly
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ConditionalExpression
src/custom-specs/security-scanner.ts:214:7
     // to handle cases like parameters[0].description
     // But be careful not to match "paths." as "path"
     if (
-      lowerPath.includes("parameter") ||
-      lowerPath.includes("headers") ||
-      lowerPath.includes("query") ||
-      (lowerPath.includes("path") && !lowerPath.startsWith("paths."))
+      true
     ) {
       return "parameter";
killedBy: SecurityScanner scanSpec should categorize issues by context correctly
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] MethodExpression
src/custom-specs/security-scanner.ts:217:39
       lowerPath.includes("parameter") ||
       lowerPath.includes("headers") ||
       lowerPath.includes("query") ||
-      (lowerPath.includes("path") && !lowerPath.startsWith("paths."))
+      (lowerPath.includes("path") && !lowerPath.endsWith("paths."))
     ) {
       return "parameter";
killedBy: SecurityScanner scanSpec should categorize issues by context correctly
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] BooleanLiteral
src/custom-specs/security-scanner.ts:217:38
       lowerPath.includes("parameter") ||
       lowerPath.includes("headers") ||
       lowerPath.includes("query") ||
-      (lowerPath.includes("path") && !lowerPath.startsWith("paths."))
+      (lowerPath.includes("path") && lowerPath.startsWith("paths."))
     ) {
       return "parameter";
killedBy: SecurityScanner scanSpec should categorize issues by context correctly
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] BlockStatement
src/custom-specs/security-scanner.ts:218:7
       lowerPath.includes("headers") ||
       lowerPath.includes("query") ||
       (lowerPath.includes("path") && !lowerPath.startsWith("paths."))
-    ) {
-      return "parameter";
-    }
+    ) {}
 
     if (
killedBy: SecurityScanner scanSpec should categorize issues by context correctly
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ConditionalExpression
src/custom-specs/security-scanner.ts:223:7
     }
 
     if (
-      lowerPath.includes("schema") ||
-      lowerPath.includes("properties") ||
-      lowerPath.includes("items") ||
-      lowerPath.includes("additionalproperties")
+      false
     ) {
       return "schema";
killedBy: SecurityScanner scanSpec should categorize issues by context correctly
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ConditionalExpression
src/custom-specs/security-scanner.ts:223:7
     }
 
     if (
-      lowerPath.includes("schema") ||
-      lowerPath.includes("properties") ||
-      lowerPath.includes("items") ||
+      false ||
       lowerPath.includes("additionalproperties")
     ) {
killedBy: SecurityScanner scanSpec should categorize issues by context correctly
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] StringLiteral
src/custom-specs/security-scanner.ts:224:26
 
     if (
       lowerPath.includes("schema") ||
-      lowerPath.includes("properties") ||
+      lowerPath.includes("") ||
       lowerPath.includes("items") ||
       lowerPath.includes("additionalproperties")
killedBy: SecurityScanner scanSpec should detect prompt injection patterns
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] StringLiteral
src/custom-specs/security-scanner.ts:226:26
       lowerPath.includes("schema") ||
       lowerPath.includes("properties") ||
       lowerPath.includes("items") ||
-      lowerPath.includes("additionalproperties")
+      lowerPath.includes("")
     ) {
       return "schema";
killedBy: SecurityScanner scanSpec should detect prompt injection patterns
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] BlockStatement
src/custom-specs/security-scanner.ts:227:7
       lowerPath.includes("properties") ||
       lowerPath.includes("items") ||
       lowerPath.includes("additionalproperties")
-    ) {
-      return "schema";
-    }
+    ) {}
 
     if (lowerPath.includes("description") || lowerPath.includes("summary")) {
killedBy: SecurityScanner scanSpec should categorize issues by context correctly
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0
