[Killed] ConditionalExpression
src/custom-specs/security-scanner.ts:231:9
       return "schema";
     }
 
-    if (lowerPath.includes("description") || lowerPath.includes("summary")) {
+    if (false) {
       return "description";
     }
killedBy: SecurityScanner scanSpec should detect script injection in descriptions
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] LogicalOperator
src/custom-specs/security-scanner.ts:231:9
       return "schema";
     }
 
-    if (lowerPath.includes("description") || lowerPath.includes("summary")) {
+    if (lowerPath.includes("description") && lowerPath.includes("summary")) {
       return "description";
     }
killedBy: SecurityScanner scanSpec should detect script injection in descriptions
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[NoCoverage] ConditionalExpression
src/custom-specs/security-scanner.ts:245:7
     severity: SecurityIssue["severity"],
   ): SecurityIssue["severity"] {
     switch (severity) {
-      case "critical":
-        return "high";
+      case "critical":
       case "high":
         return "medium";

[NoCoverage] ConditionalExpression
src/custom-specs/security-scanner.ts:247:7
     switch (severity) {
       case "critical":
         return "high";
-      case "high":
-        return "medium";
+      case "high":
       case "medium":
         return "low";

[Survived] ConditionalExpression
src/custom-specs/security-scanner.ts:249:7
         return "high";
       case "high":
         return "medium";
-      case "medium":
-        return "low";
+      case "medium":
       case "low":
         return "low";

[NoCoverage] ConditionalExpression
src/custom-specs/security-scanner.ts:251:7
         return "medium";
       case "medium":
         return "low";
-      case "low":
-        return "low";
+      case "low":
       default:
         return severity;

[Survived] StringLiteral
src/custom-specs/security-scanner.ts:265:13
     return [
       // Script injection patterns
       {
-        id: "script-tag-injection",
+        id: "",
         detect: (content: string) => {
           // Check if content has script tags by comparing filtered vs original

[Killed] ConditionalExpression
src/custom-specs/security-scanner.ts:270:13
           // Check if content has script tags by comparing filtered vs original
           const filtered = xss.filterXSS(content);
           return (
-            content !== filtered && content.toLowerCase().includes("<script")
+            false
           );
         },
killedBy: SecurityScanner scanSpec should detect script injection in descriptions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "high"
Received: "low"

[Killed] MethodExpression
src/custom-specs/security-scanner.ts:270:37
           // Check if content has script tags by comparing filtered vs original
           const filtered = xss.filterXSS(content);
           return (
-            content !== filtered && content.toLowerCase().includes("<script")
+            content !== filtered && content.toUpperCase().includes("<script")
           );
         },
killedBy: SecurityScanner scanSpec should detect script injection in descriptions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "high"
Received: "low"

[Survived] StringLiteral
src/custom-specs/security-scanner.ts:278:22
         contexts: ["description", "example", "parameter", "schema"],
         message: "Script tag detected - potential XSS vector",
         suggestion: "Remove script tags or escape HTML content",
-        description: "Detects HTML script tags that could be used for XSS",
+        description: "",
       },
       {

[Survived] ArrayDeclaration
src/custom-specs/security-scanner.ts:285:19
         pattern: /javascript:/gi,
         type: "script_injection",
         severity: "high",
-        contexts: ["description", "example", "parameter", "schema", "metadata"],
+        contexts: [],
         message: "JavaScript protocol detected",
         suggestion: "Use HTTPS URLs instead of javascript: protocol",

[Survived] Regex
src/custom-specs/security-scanner.ts:293:18
       },
       {
         id: "data-uri-script",
-        pattern: /data:[^,]*text\/html[^,]*,.*<script/gi,
+        pattern: /data:[,]*text\/html[^,]*,.*<script/gi,
         type: "script_injection",
         severity: "high",

[Survived] StringLiteral
src/custom-specs/security-scanner.ts:298:21
         severity: "high",
         contexts: ["description", "example", "parameter", "schema", "metadata"],
         message: "Data URI with script content detected",
-        suggestion: "Avoid data URIs containing scripts",
+        suggestion: "",
         description: "Detects data URIs that contain HTML with script tags",
       },

[Killed] Regex
src/custom-specs/security-scanner.ts:303:18
       },
       {
         id: "eval-function",
-        pattern: /\beval\s*\(/gi,
+        pattern: /\beval\s\(/gi,
         type: "eval_usage",
         severity: "medium",
killedBy: SecurityScanner scanSpec should detect eval usage in examples
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ArrayDeclaration
src/custom-specs/security-scanner.ts:306:19
         pattern: /\beval\s*\(/gi,
         type: "eval_usage",
         severity: "medium",
-        contexts: ["description", "example", "parameter", "schema"],
+        contexts: [],
         allowInExamples: true,
         message: "eval() function detected",
killedBy: SecurityScanner scanSpec should detect eval usage in examples
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] BooleanLiteral
src/custom-specs/security-scanner.ts:307:26
         type: "eval_usage",
         severity: "medium",
         contexts: ["description", "example", "parameter", "schema"],
-        allowInExamples: true,
+        allowInExamples: false,
         message: "eval() function detected",
         suggestion: "Avoid eval() - use safer alternatives like JSON.parse()",
killedBy: SecurityScanner scanSpec should detect eval usage in examples
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "low"
Received: "medium"

[Survived] StringLiteral
src/custom-specs/security-scanner.ts:309:21
         contexts: ["description", "example", "parameter", "schema"],
         allowInExamples: true,
         message: "eval() function detected",
-        suggestion: "Avoid eval() - use safer alternatives like JSON.parse()",
+        suggestion: "",
         description: "Detects eval() function which can execute arbitrary code",
       },

[Survived] StringLiteral
src/custom-specs/security-scanner.ts:313:13
         description: "Detects eval() function which can execute arbitrary code",
       },
       {
-        id: "function-constructor",
+        id: "",
         pattern: /new\s+Function\s*\(/gi,
         type: "eval_usage",

[Survived] Regex
src/custom-specs/security-scanner.ts:314:18
       },
       {
         id: "function-constructor",
-        pattern: /new\s+Function\s*\(/gi,
+        pattern: /new\s+Function\s\(/gi,
         type: "eval_usage",
         severity: "medium",

[Survived] Regex
src/custom-specs/security-scanner.ts:314:18
       },
       {
         id: "function-constructor",
-        pattern: /new\s+Function\s*\(/gi,
+        pattern: /new\S+Function\s*\(/gi,
         type: "eval_usage",
         severity: "medium",

[Survived] StringLiteral
src/custom-specs/security-scanner.ts:322:11
         message: "Function constructor detected",
         suggestion: "Avoid Function constructor - use safer alternatives",
         description:
-          "Detects Function constructor which can execute arbitrary code",
+          "",
       },
 

[Killed] Regex
src/custom-specs/security-scanner.ts:329:11
       {
         id: "prompt-instruction-override",
         pattern:
-          /ignore\s+(?:all\s+)?(?:previous|above|all)?\s*(?:instructions?|prompts?|rules?)(?:\s+and)?/gi,
+          /ignore\s+(?:all\s+)?(?:previous|above|all)?\S*(?:instructions?|prompts?|rules?)(?:\s+and)?/gi,
         type: "prompt_injection",
         severity: "high",
killedBy: SecurityScanner scanSpec should detect prompt injection patterns
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Survived] Regex
src/custom-specs/security-scanner.ts:329:11
       {
         id: "prompt-instruction-override",
         pattern:
-          /ignore\s+(?:all\s+)?(?:previous|above|all)?\s*(?:instructions?|prompts?|rules?)(?:\s+and)?/gi,
+          /ignore\s+(?:all\s+)?(?:previous|above|all)?\s*(?:instructions?|prompts?|rules?)(?:\sand)?/gi,
         type: "prompt_injection",
         severity: "high",

[Killed] ArrayDeclaration
src/custom-specs/security-scanner.ts:332:19
           /ignore\s+(?:all\s+)?(?:previous|above|all)?\s*(?:instructions?|prompts?|rules?)(?:\s+and)?/gi,
         type: "prompt_injection",
         severity: "high",
-        contexts: ["description", "example", "parameter"],
+        contexts: [],
         message: "Prompt instruction override detected",
         suggestion:
killedBy: SecurityScanner scanSpec should detect prompt injection patterns
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Survived] StringLiteral
src/custom-specs/security-scanner.ts:333:18
         type: "prompt_injection",
         severity: "high",
         contexts: ["description", "example", "parameter"],
-        message: "Prompt instruction override detected",
+        message: "",
         suggestion:
           "Remove or rephrase content that attempts to override system instructions",

[Survived] StringLiteral
src/custom-specs/security-scanner.ts:336:22
         message: "Prompt instruction override detected",
         suggestion:
           "Remove or rephrase content that attempts to override system instructions",
-        description: "Detects attempts to override AI system instructions",
+        description: "",
       },
       {

[Survived] Regex
src/custom-specs/security-scanner.ts:341:11
       {
         id: "role-injection",
         pattern:
-          /(act\s+as|you\s+are\s+now|forget\s+you\s+are|pretend\s+to\s+be)/gi,
+          /(act\s+as|you\s+are\s+now|forget\s+you\sare|pretend\s+to\s+be)/gi,
         type: "prompt_injection",
         severity: "medium",

[Survived] Regex
src/custom-specs/security-scanner.ts:341:11
       {
         id: "role-injection",
         pattern:
-          /(act\s+as|you\s+are\s+now|forget\s+you\s+are|pretend\s+to\s+be)/gi,
+          /(act\s+as|you\S+are\s+now|forget\s+you\s+are|pretend\s+to\s+be)/gi,
         type: "prompt_injection",
         severity: "medium",

[Survived] ArrayDeclaration
src/custom-specs/security-scanner.ts:344:19
           /(act\s+as|you\s+are\s+now|forget\s+you\s+are|pretend\s+to\s+be)/gi,
         type: "prompt_injection",
         severity: "medium",
-        contexts: ["description", "example"],
+        contexts: [],
         message: "Role injection pattern detected",
         suggestion: "Rephrase to avoid role manipulation language",

[Survived] Regex
src/custom-specs/security-scanner.ts:352:11
       {
         id: "system-prompt-leak",
         pattern:
-          /(show\s+me\s+your|what\s+are\s+your)\s+(system\s+)?(prompt|instructions|rules)/gi,
+          /(show\s+me\s+your|what\s+are\syour)\s+(system\s+)?(prompt|instructions|rules)/gi,
         type: "prompt_injection",
         severity: "medium",

[Survived] Regex
src/custom-specs/security-scanner.ts:352:11
       {
         id: "system-prompt-leak",
         pattern:
-          /(show\s+me\s+your|what\s+are\s+your)\s+(system\s+)?(prompt|instructions|rules)/gi,
+          /(show\s+me\s+your|what\sare\s+your)\s+(system\s+)?(prompt|instructions|rules)/gi,
         type: "prompt_injection",
         severity: "medium",

[Survived] StringLiteral
src/custom-specs/security-scanner.ts:356:18
         type: "prompt_injection",
         severity: "medium",
         contexts: ["description", "example", "parameter"],
-        message: "System prompt leak attempt detected",
+        message: "",
         suggestion: "Remove attempts to extract system prompts",
         description:

[Survived] Regex
src/custom-specs/security-scanner.ts:366:11
       {
         id: "data-exfiltration",
         pattern:
-          /(send\s+to|POST\s+to|transmit\s+to)\s+[a-zA-Z0-9\-.]+\.(com|net|org|io)/gi,
+          /(send\s+to|POST\s+to|transmit\s+to)\s+[a-zA-Z0-9\-.]\.(com|net|org|io)/gi,
         type: "suspicious_content",
         severity: "medium",

[Survived] Regex
src/custom-specs/security-scanner.ts:366:11
       {
         id: "data-exfiltration",
         pattern:
-          /(send\s+to|POST\s+to|transmit\s+to)\s+[a-zA-Z0-9\-.]+\.(com|net|org|io)/gi,
+          /(send\s+to|POST\S+to|transmit\s+to)\s+[a-zA-Z0-9\-.]+\.(com|net|org|io)/gi,
         type: "suspicious_content",
         severity: "medium",

[Survived] StringLiteral
src/custom-specs/security-scanner.ts:371:21
         severity: "medium",
         contexts: ["description", "example"],
         message: "Potential data exfiltration pattern detected",
-        suggestion: "Review if external data transmission is intentional",
+        suggestion: "",
         description: "Detects patterns that might indicate data exfiltration",
       },

[Survived] StringLiteral
src/custom-specs/security-scanner.ts:375:13
         description: "Detects patterns that might indicate data exfiltration",
       },
       {
-        id: "credential-exposure",
+        id: "",
         pattern: /(password|secret|key|token)\s*[:=]\s*["']?[a-zA-Z0-9]{8,}/gi,
         type: "suspicious_content",

[Killed] Regex
src/custom-specs/security-scanner.ts:376:18
       },
       {
         id: "credential-exposure",
-        pattern: /(password|secret|key|token)\s*[:=]\s*["']?[a-zA-Z0-9]{8,}/gi,
+        pattern: /(password|secret|key|token)\s*[:=]\s*["'][a-zA-Z0-9]{8,}/gi,
         type: "suspicious_content",
         severity: "critical",
killedBy: SecurityScanner scanSpec should calculate summary statistics correctly
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] Regex
src/custom-specs/security-scanner.ts:376:18
       },
       {
         id: "credential-exposure",
-        pattern: /(password|secret|key|token)\s*[:=]\s*["']?[a-zA-Z0-9]{8,}/gi,
+        pattern: /(password|secret|key|token)\s[:=]\s*["']?[a-zA-Z0-9]{8,}/gi,
         type: "suspicious_content",
         severity: "critical",
killedBy: SecurityScanner scanSpec should calculate summary statistics correctly
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Survived] StringLiteral
src/custom-specs/security-scanner.ts:380:18
         type: "suspicious_content",
         severity: "critical",
         contexts: ["description", "example", "parameter", "schema"],
-        message: "Potential credential exposure detected",
+        message: "",
         suggestion: 'Replace with placeholder values like "your_api_key_here"',
         description: "Detects potential hardcoded credentials",

[Survived] StringLiteral
src/custom-specs/security-scanner.ts:381:21
         severity: "critical",
         contexts: ["description", "example", "parameter", "schema"],
         message: "Potential credential exposure detected",
-        suggestion: 'Replace with placeholder values like "your_api_key_here"',
+        suggestion: "",
         description: "Detects potential hardcoded credentials",
       },

[Survived] StringLiteral
src/custom-specs/security-scanner.ts:382:22
         contexts: ["description", "example", "parameter", "schema"],
         message: "Potential credential exposure detected",
         suggestion: 'Replace with placeholder values like "your_api_key_here"',
-        description: "Detects potential hardcoded credentials",
+        description: "",
       },
       {

[Survived] Regex
src/custom-specs/security-scanner.ts:386:18
       },
       {
         id: "base64-encoded-script",
-        pattern: /[a-zA-Z0-9+/]{20,}={0,2}/g,
+        pattern: /[^a-zA-Z0-9+/]{20,}={0,2}/g,
         type: "suspicious_content",
         severity: "low",

[Survived] ArrayDeclaration
src/custom-specs/security-scanner.ts:389:19
         pattern: /[a-zA-Z0-9+/]{20,}={0,2}/g,
         type: "suspicious_content",
         severity: "low",
-        contexts: ["example", "parameter"],
+        contexts: [],
         message: "Potential Base64 encoded content detected",
         suggestion: "Review Base64 content to ensure it's not malicious",

[Killed] Regex
src/custom-specs/security-scanner.ts:399:18
       // HTML/XML injection
       {
         id: "html-injection",
-        pattern: /<[^>]+>/g,
+        pattern: /<[>]+>/g,
         type: "script_injection",
         severity: "low",
killedBy: SecurityScanner scanSpec should categorize issues by context correctly
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ArrayDeclaration
src/custom-specs/security-scanner.ts:402:19
         pattern: /<[^>]+>/g,
         type: "script_injection",
         severity: "low",
-        contexts: ["description", "example", "schema"],
+        contexts: [],
         message: "HTML tags detected",
         suggestion: "Escape HTML content or use plain text",
killedBy: SecurityScanner scanSpec should categorize issues by context correctly
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Survived] StringLiteral
src/custom-specs/security-scanner.ts:403:18
         type: "script_injection",
         severity: "low",
         contexts: ["description", "example", "schema"],
-        message: "HTML tags detected",
+        message: "",
         suggestion: "Escape HTML content or use plain text",
         description: "Detects HTML tags that might be used for injection",

[Survived] StringLiteral
src/custom-specs/security-scanner.ts:404:21
         severity: "low",
         contexts: ["description", "example", "schema"],
         message: "HTML tags detected",
-        suggestion: "Escape HTML content or use plain text",
+        suggestion: "",
         description: "Detects HTML tags that might be used for injection",
       },

[NoCoverage] BlockStatement
src/custom-specs/security-scanner.ts:420:37
   /**
    * Add a custom security rule
    */
-  addRule(rule: SecurityRule): void {
-    this.rules.push(rule);
-  }
+  addRule(rule: SecurityRule): void {}
 
   /**

[NoCoverage] BlockStatement
src/custom-specs/security-scanner.ts:433:30
     let report = `🔒 Security Scan Report\n`;
     report += `Scanned at: ${new Date(scanResult.scannedAt).toLocaleString()}\n\n`;
 
-    if (issues.length === 0) {
-      report += `✅ No security issues found\n`;
-      return report;
-    }
+    if (issues.length === 0) {}
 
     // Summary

[NoCoverage] ConditionalExpression
src/custom-specs/security-scanner.ts:433:9
     let report = `🔒 Security Scan Report\n`;
     report += `Scanned at: ${new Date(scanResult.scannedAt).toLocaleString()}\n\n`;
 
-    if (issues.length === 0) {
+    if (true) {
       report += `✅ No security issues found\n`;
       return report;

[NoCoverage] StringLiteral
src/custom-specs/security-scanner.ts:434:17
     report += `Scanned at: ${new Date(scanResult.scannedAt).toLocaleString()}\n\n`;
 
     if (issues.length === 0) {
-      report += `✅ No security issues found\n`;
+      report += ``;
       return report;
     }

[NoCoverage] StringLiteral
src/custom-specs/security-scanner.ts:439:15
     }
 
     // Summary
-    report += `📊 Summary:\n`;
+    report += ``
     if (summary.critical > 0)
       report += `  🚨 ${summary.critical} critical issue(s)\n`;

[NoCoverage] ConditionalExpression
src/custom-specs/security-scanner.ts:440:9
 
     // Summary
     report += `📊 Summary:\n`;
-    if (summary.critical > 0)
+    if (false)
       report += `  🚨 ${summary.critical} critical issue(s)\n`;
     if (summary.high > 0)

[NoCoverage] ConditionalExpression
src/custom-specs/security-scanner.ts:440:9
 
     // Summary
     report += `📊 Summary:\n`;
-    if (summary.critical > 0)
+    if (true)
       report += `  🚨 ${summary.critical} critical issue(s)\n`;
     if (summary.high > 0)

[NoCoverage] EqualityOperator
src/custom-specs/security-scanner.ts:442:9
     report += `📊 Summary:\n`;
     if (summary.critical > 0)
       report += `  🚨 ${summary.critical} critical issue(s)\n`;
-    if (summary.high > 0)
+    if (summary.high >= 0)
       report += `  ❗ ${summary.high} high severity issue(s)\n`;
     if (summary.medium > 0)

[NoCoverage] ConditionalExpression
src/custom-specs/security-scanner.ts:442:9
     report += `📊 Summary:\n`;
     if (summary.critical > 0)
       report += `  🚨 ${summary.critical} critical issue(s)\n`;
-    if (summary.high > 0)
+    if (true)
       report += `  ❗ ${summary.high} high severity issue(s)\n`;
     if (summary.medium > 0)

[NoCoverage] ConditionalExpression
src/custom-specs/security-scanner.ts:444:9
       report += `  🚨 ${summary.critical} critical issue(s)\n`;
     if (summary.high > 0)
       report += `  ❗ ${summary.high} high severity issue(s)\n`;
-    if (summary.medium > 0)
+    if (true)
       report += `  ⚠️  ${summary.medium} medium severity issue(s)\n`;
     if (summary.low > 0)

[NoCoverage] ConditionalExpression
src/custom-specs/security-scanner.ts:444:9
       report += `  🚨 ${summary.critical} critical issue(s)\n`;
     if (summary.high > 0)
       report += `  ❗ ${summary.high} high severity issue(s)\n`;
-    if (summary.medium > 0)
+    if (false)
       report += `  ⚠️  ${summary.medium} medium severity issue(s)\n`;
     if (summary.low > 0)

[NoCoverage] ConditionalExpression
src/custom-specs/security-scanner.ts:446:9
       report += `  ❗ ${summary.high} high severity issue(s)\n`;
     if (summary.medium > 0)
       report += `  ⚠️  ${summary.medium} medium severity issue(s)\n`;
-    if (summary.low > 0)
+    if (false)
       report += `  ℹ️  ${summary.low} low severity issue(s)\n`;
 

[NoCoverage] EqualityOperator
src/custom-specs/security-scanner.ts:446:9
       report += `  ❗ ${summary.high} high severity issue(s)\n`;
     if (summary.medium > 0)
       report += `  ⚠️  ${summary.medium} medium severity issue(s)\n`;
-    if (summary.low > 0)
+    if (summary.low <= 0)
       report += `  ℹ️  ${summary.low} low severity issue(s)\n`;
 

[NoCoverage] BlockStatement
src/custom-specs/security-scanner.ts:449:18
     if (summary.low > 0)
       report += `  ℹ️  ${summary.low} low severity issue(s)\n`;
 
-    if (blocked) {
-      report += `\n🛑 Import blocked due to critical security issues\n`;
-    }
+    if (blocked) {}
 
     // Detailed issues

[NoCoverage] ConditionalExpression
src/custom-specs/security-scanner.ts:449:9
     if (summary.low > 0)
       report += `  ℹ️  ${summary.low} low severity issue(s)\n`;
 
-    if (blocked) {
+    if (false) {
       report += `\n🛑 Import blocked due to critical security issues\n`;
     }

[NoCoverage] StringLiteral
src/custom-specs/security-scanner.ts:454:15
     }
 
     // Detailed issues
-    report += `\n🔍 Detailed Issues:\n`;
+    report += ``
 
     // Group by severity

[NoCoverage] ArrowFunction
src/custom-specs/security-scanner.ts:458:31
 
     // Group by severity
     const groupedIssues = {
-      critical: issues.filter((i) => i.severity === "critical"),
+      critical: issues.filter(() => undefined),
       high: issues.filter((i) => i.severity === "high"),
       medium: issues.filter((i) => i.severity === "medium"),

[NoCoverage] ConditionalExpression
src/custom-specs/security-scanner.ts:458:38
 
     // Group by severity
     const groupedIssues = {
-      critical: issues.filter((i) => i.severity === "critical"),
+      critical: issues.filter((i) => true),
       high: issues.filter((i) => i.severity === "high"),
       medium: issues.filter((i) => i.severity === "medium"),

[NoCoverage] EqualityOperator
src/custom-specs/security-scanner.ts:459:34
     // Group by severity
     const groupedIssues = {
       critical: issues.filter((i) => i.severity === "critical"),
-      high: issues.filter((i) => i.severity === "high"),
+      high: issues.filter((i) => i.severity !== "high"),
       medium: issues.filter((i) => i.severity === "medium"),
       low: issues.filter((i) => i.severity === "low"),

[NoCoverage] ArrowFunction
src/custom-specs/security-scanner.ts:459:27
     // Group by severity
     const groupedIssues = {
       critical: issues.filter((i) => i.severity === "critical"),
-      high: issues.filter((i) => i.severity === "high"),
+      high: issues.filter(() => undefined),
       medium: issues.filter((i) => i.severity === "medium"),
       low: issues.filter((i) => i.severity === "low"),

[NoCoverage] ConditionalExpression
src/custom-specs/security-scanner.ts:460:36
     const groupedIssues = {
       critical: issues.filter((i) => i.severity === "critical"),
       high: issues.filter((i) => i.severity === "high"),
-      medium: issues.filter((i) => i.severity === "medium"),
+      medium: issues.filter((i) => true),
       low: issues.filter((i) => i.severity === "low"),
     };

[NoCoverage] ArrowFunction
src/custom-specs/security-scanner.ts:460:29
     const groupedIssues = {
       critical: issues.filter((i) => i.severity === "critical"),
       high: issues.filter((i) => i.severity === "high"),
-      medium: issues.filter((i) => i.severity === "medium"),
+      medium: issues.filter(() => undefined),
       low: issues.filter((i) => i.severity === "low"),
     };

[NoCoverage] ConditionalExpression
src/custom-specs/security-scanner.ts:461:33
       critical: issues.filter((i) => i.severity === "critical"),
       high: issues.filter((i) => i.severity === "high"),
       medium: issues.filter((i) => i.severity === "medium"),
-      low: issues.filter((i) => i.severity === "low"),
+      low: issues.filter((i) => true),
     };
 

[NoCoverage] EqualityOperator
src/custom-specs/security-scanner.ts:461:33
       critical: issues.filter((i) => i.severity === "critical"),
       high: issues.filter((i) => i.severity === "high"),
       medium: issues.filter((i) => i.severity === "medium"),
-      low: issues.filter((i) => i.severity === "low"),
+      low: issues.filter((i) => i.severity !== "low"),
     };
 

[NoCoverage] BlockStatement
src/custom-specs/security-scanner.ts:464:77
       low: issues.filter((i) => i.severity === "low"),
     };
 
-    for (const [severity, severityIssues] of Object.entries(groupedIssues)) {
-      if (severityIssues.length === 0) continue;
-
-      const icon = {
-        critical: "🚨",
-        high: "❗",
-        medium: "⚠️",
-        low: "ℹ️",
-      }[severity];
-
-      report += `\n${icon} ${severity.toUpperCase()} SEVERITY:\n`;
-
-      severityIssues.forEach((issue, index) => {
-        report += `  ${index + 1}. ${issue.message}\n`;
-        report += `     Location: ${issue.location}\n`;
-        report += `     Context: ${issue.context}\n`;
-        report += `     Pattern: "${issue.pattern}"\n`;
-        if (issue.suggestion) {
-          report += `     Suggestion: ${issue.suggestion}\n`;
-        }
-        report += `\n`;
-      });
-    }
+    for (const [severity, severityIssues] of Object.entries(groupedIssues)) {}
 
     return report;

[NoCoverage] EqualityOperator
src/custom-specs/security-scanner.ts:465:11
     };
 
     for (const [severity, severityIssues] of Object.entries(groupedIssues)) {
-      if (severityIssues.length === 0) continue;
+      if (severityIssues.length !== 0) continue;
 
       const icon = {

[NoCoverage] ConditionalExpression
src/custom-specs/security-scanner.ts:465:11
     };
 
     for (const [severity, severityIssues] of Object.entries(groupedIssues)) {
-      if (severityIssues.length === 0) continue;
+      if (false) continue;
 
       const icon = {

[NoCoverage] ObjectLiteral
src/custom-specs/security-scanner.ts:467:20
     for (const [severity, severityIssues] of Object.entries(groupedIssues)) {
       if (severityIssues.length === 0) continue;
 
-      const icon = {
-        critical: "🚨",
-        high: "❗",
-        medium: "⚠️",
-        low: "ℹ️",
-      }[severity];
+      const icon = {}[severity];
 
       report += `\n${icon} ${severity.toUpperCase()} SEVERITY:\n`;

[NoCoverage] StringLiteral
src/custom-specs/security-scanner.ts:471:14
         critical: "🚨",
         high: "❗",
         medium: "⚠️",
-        low: "ℹ️",
+        low: "",
       }[severity];
 

[NoCoverage] MethodExpression
src/custom-specs/security-scanner.ts:474:30
         low: "ℹ️",
       }[severity];
 
-      report += `\n${icon} ${severity.toUpperCase()} SEVERITY:\n`;
+      report += `\n${icon} ${severity.toLowerCase()} SEVERITY:\n`;
 
       severityIssues.forEach((issue, index) => {

[NoCoverage] BlockStatement
src/custom-specs/security-scanner.ts:476:48
 
       report += `\n${icon} ${severity.toUpperCase()} SEVERITY:\n`;
 
-      severityIssues.forEach((issue, index) => {
-        report += `  ${index + 1}. ${issue.message}\n`;
-        report += `     Location: ${issue.location}\n`;
-        report += `     Context: ${issue.context}\n`;
-        report += `     Pattern: "${issue.pattern}"\n`;
-        if (issue.suggestion) {
-          report += `     Suggestion: ${issue.suggestion}\n`;
-        }
-        report += `\n`;
-      });
+      severityIssues.forEach((issue, index) => {});
     }
 
