[NoCoverage] ConditionalExpression
src/api/dual-source-client.ts:743:19
               apiId.toLowerCase().includes(queryLower) ||
               Object.values(api.versions).some(
                 (version: ApiGuruApiVersion) =>
-                  version.info.title?.toLowerCase().includes(queryLower) ||
-                  version.info.description
-                    ?.toLowerCase()
-                    .includes(queryLower) ||
-                  version.info["x-providerName"]
-                    ?.toLowerCase()
-                    .includes(queryLower),
+                  true,
               );
 

[NoCoverage] MethodExpression
src/api/dual-source-client.ts:744:19
               Object.values(api.versions).some(
                 (version: ApiGuruApiVersion) =>
                   version.info.title?.toLowerCase().includes(queryLower) ||
-                  version.info.description
-                    ?.toLowerCase()
+                  version.info.description?.toUpperCase()
                     .includes(queryLower) ||
                   version.info["x-providerName"]

[NoCoverage] MethodExpression
src/api/dual-source-client.ts:747:19
                   version.info.description
                     ?.toLowerCase()
                     .includes(queryLower) ||
-                  version.info["x-providerName"]
-                    ?.toLowerCase()
+                  version.info["x-providerName"]?.toUpperCase()
                     .includes(queryLower),
               );

[NoCoverage] StringLiteral
src/api/dual-source-client.ts:747:32
                   version.info.description
                     ?.toLowerCase()
                     .includes(queryLower) ||
-                  version.info["x-providerName"]
+                  version.info[""]
                     ?.toLowerCase()
                     .includes(queryLower),

[Killed] BlockStatement
src/api/dual-source-client.ts:752:26
                     .includes(queryLower),
               );
 
-            if (matches) {
-              matchingAPIs.push([apiId, api]);
-            }
+            if (matches) {}
           }
 
killedBy: DualSourceApiClient searchAPIs should search all sources and merge results
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 2

[Killed] ConditionalExpression
src/api/dual-source-client.ts:752:17
                     .includes(queryLower),
               );
 
-            if (matches) {
+            if (false) {
               matchingAPIs.push([apiId, api]);
             }
killedBy: DualSourceApiClient searchAPIs should search all sources and merge results
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 2

[Survived] StringLiteral
src/api/dual-source-client.ts:775:42
                   "Unknown",
                 preferred: api.preferred,
                 categories:
-                  preferredVersion?.info["x-apisguru-categories"] || [],
+                  preferredVersion?.info[""] || [],
               };
             }),

[Killed] MethodExpression
src/api/dual-source-client.ts:820:30
         };
         if (customResults.status === "fulfilled") {
           const customAPIs = customResults.value as Record<string, ApiGuruAPI>;
-          const queryLower = query.toLowerCase();
+          const queryLower = query.toUpperCase();
           const matchingAPIs: Array<[string, ApiGuruAPI]> = [];
 
killedBy: DualSourceApiClient searchAPIs should search all sources and merge results
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 2

[Killed] BlockStatement
src/api/dual-source-client.ts:823:66
           const queryLower = query.toLowerCase();
           const matchingAPIs: Array<[string, ApiGuruAPI]> = [];
 
-          for (const [apiId, api] of Object.entries(customAPIs)) {
-            // If provider filter is specified, check if API matches
-            if (provider && !apiId.includes(provider)) {
-              continue;
-            }
-
-            // Search in API ID, title, description, and provider name
-            const matches =
-              apiId.toLowerCase().includes(queryLower) ||
-              Object.values(api.versions).some(
-                (version: ApiGuruApiVersion) =>
-                  version.info.title?.toLowerCase().includes(queryLower) ||
-                  version.info.description
-                    ?.toLowerCase()
-                    .includes(queryLower) ||
-                  version.info["x-providerName"]
-                    ?.toLowerCase()
-                    .includes(queryLower),
-              );
-
-            if (matches) {
-              matchingAPIs.push([apiId, api]);
-            }
-          }
+          for (const [apiId, api] of Object.entries(customAPIs)) {}
 
           custom = {
killedBy: DualSourceApiClient searchAPIs should search all sources and merge results
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 2

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:825:56
 
           for (const [apiId, api] of Object.entries(customAPIs)) {
             // If provider filter is specified, check if API matches
-            if (provider && !apiId.includes(provider)) {
-              continue;
-            }
+            if (provider && !apiId.includes(provider)) {}
 
             // Search in API ID, title, description, and provider name

[NoCoverage] ConditionalExpression
src/api/dual-source-client.ts:906:9
     // Check custom first (highest precedence)
     const hasCustom = await this.customClient.hasAPI(apiId);
 
-    if (hasCustom) {
+    if (true) {
       try {
         // Build summary from custom API data

[NoCoverage] ConditionalExpression
src/api/dual-source-client.ts:912:13
         const customAPIs = await this.customClient.listAPIs();
         const api = customAPIs[apiId];
 
-        if (api) {
+        if (true) {
           const preferredVersion = api.versions[api.preferred];
           if (preferredVersion) {

[NoCoverage] ConditionalExpression
src/api/dual-source-client.ts:912:13
         const customAPIs = await this.customClient.listAPIs();
         const api = customAPIs[apiId];
 
-        if (api) {
+        if (false) {
           const preferredVersion = api.versions[api.preferred];
           if (preferredVersion) {

[NoCoverage] ConditionalExpression
src/api/dual-source-client.ts:914:15
 
         if (api) {
           const preferredVersion = api.versions[api.preferred];
-          if (preferredVersion) {
+          if (true) {
             const info = preferredVersion.info;
 

[NoCoverage] ConditionalExpression
src/api/dual-source-client.ts:914:15
 
         if (api) {
           const preferredVersion = api.versions[api.preferred];
-          if (preferredVersion) {
+          if (false) {
             const info = preferredVersion.info;
 

[NoCoverage] ConditionalExpression
src/api/dual-source-client.ts:919:22
 
             return {
               id: apiId,
-              title: info.title || "Untitled API",
+              title: false,
               description: info.description || "No description available",
               provider:

[NoCoverage] ConditionalExpression
src/api/dual-source-client.ts:919:22
 
             return {
               id: apiId,
-              title: info.title || "Untitled API",
+              title: true,
               description: info.description || "No description available",
               provider:

[NoCoverage] ConditionalExpression
src/api/dual-source-client.ts:920:28
             return {
               id: apiId,
               title: info.title || "Untitled API",
-              description: info.description || "No description available",
+              description: true,
               provider:
                 info["x-providerName"] || apiId.split(":")[0] || "Unknown",

[NoCoverage] LogicalOperator
src/api/dual-source-client.ts:920:28
             return {
               id: apiId,
               title: info.title || "Untitled API",
-              description: info.description || "No description available",
+              description: info.description && "No description available",
               provider:
                 info["x-providerName"] || apiId.split(":")[0] || "Unknown",

[NoCoverage] LogicalOperator
src/api/dual-source-client.ts:922:17
               title: info.title || "Untitled API",
               description: info.description || "No description available",
               provider:
-                info["x-providerName"] || apiId.split(":")[0] || "Unknown",
+                (info["x-providerName"] || apiId.split(":")[0]) && "Unknown",
               versions: Object.keys(api.versions),
               preferred_version: api.preferred,

[NoCoverage] ConditionalExpression
src/api/dual-source-client.ts:922:17
               title: info.title || "Untitled API",
               description: info.description || "No description available",
               provider:
-                info["x-providerName"] || apiId.split(":")[0] || "Unknown",
+                true,
               versions: Object.keys(api.versions),
               preferred_version: api.preferred,

[NoCoverage] StringLiteral
src/api/dual-source-client.ts:927:26
               preferred_version: api.preferred,
               base_url: preferredVersion.swaggerUrl
                 .replace("/swagger.json", "")
-                .replace("/swagger.yaml", ""),
+                .replace("", ""),
               categories: info["x-apisguru-categories"] || [],
               authentication: {

[NoCoverage] LogicalOperator
src/api/dual-source-client.ts:928:27
               base_url: preferredVersion.swaggerUrl
                 .replace("/swagger.json", "")
                 .replace("/swagger.yaml", ""),
-              categories: info["x-apisguru-categories"] || [],
+              categories: info["x-apisguru-categories"] && [],
               authentication: {
                 type: "See OpenAPI spec",

[NoCoverage] ConditionalExpression
src/api/dual-source-client.ts:928:27
               base_url: preferredVersion.swaggerUrl
                 .replace("/swagger.json", "")
                 .replace("/swagger.yaml", ""),
-              categories: info["x-apisguru-categories"] || [],
+              categories: true,
               authentication: {
                 type: "See OpenAPI spec",

[NoCoverage] ObjectLiteral
src/api/dual-source-client.ts:929:31
                 .replace("/swagger.json", "")
                 .replace("/swagger.yaml", ""),
               categories: info["x-apisguru-categories"] || [],
-              authentication: {
-                type: "See OpenAPI spec",
-                description:
-                  "Authentication details available in the full specification",
-              },
+              authentication: {},
               updated: preferredVersion.updated,
               added: preferredVersion.added,

[NoCoverage] LogicalOperator
src/api/dual-source-client.ts:938:34
               added: preferredVersion.added,
               contact: info.contact,
               license: info.license,
-              documentation_url: preferredVersion.link || info.contact?.url,
+              documentation_url: preferredVersion.link && info.contact?.url,
               homepage_url: info.contact?.url,
             };

[NoCoverage] ConditionalExpression
src/api/dual-source-client.ts:938:34
               added: preferredVersion.added,
               contact: info.contact,
               license: info.license,
-              documentation_url: preferredVersion.link || info.contact?.url,
+              documentation_url: false,
               homepage_url: info.contact?.url,
             };

[NoCoverage] OptionalChaining
src/api/dual-source-client.ts:939:29
               contact: info.contact,
               license: info.license,
               documentation_url: preferredVersion.link || info.contact?.url,
-              homepage_url: info.contact?.url,
+              homepage_url: info.contact.url,
             };
           }

[NoCoverage] ConditionalExpression
src/api/dual-source-client.ts:965:28
             return {
               id: apiId,
               title: info.title || "Untitled API",
-              description: info.description || "No description available",
+              description: false,
               provider:
                 info["x-providerName"] || apiId.split(":")[0] || "Unknown",

[NoCoverage] StringLiteral
src/api/dual-source-client.ts:971:43
               versions: Object.keys(api.versions),
               preferred_version: api.preferred,
               base_url: preferredVersion.swaggerUrl
-                .replace("/swagger.json", "")
+                .replace("/swagger.json", "Stryker was here!")
                 .replace("/swagger.yaml", ""),
               categories: info["x-apisguru-categories"] || [],

[NoCoverage] ConditionalExpression
src/api/dual-source-client.ts:973:27
               base_url: preferredVersion.swaggerUrl
                 .replace("/swagger.json", "")
                 .replace("/swagger.yaml", ""),
-              categories: info["x-apisguru-categories"] || [],
+              categories: false,
               authentication: {
                 type: "See OpenAPI spec",

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:1005:20
     // Check custom first (highest precedence)
     const hasCustom = await this.customClient.hasAPI(apiId);
 
-    if (hasCustom) {
-      try {
-        return await this.customClient.getAPIEndpoints(apiId, page, limit, tag);
-      } catch (error) {
-        // Fallback to secondary/primary
-      }
-    }
+    if (hasCustom) {}
 
     // Check secondary next

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:1006:11
     const hasCustom = await this.customClient.hasAPI(apiId);
 
     if (hasCustom) {
-      try {
-        return await this.customClient.getAPIEndpoints(apiId, page, limit, tag);
-      } catch (error) {
+      try {} catch (error) {
         // Fallback to secondary/primary
       }

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:1016:23
     // Check secondary next
     const hasSecondary = await this.secondaryClient.hasAPI(apiId);
 
-    if (hasSecondary) {
-      try {
-        // Try secondary client first, fall back to primary if method doesn't exist
-        if (typeof this.secondaryClient.getAPIEndpoints === "function") {
-          return await this.secondaryClient.getAPIEndpoints(
-            apiId,
-            page,
-            limit,
-            tag,
-          );
-        } else {
-          // Secondary client doesn't have getAPIEndpoints, use primary with secondary data
-          return await this.primaryClient.getAPIEndpoints(
-            apiId,
-            page,
-            limit,
-            tag,
-          );
-        }
-      } catch (error) {
-        // Fallback to primary
-      }
-    }
+    if (hasSecondary) {}
 
     return await this.primaryClient.getAPIEndpoints(apiId, page, limit, tag);

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:1017:11
     const hasSecondary = await this.secondaryClient.hasAPI(apiId);
 
     if (hasSecondary) {
-      try {
-        // Try secondary client first, fall back to primary if method doesn't exist
-        if (typeof this.secondaryClient.getAPIEndpoints === "function") {
-          return await this.secondaryClient.getAPIEndpoints(
-            apiId,
-            page,
-            limit,
-            tag,
-          );
-        } else {
-          // Secondary client doesn't have getAPIEndpoints, use primary with secondary data
-          return await this.primaryClient.getAPIEndpoints(
-            apiId,
-            page,
-            limit,
-            tag,
-          );
-        }
-      } catch (error) {
+      try {} catch (error) {
         // Fallback to primary
       }

[NoCoverage] ConditionalExpression
src/api/dual-source-client.ts:1019:13
     if (hasSecondary) {
       try {
         // Try secondary client first, fall back to primary if method doesn't exist
-        if (typeof this.secondaryClient.getAPIEndpoints === "function") {
+        if (true) {
           return await this.secondaryClient.getAPIEndpoints(
             apiId,

[NoCoverage] ConditionalExpression
src/api/dual-source-client.ts:1019:13
     if (hasSecondary) {
       try {
         // Try secondary client first, fall back to primary if method doesn't exist
-        if (typeof this.secondaryClient.getAPIEndpoints === "function") {
+        if (false) {
           return await this.secondaryClient.getAPIEndpoints(
             apiId,

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:1026:16
             limit,
             tag,
           );
-        } else {
-          // Secondary client doesn't have getAPIEndpoints, use primary with secondary data
-          return await this.primaryClient.getAPIEndpoints(
-            apiId,
-            page,
-            limit,
-            tag,
-          );
-        }
+        } else {}
       } catch (error) {
         // Fallback to primary

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:1047:19
     apiId: string,
     method: string,
     path: string,
-  ): Promise<any> {
-    // Check custom first (highest precedence)
-    const hasCustom = await this.customClient.hasAPI(apiId);
-
-    if (hasCustom) {
-      try {
-        return await this.customClient.getEndpointDetails(apiId, method, path);
-      } catch (error) {
-        // Fallback to secondary/primary if custom implementation fails
-      }
-    }
-
-    // Check secondary next
-    const hasSecondary = await this.secondaryClient.hasAPI(apiId);
-
-    if (hasSecondary) {
-      try {
-        return await this.primaryClient.getEndpointDetails(apiId, method, path);
-      } catch (error) {
-        // Fallback to primary
-      }
-    }
-
-    return await this.primaryClient.getEndpointDetails(apiId, method, path);
-  }
+  ): Promise<any> {}
 
   async getEndpointSchema(

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:1051:20
     // Check custom first (highest precedence)
     const hasCustom = await this.customClient.hasAPI(apiId);
 
-    if (hasCustom) {
-      try {
-        return await this.customClient.getEndpointDetails(apiId, method, path);
-      } catch (error) {
-        // Fallback to secondary/primary if custom implementation fails
-      }
-    }
+    if (hasCustom) {}
 
     // Check secondary next

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:1052:11
     const hasCustom = await this.customClient.hasAPI(apiId);
 
     if (hasCustom) {
-      try {
-        return await this.customClient.getEndpointDetails(apiId, method, path);
-      } catch (error) {
+      try {} catch (error) {
         // Fallback to secondary/primary if custom implementation fails
       }

[NoCoverage] ConditionalExpression
src/api/dual-source-client.ts:1062:9
     // Check secondary next
     const hasSecondary = await this.secondaryClient.hasAPI(apiId);
 
-    if (hasSecondary) {
+    if (false) {
       try {
         return await this.primaryClient.getEndpointDetails(apiId, method, path);

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:1062:23
     // Check secondary next
     const hasSecondary = await this.secondaryClient.hasAPI(apiId);
 
-    if (hasSecondary) {
-      try {
-        return await this.primaryClient.getEndpointDetails(apiId, method, path);
-      } catch (error) {
-        // Fallback to primary
-      }
-    }
+    if (hasSecondary) {}
 
     return await this.primaryClient.getEndpointDetails(apiId, method, path);

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:1063:11
     const hasSecondary = await this.secondaryClient.hasAPI(apiId);
 
     if (hasSecondary) {
-      try {
-        return await this.primaryClient.getEndpointDetails(apiId, method, path);
-      } catch (error) {
+      try {} catch (error) {
         // Fallback to primary
       }

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:1077:19
     apiId: string,
     method: string,
     path: string,
-  ): Promise<any> {
-    // Check custom first (highest precedence)
-    const hasCustom = await this.customClient.hasAPI(apiId);
-
-    if (hasCustom) {
-      try {
-        return await this.primaryClient.getEndpointSchema(apiId, method, path); // Use primary implementation
-      } catch (error) {
-        // Fallback to secondary/primary
-      }
-    }
-
-    // Check secondary next
-    const hasSecondary = await this.secondaryClient.hasAPI(apiId);
-
-    if (hasSecondary) {
-      try {
-        return await this.primaryClient.getEndpointSchema(apiId, method, path); // Use primary implementation
-      } catch (error) {
-        // Fallback to primary
-      }
-    }
-
-    return await this.primaryClient.getEndpointSchema(apiId, method, path);
-  }
+  ): Promise<any> {}
 
   async getEndpointExamples(

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:1081:20
     // Check custom first (highest precedence)
     const hasCustom = await this.customClient.hasAPI(apiId);
 
-    if (hasCustom) {
-      try {
-        return await this.primaryClient.getEndpointSchema(apiId, method, path); // Use primary implementation
-      } catch (error) {
-        // Fallback to secondary/primary
-      }
-    }
+    if (hasCustom) {}
 
     // Check secondary next

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:1082:11
     const hasCustom = await this.customClient.hasAPI(apiId);
 
     if (hasCustom) {
-      try {
-        return await this.primaryClient.getEndpointSchema(apiId, method, path); // Use primary implementation
-      } catch (error) {
+      try {} catch (error) {
         // Fallback to secondary/primary
       }

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:1092:23
     // Check secondary next
     const hasSecondary = await this.secondaryClient.hasAPI(apiId);
 
-    if (hasSecondary) {
-      try {
-        return await this.primaryClient.getEndpointSchema(apiId, method, path); // Use primary implementation
-      } catch (error) {
-        // Fallback to primary
-      }
-    }
+    if (hasSecondary) {}
 
     return await this.primaryClient.getEndpointSchema(apiId, method, path);

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:1093:11
     const hasSecondary = await this.secondaryClient.hasAPI(apiId);
 
     if (hasSecondary) {
-      try {
-        return await this.primaryClient.getEndpointSchema(apiId, method, path); // Use primary implementation
-      } catch (error) {
+      try {} catch (error) {
         // Fallback to primary
       }

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:1111:20
     // Check custom first (highest precedence)
     const hasCustom = await this.customClient.hasAPI(apiId);
 
-    if (hasCustom) {
-      try {
-        return await this.primaryClient.getEndpointExamples(
-          apiId,
-          method,
-          path,
-        ); // Use primary implementation
-      } catch (error) {
-        // Fallback to secondary/primary
-      }
-    }
+    if (hasCustom) {}
 
     // Check secondary next

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:1112:11
     const hasCustom = await this.customClient.hasAPI(apiId);
 
     if (hasCustom) {
-      try {
-        return await this.primaryClient.getEndpointExamples(
-          apiId,
-          method,
-          path,
-        ); // Use primary implementation
-      } catch (error) {
+      try {} catch (error) {
         // Fallback to secondary/primary
       }

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:1127:11
     const hasSecondary = await this.secondaryClient.hasAPI(apiId);
 
     if (hasSecondary) {
-      try {
-        return await this.primaryClient.getEndpointExamples(
-          apiId,
-          method,
-          path,
-        ); // Use primary implementation
-      } catch (error) {
+      try {} catch (error) {
         // Fallback to primary
       }

[NoCoverage] ConditionalExpression
src/api/dual-source-client.ts:1143:9
 
   async getOpenAPISpec(url: string): Promise<any> {
     // Check if this is a custom API ID (format: custom:name:version)
-    if (url.startsWith("custom:")) {
+    if (true) {
       const hasCustom = await this.customClient.hasAPI(url);
 

[NoCoverage] MethodExpression
src/api/dual-source-client.ts:1143:9
 
   async getOpenAPISpec(url: string): Promise<any> {
     // Check if this is a custom API ID (format: custom:name:version)
-    if (url.startsWith("custom:")) {
+    if (url.endsWith("custom:")) {
       const hasCustom = await this.customClient.hasAPI(url);
 

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:1147:13
       const hasCustom = await this.customClient.hasAPI(url);
 
       if (hasCustom) {
-        try {
-          // Extract name and version from the API ID
-          const [, name, version] = url.split(":");
-          if (!name || !version) {
-            throw new Error(
-              `Invalid custom API ID format: ${url}. Expected format: custom:name:version`,
-            );
-          }
-
-          // Get the OpenAPI spec from the custom client
-          const manifestManager = this.customClient.getManifestManager();
-          const specContent = manifestManager.readSpecFile(name, version);
-          const apiData = JSON.parse(specContent);
-
-          // Navigate to the actual OpenAPI spec (handle ApiGuruAPI format)
-          const preferredVersion = apiData.versions[apiData.preferred];
-          if (!preferredVersion || !preferredVersion.spec) {
-            throw new Error(`OpenAPI spec not available for: ${url}`);
-          }
-
-          return preferredVersion.spec;
-        } catch (error) {
+        try {} catch (error) {
           throw new Error(
             `Failed to load custom API spec: ${error instanceof Error ? error.message : String(error)}`,

[NoCoverage] StringLiteral
src/api/dual-source-client.ts:1149:47
       if (hasCustom) {
         try {
           // Extract name and version from the API ID
-          const [, name, version] = url.split(":");
+          const [, name, version] = url.split("");
           if (!name || !version) {
             throw new Error(

[NoCoverage] StringLiteral
src/api/dual-source-client.ts:1152:15
           const [, name, version] = url.split(":");
           if (!name || !version) {
             throw new Error(
-              `Invalid custom API ID format: ${url}. Expected format: custom:name:version`,
+              ``,
             );
           }

[NoCoverage] BooleanLiteral
src/api/dual-source-client.ts:1163:15
 
           // Navigate to the actual OpenAPI spec (handle ApiGuruAPI format)
           const preferredVersion = apiData.versions[apiData.preferred];
-          if (!preferredVersion || !preferredVersion.spec) {
+          if (preferredVersion || !preferredVersion.spec) {
             throw new Error(`OpenAPI spec not available for: ${url}`);
           }

[NoCoverage] LogicalOperator
src/api/dual-source-client.ts:1163:15
 
           // Navigate to the actual OpenAPI spec (handle ApiGuruAPI format)
           const preferredVersion = apiData.versions[apiData.preferred];
-          if (!preferredVersion || !preferredVersion.spec) {
+          if (!preferredVersion && !preferredVersion.spec) {
             throw new Error(`OpenAPI spec not available for: ${url}`);
           }

[NoCoverage] StringLiteral
src/api/dual-source-client.ts:1164:29
           // Navigate to the actual OpenAPI spec (handle ApiGuruAPI format)
           const preferredVersion = apiData.versions[apiData.preferred];
           if (!preferredVersion || !preferredVersion.spec) {
-            throw new Error(`OpenAPI spec not available for: ${url}`);
+            throw new Error(``);
           }
 

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:1168:25
           }
 
           return preferredVersion.spec;
-        } catch (error) {
-          throw new Error(
-            `Failed to load custom API spec: ${error instanceof Error ? error.message : String(error)}`,
-          );
-        }
+        } catch (error) {}
       } else {
         throw new Error(`Custom API not found: ${url}`);

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:1173:14
             `Failed to load custom API spec: ${error instanceof Error ? error.message : String(error)}`,
           );
         }
-      } else {
-        throw new Error(`Custom API not found: ${url}`);
-      }
+      } else {}
     }
 

[NoCoverage] StringLiteral
src/api/dual-source-client.ts:1174:25
           );
         }
       } else {
-        throw new Error(`Custom API not found: ${url}`);
+        throw new Error(``);
       }
     }

[NoCoverage] MethodExpression
src/api/dual-source-client.ts:1188:28
     const apiEntries = Object.entries(allAPIs);
     const scored = apiEntries.map(([id, api]) => {
       const versionCount = Object.keys(api.versions).length;
-      const latestUpdate = Math.max(
-        ...Object.values(api.versions).map((v) =>
-          new Date(v.updated).getTime(),
-        ),
-      );
+      const latestUpdate = Math.min(...Object.values(api.versions).map(v => new Date(v.updated).getTime()));
 
       const score = versionCount * 10 + latestUpdate / 1000000;

[NoCoverage] MethodExpression
src/api/dual-source-client.ts:1198:21
       return { id, api, score };
     });
 
-    const popular = scored
-      .sort((a, b) => b.score - a.score)
+    const popular = scored
       .slice(0, 20)
       .reduce(
