[NoCoverage] StringLiteral
src/custom-specs/security-scanner.ts:477:19
       report += `\n${icon} ${severity.toUpperCase()} SEVERITY:\n`;
 
       severityIssues.forEach((issue, index) => {
-        report += `  ${index + 1}. ${issue.message}\n`;
+        report += ``;
         report += `     Location: ${issue.location}\n`;
         report += `     Context: ${issue.context}\n`;

[NoCoverage] StringLiteral
src/custom-specs/security-scanner.ts:479:19
       severityIssues.forEach((issue, index) => {
         report += `  ${index + 1}. ${issue.message}\n`;
         report += `     Location: ${issue.location}\n`;
-        report += `     Context: ${issue.context}\n`;
+        report += ``;
         report += `     Pattern: "${issue.pattern}"\n`;
         if (issue.suggestion) {

[NoCoverage] ConditionalExpression
src/custom-specs/security-scanner.ts:481:13
         report += `     Location: ${issue.location}\n`;
         report += `     Context: ${issue.context}\n`;
         report += `     Pattern: "${issue.pattern}"\n`;
-        if (issue.suggestion) {
+        if (true) {
           report += `     Suggestion: ${issue.suggestion}\n`;
         }

[NoCoverage] BlockStatement
src/custom-specs/security-scanner.ts:481:31
         report += `     Location: ${issue.location}\n`;
         report += `     Context: ${issue.context}\n`;
         report += `     Pattern: "${issue.pattern}"\n`;
-        if (issue.suggestion) {
-          report += `     Suggestion: ${issue.suggestion}\n`;
-        }
+        if (issue.suggestion) {}
         report += `\n`;
       });
