[NoCoverage] MethodExpression
src/api/dual-source-client.ts:1198:21
       return { id, api, score };
     });
 
-    const popular = scored
-      .sort((a, b) => b.score - a.score)
-      .slice(0, 20)
+    const popular = scored.sort((a, b) => b.score - a.score)
       .reduce(
         (acc, { id, api }) => {

[NoCoverage] MethodExpression
src/api/dual-source-client.ts:1219:28
     const allAPIs = await this.listAPIs();
     const apiEntries = Object.entries(allAPIs);
     const withLatestUpdate = apiEntries.map(([id, api]) => {
-      const latestUpdate = Math.max(
-        ...Object.values(api.versions).map((v) =>
-          new Date(v.updated).getTime(),
-        ),
-      );
+      const latestUpdate = Math.min(...Object.values(api.versions).map(v => new Date(v.updated).getTime()));
       return { id, api, updated: latestUpdate };
     });

[NoCoverage] MethodExpression
src/api/dual-source-client.ts:1227:20
       return { id, api, updated: latestUpdate };
     });
 
-    const recent = withLatestUpdate
-      .sort((a, b) => b.updated - a.updated)
-      .slice(0, limit)
+    const recent = withLatestUpdate.sort((a, b) => b.updated - a.updated)
       .reduce(
         (acc, { id, api }) => {

[NoCoverage] MethodExpression
src/api/dual-source-client.ts:1227:20
       return { id, api, updated: latestUpdate };
     });
 
-    const recent = withLatestUpdate
-      .sort((a, b) => b.updated - a.updated)
+    const recent = withLatestUpdate
       .slice(0, limit)
       .reduce(

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:1256:38
   /**
    * Invalidate caches that depend on custom specs
    */
-  invalidateCustomSpecCaches(): void {
-    // Invalidate custom spec caches
-    this.customClient.invalidateCache();
-
-    // Invalidate aggregated caches that include custom spec data
-    const aggregatedKeys = [
-      "triple:providers",
-      "triple:all_apis",
-      "triple:metrics",
-      "triple:api_summary",
-    ];
-
-    this.cache.invalidateKeys(aggregatedKeys);
-
-    // Also invalidate paginated and search caches since they include custom data
-    this.cache.invalidatePattern("triple:paginated_apis:*");
-    this.cache.invalidatePattern("triple:search:*");
-  }
+  invalidateCustomSpecCaches(): void {}
 
   /**

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:1278:45
   /**
    * Warm critical caches after custom spec changes
    */
-  async warmCriticalCaches(): Promise<void> {
-    try {
-      // Warm the most commonly accessed caches
-      await Promise.allSettled([
-        this.cache.warmCache("triple:providers", () => this.getProviders()),
-        this.cache.warmCache("triple:metrics", () => this.getMetrics(), 300000), // 5 minutes TTL
-        this.cache.warmCache("triple:all_apis", () => this.listAPIs()),
-      ]);
-
-      // Critical caches warmed successfully
-    } catch (error) {
-      // Cache warming failed - continue silently
-    }
-  }
+  async warmCriticalCaches(): Promise<void> {}
 }
 

[NoCoverage] BlockStatement
src/api/dual-source-client.ts:1279:9
    * Warm critical caches after custom spec changes
    */
   async warmCriticalCaches(): Promise<void> {
-    try {
-      // Warm the most commonly accessed caches
-      await Promise.allSettled([
-        this.cache.warmCache("triple:providers", () => this.getProviders()),
-        this.cache.warmCache("triple:metrics", () => this.getMetrics(), 300000), // 5 minutes TTL
-        this.cache.warmCache("triple:all_apis", () => this.listAPIs()),
-      ]);
-
-      // Critical caches warmed successfully
-    } catch (error) {
+    try {} catch (error) {
       // Cache warming failed - continue silently
     }

[NoCoverage] ArrayDeclaration
src/api/dual-source-client.ts:1281:32
   async warmCriticalCaches(): Promise<void> {
     try {
       // Warm the most commonly accessed caches
-      await Promise.allSettled([
-        this.cache.warmCache("triple:providers", () => this.getProviders()),
-        this.cache.warmCache("triple:metrics", () => this.getMetrics(), 300000), // 5 minutes TTL
-        this.cache.warmCache("triple:all_apis", () => this.listAPIs()),
-      ]);
+      await Promise.allSettled([]);
 
       // Critical caches warmed successfully

[NoCoverage] StringLiteral
src/api/dual-source-client.ts:1282:30
     try {
       // Warm the most commonly accessed caches
       await Promise.allSettled([
-        this.cache.warmCache("triple:providers", () => this.getProviders()),
+        this.cache.warmCache("", () => this.getProviders()),
         this.cache.warmCache("triple:metrics", () => this.getMetrics(), 300000), // 5 minutes TTL
         this.cache.warmCache("triple:all_apis", () => this.listAPIs()),
