[NoCoverage] BooleanLiteral
src/utils/validation.ts:20:9
    * Validate file path for security
    */
   static validatePath(path: string): void {
-    if (!path) {
+    if (path) {
       throw new ValidationError("Path cannot be empty");
     }

[NoCoverage] BlockStatement
src/utils/validation.ts:20:16
    * Validate file path for security
    */
   static validatePath(path: string): void {
-    if (!path) {
-      throw new ValidationError("Path cannot be empty");
-    }
+    if (!path) {}
 
     if (path.length > VALIDATION.MAX_PATH_LENGTH) {

[NoCoverage] ConditionalExpression
src/utils/validation.ts:24:9
       throw new ValidationError("Path cannot be empty");
     }
 
-    if (path.length > VALIDATION.MAX_PATH_LENGTH) {
+    if (false) {
       throw new ValidationError(
         `Path too long (max ${VALIDATION.MAX_PATH_LENGTH} characters)`,

[NoCoverage] BlockStatement
src/utils/validation.ts:24:51
       throw new ValidationError("Path cannot be empty");
     }
 
-    if (path.length > VALIDATION.MAX_PATH_LENGTH) {
-      throw new ValidationError(
-        `Path too long (max ${VALIDATION.MAX_PATH_LENGTH} characters)`,
-      );
-    }
+    if (path.length > VALIDATION.MAX_PATH_LENGTH) {}
 
     // Check for path traversal attempts

[NoCoverage] StringLiteral
src/utils/validation.ts:26:9
 
     if (path.length > VALIDATION.MAX_PATH_LENGTH) {
       throw new ValidationError(
-        `Path too long (max ${VALIDATION.MAX_PATH_LENGTH} characters)`,
+        ``,
       );
     }

[NoCoverage] BlockStatement
src/utils/validation.ts:31:52
     }
 
     // Check for path traversal attempts
-    if (path.includes("..") || path.includes("~")) {
-      throw new ValidationError("Path traversal detected");
-    }
+    if (path.includes("..") || path.includes("~")) {}
 
     // Check for suspicious characters

[NoCoverage] ConditionalExpression
src/utils/validation.ts:31:9
     }
 
     // Check for path traversal attempts
-    if (path.includes("..") || path.includes("~")) {
+    if (false) {
       throw new ValidationError("Path traversal detected");
     }

[NoCoverage] ConditionalExpression
src/utils/validation.ts:36:9
     }
 
     // Check for suspicious characters
-    if (!VALIDATION.ALLOWED_PATH_CHARS.test(path)) {
+    if (false) {
       throw new ValidationError("Path contains invalid characters");
     }

[NoCoverage] BooleanLiteral
src/utils/validation.ts:36:9
     }
 
     // Check for suspicious characters
-    if (!VALIDATION.ALLOWED_PATH_CHARS.test(path)) {
+    if (VALIDATION.ALLOWED_PATH_CHARS.test(path)) {
       throw new ValidationError("Path contains invalid characters");
     }

[NoCoverage] BooleanLiteral
src/utils/validation.ts:41:33
     }
 
     // Check for absolute paths outside allowed directories
-    if (path.startsWith("/") && !PathValidator.isAllowedAbsolutePath(path)) {
+    if (path.startsWith("/") && PathValidator.isAllowedAbsolutePath(path)) {
       throw new ValidationError("Absolute path not allowed");
     }

[NoCoverage] MethodExpression
src/utils/validation.ts:41:9
     }
 
     // Check for absolute paths outside allowed directories
-    if (path.startsWith("/") && !PathValidator.isAllowedAbsolutePath(path)) {
+    if (path.endsWith("/") && !PathValidator.isAllowedAbsolutePath(path)) {
       throw new ValidationError("Absolute path not allowed");
     }

[NoCoverage] MethodExpression
src/utils/validation.ts:57:45
       homedir(), // Allow home directory for cache files
     ];
 
-    return allowedPrefixes.some((prefix) => path.startsWith(prefix));
+    return allowedPrefixes.some((prefix) => path.endsWith(prefix));
   }
 

[NoCoverage] ArrowFunction
src/utils/validation.ts:57:33
       homedir(), // Allow home directory for cache files
     ];
 
-    return allowedPrefixes.some((prefix) => path.startsWith(prefix));
+    return allowedPrefixes.some(() => undefined);
   }
 

[NoCoverage] MethodExpression
src/utils/validation.ts:64:12
    * Sanitize path for safe usage
    */
   static sanitizePath(path: string): string {
-    return path
-      .replace(/\.\./g, "") // Remove path traversal
-      .replace(/[<>:"|?*]/g, "") // Remove invalid filename chars
-      .replace(/\s+/g, "_") // Replace spaces with underscores
-      .toLowerCase();
+    return path.replace(/\.\./g, "") // Remove path traversal
+.replace(/[<>:"|?*]/g, "") // Remove invalid filename chars
+.replace(/\s+/g, "_") // Replace spaces with underscores
+.toUpperCase();
   }
 

[NoCoverage] StringLiteral
src/utils/validation.ts:67:24
     return path
       .replace(/\.\./g, "") // Remove path traversal
       .replace(/[<>:"|?*]/g, "") // Remove invalid filename chars
-      .replace(/\s+/g, "_") // Replace spaces with underscores
+      .replace(/\s+/g, "") // Replace spaces with underscores
       .toLowerCase();
   }

[NoCoverage] BlockStatement
src/utils/validation.ts:77:11
   static validateFileExtension(
     path: string,
     allowedExtensions: readonly string[],
-  ): void {
-    const extension = path.toLowerCase().substring(path.lastIndexOf("."));
-
-    if (!allowedExtensions.includes(extension)) {
-      throw new ValidationError(
-        `Invalid file extension. Allowed: ${allowedExtensions.join(", ")}`,
-      );
-    }
-  }
+  ): void {}
 }
 

[NoCoverage] MethodExpression
src/utils/validation.ts:78:23
     path: string,
     allowedExtensions: readonly string[],
   ): void {
-    const extension = path.toLowerCase().substring(path.lastIndexOf("."));
+    const extension = path.toUpperCase().substring(path.lastIndexOf("."));
 
     if (!allowedExtensions.includes(extension)) {

[NoCoverage] MethodExpression
src/utils/validation.ts:78:23
     path: string,
     allowedExtensions: readonly string[],
   ): void {
-    const extension = path.toLowerCase().substring(path.lastIndexOf("."));
+    const extension = path.toLowerCase();
 
     if (!allowedExtensions.includes(extension)) {

[NoCoverage] BooleanLiteral
src/utils/validation.ts:80:9
   ): void {
     const extension = path.toLowerCase().substring(path.lastIndexOf("."));
 
-    if (!allowedExtensions.includes(extension)) {
+    if (allowedExtensions.includes(extension)) {
       throw new ValidationError(
         `Invalid file extension. Allowed: ${allowedExtensions.join(", ")}`,

[NoCoverage] BlockStatement
src/utils/validation.ts:80:49
   ): void {
     const extension = path.toLowerCase().substring(path.lastIndexOf("."));
 
-    if (!allowedExtensions.includes(extension)) {
-      throw new ValidationError(
-        `Invalid file extension. Allowed: ${allowedExtensions.join(", ")}`,
-      );
-    }
+    if (!allowedExtensions.includes(extension)) {}
   }
 }

[NoCoverage] StringLiteral
src/utils/validation.ts:82:68
 
     if (!allowedExtensions.includes(extension)) {
       throw new ValidationError(
-        `Invalid file extension. Allowed: ${allowedExtensions.join(", ")}`,
+        `Invalid file extension. Allowed: ${allowedExtensions.join("")}`,
       );
     }

[NoCoverage] BlockStatement
src/utils/validation.ts:98:11
   static validateFileSize(
     sizeBytes: number,
     maxSizeMB: number = VALIDATION.MAX_FILE_SIZE_MB,
-  ): void {
-    const maxSizeBytes = maxSizeMB * 1024 * 1024;
-
-    if (sizeBytes > maxSizeBytes) {
-      throw new ValidationError(
-        `File too large (${Math.round(sizeBytes / 1024 / 1024)}MB). Maximum allowed: ${maxSizeMB}MB`,
-      );
-    }
-
-    if (sizeBytes < VALIDATION.MIN_SPEC_SIZE_BYTES) {
-      throw new ValidationError(
-        `File too small (${sizeBytes} bytes). Minimum required: ${VALIDATION.MIN_SPEC_SIZE_BYTES} bytes`,
-      );
-    }
-  }
+  ): void {}
 
   /**

[NoCoverage] ConditionalExpression
src/utils/validation.ts:107:9
       );
     }
 
-    if (sizeBytes < VALIDATION.MIN_SPEC_SIZE_BYTES) {
+    if (false) {
       throw new ValidationError(
         `File too small (${sizeBytes} bytes). Minimum required: ${VALIDATION.MIN_SPEC_SIZE_BYTES} bytes`,

[NoCoverage] EqualityOperator
src/utils/validation.ts:107:9
       );
     }
 
-    if (sizeBytes < VALIDATION.MIN_SPEC_SIZE_BYTES) {
+    if (sizeBytes >= VALIDATION.MIN_SPEC_SIZE_BYTES) {
       throw new ValidationError(
         `File too small (${sizeBytes} bytes). Minimum required: ${VALIDATION.MIN_SPEC_SIZE_BYTES} bytes`,

[NoCoverage] StringLiteral
src/utils/validation.ts:109:9
 
     if (sizeBytes < VALIDATION.MIN_SPEC_SIZE_BYTES) {
       throw new ValidationError(
-        `File too small (${sizeBytes} bytes). Minimum required: ${VALIDATION.MIN_SPEC_SIZE_BYTES} bytes`,
+        ``,
       );
     }

[NoCoverage] BlockStatement
src/utils/validation.ts:117:69
   /**
    * Validate OpenAPI spec file
    */
-  static validateOpenAPIFile(path: string, sizeBytes: number): void {
-    PathValidator.validatePath(path);
-    PathValidator.validateFileExtension(path, FILE_EXTENSIONS.OPENAPI);
-    FileValidator.validateFileSize(sizeBytes, VALIDATION.MAX_SPEC_SIZE_MB);
-  }
+  static validateOpenAPIFile(path: string, sizeBytes: number): void {}
 
   /**

[NoCoverage] BlockStatement
src/utils/validation.ts:130:38
     let parsedContent: any;
 
     // Parse content if it's a string
-    if (typeof content === "string") {
-      try {
-        parsedContent = JSON.parse(content);
-      } catch (error) {
-        throw new ValidationError("Invalid JSON content");
-      }
-    } else {
+    if (typeof content === "string") {} else {
       parsedContent = content;
     }

[NoCoverage] ConditionalExpression
src/utils/validation.ts:130:9
     let parsedContent: any;
 
     // Parse content if it's a string
-    if (typeof content === "string") {
+    if (false) {
       try {
         parsedContent = JSON.parse(content);

[NoCoverage] BlockStatement
src/utils/validation.ts:131:11
 
     // Parse content if it's a string
     if (typeof content === "string") {
-      try {
-        parsedContent = JSON.parse(content);
-      } catch (error) {
+      try {} catch (error) {
         throw new ValidationError("Invalid JSON content");
       }

[NoCoverage] BlockStatement
src/utils/validation.ts:133:23
     if (typeof content === "string") {
       try {
         parsedContent = JSON.parse(content);
-      } catch (error) {
-        throw new ValidationError("Invalid JSON content");
-      }
+      } catch (error) {}
     } else {
       parsedContent = content;

[NoCoverage] BlockStatement
src/utils/validation.ts:136:12
       } catch (error) {
         throw new ValidationError("Invalid JSON content");
       }
-    } else {
-      parsedContent = content;
-    }
+    } else {}
 
     if (!parsedContent || typeof parsedContent !== "object") {

[NoCoverage] LogicalOperator
src/utils/validation.ts:140:9
       parsedContent = content;
     }
 
-    if (!parsedContent || typeof parsedContent !== "object") {
+    if (!parsedContent && typeof parsedContent !== "object") {
       throw new ValidationError("Invalid OpenAPI content: must be an object");
     }

[NoCoverage] ConditionalExpression
src/utils/validation.ts:140:9
       parsedContent = content;
     }
 
-    if (!parsedContent || typeof parsedContent !== "object") {
+    if (true) {
       throw new ValidationError("Invalid OpenAPI content: must be an object");
     }

[NoCoverage] StringLiteral
src/utils/validation.ts:141:33
     }
 
     if (!parsedContent || typeof parsedContent !== "object") {
-      throw new ValidationError("Invalid OpenAPI content: must be an object");
+      throw new ValidationError("");
     }
 

[NoCoverage] BlockStatement
src/utils/validation.ts:145:59
     }
 
     // Check for required OpenAPI fields
-    if (!parsedContent.openapi && !parsedContent.swagger) {
-      throw new ValidationError(
-        "Invalid OpenAPI content: missing version field",
-      );
-    }
+    if (!parsedContent.openapi && !parsedContent.swagger) {}
 
     if (!parsedContent.info) {

[NoCoverage] BooleanLiteral
src/utils/validation.ts:145:35
     }
 
     // Check for required OpenAPI fields
-    if (!parsedContent.openapi && !parsedContent.swagger) {
+    if (!parsedContent.openapi && parsedContent.swagger) {
       throw new ValidationError(
         "Invalid OpenAPI content: missing version field",

[NoCoverage] StringLiteral
src/utils/validation.ts:147:9
     // Check for required OpenAPI fields
     if (!parsedContent.openapi && !parsedContent.swagger) {
       throw new ValidationError(
-        "Invalid OpenAPI content: missing version field",
+        "",
       );
     }

[NoCoverage] ConditionalExpression
src/utils/validation.ts:151:9
       );
     }
 
-    if (!parsedContent.info) {
+    if (false) {
       throw new ValidationError("Invalid OpenAPI content: missing info field");
     }

[NoCoverage] BlockStatement
src/utils/validation.ts:151:30
       );
     }
 
-    if (!parsedContent.info) {
-      throw new ValidationError("Invalid OpenAPI content: missing info field");
-    }
+    if (!parsedContent.info) {}
 
     if (!parsedContent.info.title) {

[NoCoverage] StringLiteral
src/utils/validation.ts:152:33
     }
 
     if (!parsedContent.info) {
-      throw new ValidationError("Invalid OpenAPI content: missing info field");
+      throw new ValidationError("");
     }
 

[NoCoverage] BlockStatement
src/utils/validation.ts:155:36
       throw new ValidationError("Invalid OpenAPI content: missing info field");
     }
 
-    if (!parsedContent.info.title) {
-      throw new ValidationError(
-        "Invalid OpenAPI content: missing title in info",
-      );
-    }
+    if (!parsedContent.info.title) {}
 
     // Basic structure validation

[NoCoverage] BooleanLiteral
src/utils/validation.ts:155:9
       throw new ValidationError("Invalid OpenAPI content: missing info field");
     }
 
-    if (!parsedContent.info.title) {
+    if (parsedContent.info.title) {
       throw new ValidationError(
         "Invalid OpenAPI content: missing title in info",

[NoCoverage] LogicalOperator
src/utils/validation.ts:162:9
     }
 
     // Basic structure validation
-    if (parsedContent.paths && typeof parsedContent.paths !== "object") {
+    if (parsedContent.paths || typeof parsedContent.paths !== "object") {
       throw new ValidationError(
         "Invalid OpenAPI content: paths must be an object",

[NoCoverage] EqualityOperator
src/utils/validation.ts:162:32
     }
 
     // Basic structure validation
-    if (parsedContent.paths && typeof parsedContent.paths !== "object") {
+    if (parsedContent.paths && typeof parsedContent.paths === "object") {
       throw new ValidationError(
         "Invalid OpenAPI content: paths must be an object",

[NoCoverage] ConditionalExpression
src/utils/validation.ts:169:7
     }
 
     if (
-      parsedContent.components &&
-      typeof parsedContent.components !== "object"
+      false
     ) {
       throw new ValidationError(

[NoCoverage] ConditionalExpression
src/utils/validation.ts:169:7
     }
 
     if (
-      parsedContent.components &&
-      typeof parsedContent.components !== "object"
+      true
     ) {
       throw new ValidationError(

[NoCoverage] ConditionalExpression
src/utils/validation.ts:170:7
 
     if (
       parsedContent.components &&
-      typeof parsedContent.components !== "object"
+      true
     ) {
       throw new ValidationError(

[NoCoverage] EqualityOperator
src/utils/validation.ts:170:7
 
     if (
       parsedContent.components &&
-      typeof parsedContent.components !== "object"
+      typeof parsedContent.components === "object"
     ) {
       throw new ValidationError(

[NoCoverage] BlockStatement
src/utils/validation.ts:171:7
     if (
       parsedContent.components &&
       typeof parsedContent.components !== "object"
-    ) {
-      throw new ValidationError(
-        "Invalid OpenAPI content: components must be an object",
-      );
-    }
+    ) {}
   }
 }

[Killed] EqualityOperator
src/utils/validation.ts:189:20
   static validateCacheEntry(_key: string, data: any): boolean {
     try {
       // Basic structure validation
-      if (!data || typeof data !== "object") {
+      if (!data || typeof data === "object") {
         return false;
       }
killedBy: CacheValidator validateCacheEntry should accept valid cache entries
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/utils/validation.ts:189:11
   static validateCacheEntry(_key: string, data: any): boolean {
     try {
       // Basic structure validation
-      if (!data || typeof data !== "object") {
+      if (true) {
         return false;
       }
killedBy: CacheValidator validateCacheEntry should accept valid cache entries
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/utils/validation.ts:190:16
     try {
       // Basic structure validation
       if (!data || typeof data !== "object") {
-        return false;
+        return true;
       }
 
killedBy: CacheValidator validateCacheEntry should reject invalid cache entries
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/utils/validation.ts:194:11
       }
 
       // Check for required metadata
-      if (!data.timestamp || !data.value) {
+      if (false) {
         return false;
       }
killedBy: CacheValidator validateCacheEntry should reject invalid cache entries
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/utils/validation.ts:194:43
       }
 
       // Check for required metadata
-      if (!data.timestamp || !data.value) {
-        return false;
-      }
+      if (!data.timestamp || !data.value) {}
 
       // Validate timestamp
killedBy: CacheValidator validateCacheEntry should reject invalid cache entries
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/utils/validation.ts:195:16
 
       // Check for required metadata
       if (!data.timestamp || !data.value) {
-        return false;
+        return true;
       }
 
killedBy: CacheValidator validateCacheEntry should reject invalid cache entries
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/utils/validation.ts:200:39
 
       // Validate timestamp
       const timestamp = new Date(data.timestamp);
-      if (isNaN(timestamp.getTime())) {
-        return false;
-      }
+      if (isNaN(timestamp.getTime())) {}
 
       // Check if data is too old (beyond any reasonable TTL)
killedBy: CacheValidator validateCacheEntry should reject invalid cache entries
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/utils/validation.ts:200:11
 
       // Validate timestamp
       const timestamp = new Date(data.timestamp);
-      if (isNaN(timestamp.getTime())) {
+      if (false) {
         return false;
       }
killedBy: CacheValidator validateCacheEntry should reject invalid cache entries
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/utils/validation.ts:201:16
       // Validate timestamp
       const timestamp = new Date(data.timestamp);
       if (isNaN(timestamp.getTime())) {
-        return false;
+        return true;
       }
 
killedBy: CacheValidator validateCacheEntry should reject invalid cache entries
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/utils/validation.ts:206:11
 
       // Check if data is too old (beyond any reasonable TTL)
       const maxAge = 7 * 24 * 60 * 60 * 1000; // 7 days
-      if (Date.now() - timestamp.getTime() > maxAge) {
+      if (false) {
         return false;
       }
killedBy: CacheValidator validateCacheEntry should reject invalid cache entries
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/utils/validation.ts:206:11
 
       // Check if data is too old (beyond any reasonable TTL)
       const maxAge = 7 * 24 * 60 * 60 * 1000; // 7 days
-      if (Date.now() - timestamp.getTime() > maxAge) {
+      if (Date.now() - timestamp.getTime() <= maxAge) {
         return false;
       }
killedBy: CacheValidator validateCacheEntry should accept valid cache entries
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/utils/validation.ts:207:16
       // Check if data is too old (beyond any reasonable TTL)
       const maxAge = 7 * 24 * 60 * 60 * 1000; // 7 days
       if (Date.now() - timestamp.getTime() > maxAge) {
-        return false;
+        return true;
       }
 
killedBy: CacheValidator validateCacheEntry should reject invalid cache entries
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] MethodExpression
src/utils/validation.ts:220:45
    * Generate cache integrity hash
    */
   static generateIntegrityHash(data: any): string {
-    const serialized = JSON.stringify(data, Object.keys(data).sort());
+    const serialized = JSON.stringify(data, Object.keys(data));
     return createHash("sha256").update(serialized).digest("hex");
   }

[Killed] EqualityOperator
src/utils/validation.ts:230:14
   static verifyCacheIntegrity(data: any, expectedHash: string): boolean {
     try {
       const actualHash = CacheValidator.generateIntegrityHash(data);
-      return actualHash === expectedHash;
+      return actualHash !== expectedHash;
     } catch (error) {
       return false;
killedBy: CacheValidator verifyCacheIntegrity should verify matching hashes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/utils/validation.ts:230:14
   static verifyCacheIntegrity(data: any, expectedHash: string): boolean {
     try {
       const actualHash = CacheValidator.generateIntegrityHash(data);
-      return actualHash === expectedHash;
+      return false;
     } catch (error) {
       return false;
killedBy: CacheValidator verifyCacheIntegrity should verify matching hashes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/utils/validation.ts:244:55
   /**
    * Validate provider name
    */
-  static validateProviderName(provider: string): void {
-    if (!provider || typeof provider !== "string") {
-      throw new ValidationError("Provider name must be a non-empty string");
-    }
-
-    if (provider.length > 255) {
-      throw new ValidationError("Provider name too long (max 255 characters)");
-    }
-
-    // Basic domain name validation
-    const domainRegex =
-      /^[a-zA-Z0-9]([a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?(\.[a-zA-Z0-9]([a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?)*$/;
-    if (!domainRegex.test(provider)) {
-      throw new ValidationError("Invalid provider name format");
-    }
-  }
+  static validateProviderName(provider: string): void {}
 
   /**
killedBy: APIDataValidator validateProviderName should reject invalid provider names
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] BooleanLiteral
src/utils/validation.ts:245:9
    * Validate provider name
    */
   static validateProviderName(provider: string): void {
-    if (!provider || typeof provider !== "string") {
+    if (provider || typeof provider !== "string") {
       throw new ValidationError("Provider name must be a non-empty string");
     }
killedBy: APIDataValidator validateProviderName should accept valid provider names
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "Provider name must be a non-empty string"

      441 |         } else {
      442 |           stryCov_9fa48("2464");
    > 443 |           throw new ValidationError(stryMutAct_9fa48("2465") ? "" : (stryCov_9fa48("2465"), "Provider name must be a non-empty string"));

[Killed] BlockStatement
src/utils/validation.ts:245:52
    * Validate provider name
    */
   static validateProviderName(provider: string): void {
-    if (!provider || typeof provider !== "string") {
-      throw new ValidationError("Provider name must be a non-empty string");
-    }
+    if (!provider || typeof provider !== "string") {}
 
     if (provider.length > 255) {
killedBy: APIDataValidator validateProviderName should reject invalid provider names
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError
Received constructor: TypeError

Received message: "Cannot read properties of null (reading 'length')"

      444 |         }

[Killed] EqualityOperator
src/utils/validation.ts:249:9
       throw new ValidationError("Provider name must be a non-empty string");
     }
 
-    if (provider.length > 255) {
+    if (provider.length <= 255) {
       throw new ValidationError("Provider name too long (max 255 characters)");
     }
killedBy: APIDataValidator validateProviderName should accept valid provider names
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "Provider name too long (max 255 characters)"

      449 |         } else {
      450 |           stryCov_9fa48("2470");
    > 451 |           throw new ValidationError(stryMutAct_9fa48("2471") ? "" : (stryCov_9fa48("2471"), "Provider name too long (max 255 characters)"));

[Killed] ConditionalExpression
src/utils/validation.ts:249:9
       throw new ValidationError("Provider name must be a non-empty string");
     }
 
-    if (provider.length > 255) {
+    if (true) {
       throw new ValidationError("Provider name too long (max 255 characters)");
     }
killedBy: APIDataValidator validateProviderName should accept valid provider names
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "Provider name too long (max 255 characters)"

      449 |         } else {
      450 |           stryCov_9fa48("2470");
    > 451 |           throw new ValidationError(stryMutAct_9fa48("2471") ? "" : (stryCov_9fa48("2471"), "Provider name too long (max 255 characters)"));

[Killed] Regex
src/utils/validation.ts:255:7
 
     // Basic domain name validation
     const domainRegex =
-      /^[a-zA-Z0-9]([a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?(\.[a-zA-Z0-9]([a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?)*$/;
+      /^[^a-zA-Z0-9]([a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?(\.[a-zA-Z0-9]([a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?)*$/;
     if (!domainRegex.test(provider)) {
       throw new ValidationError("Invalid provider name format");
killedBy: APIDataValidator validateProviderName should accept valid provider names
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "Invalid provider name format"

      460 |         } else {
      461 |           stryCov_9fa48("2488");
    > 462 |           throw new ValidationError(stryMutAct_9fa48("2489") ? "" : (stryCov_9fa48("2489"), "Invalid provider name format"));

[Killed] Regex
src/utils/validation.ts:255:7
 
     // Basic domain name validation
     const domainRegex =
-      /^[a-zA-Z0-9]([a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?(\.[a-zA-Z0-9]([a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?)*$/;
+      /^[a-zA-Z0-9]([a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?(\.[a-zA-Z0-9]([^a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?)*$/;
     if (!domainRegex.test(provider)) {
       throw new ValidationError("Invalid provider name format");
killedBy: APIDataValidator validateProviderName should accept valid provider names
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "Invalid provider name format"

      460 |         } else {
      461 |           stryCov_9fa48("2488");
    > 462 |           throw new ValidationError(stryMutAct_9fa48("2489") ? "" : (stryCov_9fa48("2489"), "Invalid provider name format"));

[Killed] BooleanLiteral
src/utils/validation.ts:256:9
     // Basic domain name validation
     const domainRegex =
       /^[a-zA-Z0-9]([a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?(\.[a-zA-Z0-9]([a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?)*$/;
-    if (!domainRegex.test(provider)) {
+    if (domainRegex.test(provider)) {
       throw new ValidationError("Invalid provider name format");
     }
killedBy: APIDataValidator validateProviderName should accept valid provider names
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "Invalid provider name format"

      460 |         } else {
      461 |           stryCov_9fa48("2488");
    > 462 |           throw new ValidationError(stryMutAct_9fa48("2489") ? "" : (stryCov_9fa48("2489"), "Invalid provider name format"));

[Killed] ConditionalExpression
src/utils/validation.ts:256:9
     // Basic domain name validation
     const domainRegex =
       /^[a-zA-Z0-9]([a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?(\.[a-zA-Z0-9]([a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?)*$/;
-    if (!domainRegex.test(provider)) {
+    if (true) {
       throw new ValidationError("Invalid provider name format");
     }
killedBy: APIDataValidator validateProviderName should accept valid provider names
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "Invalid provider name format"

      460 |         } else {
      461 |           stryCov_9fa48("2488");
    > 462 |           throw new ValidationError(stryMutAct_9fa48("2489") ? "" : (stryCov_9fa48("2489"), "Invalid provider name format"));
