[Killed] ConditionalExpression
src/cache/manager.ts:13:20
   private enabled: boolean;
 
   constructor(ttlMs: number = CACHE_TTL.DEFAULT) {
-    this.enabled = process.env.DISABLE_CACHE !== "true";
+    this.enabled = false;
 
     this.cache = new NodeCache({
killedBy: CacheManager get should retrieve value from cache
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-key"

Number of calls: 0

[Killed] ConditionalExpression
src/cache/manager.ts:13:20
   private enabled: boolean;
 
   constructor(ttlMs: number = CACHE_TTL.DEFAULT) {
-    this.enabled = process.env.DISABLE_CACHE !== "true";
+    this.enabled = true;
 
     this.cache = new NodeCache({
killedBy: CacheManager constructor should respect DISABLE_CACHE environment variable
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] ConditionalExpression
src/cache/manager.ts:18:9
     this.cache = new NodeCache({
       stdTTL: Math.floor(ttlMs / 1000), // NodeCache uses seconds
       checkperiod:
-        process.env.NODE_ENV === "test"
+        false
           ? 0
           : Math.floor((ttlMs / 1000) * CACHE_LIMITS.CHECK_PERIOD_RATIO), // Disable periodic checks in tests

[Survived] EqualityOperator
src/cache/manager.ts:18:9
     this.cache = new NodeCache({
       stdTTL: Math.floor(ttlMs / 1000), // NodeCache uses seconds
       checkperiod:
-        process.env.NODE_ENV === "test"
+        process.env.NODE_ENV !== "test"
           ? 0
           : Math.floor((ttlMs / 1000) * CACHE_LIMITS.CHECK_PERIOD_RATIO), // Disable periodic checks in tests

[Killed] BooleanLiteral
src/cache/manager.ts:21:18
         process.env.NODE_ENV === "test"
           ? 0
           : Math.floor((ttlMs / 1000) * CACHE_LIMITS.CHECK_PERIOD_RATIO), // Disable periodic checks in tests
-      useClones: false, // Better performance, but be careful with mutations
+      useClones: true, // Better performance, but be careful with mutations
       deleteOnExpire: true,
       maxKeys: CACHE_LIMITS.MAX_KEYS,
killedBy: CacheManager constructor should initialize NodeCache with correct options
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "checkperiod": Any<Number>,
+   "checkperiod": 0,

[Killed] BooleanLiteral
src/cache/manager.ts:22:23
           ? 0
           : Math.floor((ttlMs / 1000) * CACHE_LIMITS.CHECK_PERIOD_RATIO), // Disable periodic checks in tests
       useClones: false, // Better performance, but be careful with mutations
-      deleteOnExpire: true,
+      deleteOnExpire: false,
       maxKeys: CACHE_LIMITS.MAX_KEYS,
     });
killedBy: CacheManager constructor should initialize NodeCache with correct options
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "checkperiod": Any<Number>,
-   "deleteOnExpire": true,

[Killed] BlockStatement
src/cache/manager.ts:27:39
     });
 
     // Set up cache statistics logging
-    this.cache.on("expired", (key) => {
-      Logger.cache("expired", key);
-    });
+    this.cache.on("expired", (key) => {});
 
     this.cache.on("set", (key) => {
killedBy: CacheManager event handlers should log expired keys
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "[CACHE] expired: expired-key"

Number of calls: 0

[Killed] BlockStatement
src/cache/manager.ts:31:35
       Logger.cache("expired", key);
     });
 
-    this.cache.on("set", (key) => {
-      Logger.cache("set", key);
-    });
+    this.cache.on("set", (key) => {});
   }
 
killedBy: CacheManager event handlers should log set keys
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "[CACHE] set: new-key"

Number of calls: 0

[Killed] BlockStatement
src/cache/manager.ts:40:24
    * Get value from cache with validation
    */
   get<T>(key: string): T | undefined {
-    if (!this.enabled) {
-      return undefined;
-    }
+    if (!this.enabled) {}
 
     try {
killedBy: CacheManager get should return undefined when cache is disabled
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "test-key"

[Killed] ConditionalExpression
src/cache/manager.ts:40:9
    * Get value from cache with validation
    */
   get<T>(key: string): T | undefined {
-    if (!this.enabled) {
+    if (false) {
       return undefined;
     }
killedBy: CacheManager get should return undefined when cache is disabled
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "test-key"

[Killed] ConditionalExpression
src/cache/manager.ts:46:11
 
     try {
       const wrappedValue = this.cache.get<any>(key);
-      if (wrappedValue !== undefined) {
+      if (false) {
         // Validate cache entry integrity
         if (!this.validateCacheEntry(key, wrappedValue)) {
killedBy: CacheManager get should retrieve value from cache
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"data": "test"}
Received: undefined

[Killed] EqualityOperator
src/cache/manager.ts:46:11
 
     try {
       const wrappedValue = this.cache.get<any>(key);
-      if (wrappedValue !== undefined) {
+      if (wrappedValue === undefined) {
         // Validate cache entry integrity
         if (!this.validateCacheEntry(key, wrappedValue)) {
killedBy: CacheManager get should retrieve value from cache
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"data": "test"}
Received: undefined

[Killed] BlockStatement
src/cache/manager.ts:48:58
       const wrappedValue = this.cache.get<any>(key);
       if (wrappedValue !== undefined) {
         // Validate cache entry integrity
-        if (!this.validateCacheEntry(key, wrappedValue)) {
-          Logger.warn(`Cache corruption detected for key: ${key}`);
-          this.delete(key);
-          return undefined;
-        }
+        if (!this.validateCacheEntry(key, wrappedValue)) {}
 
         Logger.cache("hit", key);
killedBy: CacheManager get should validate cache entry integrity
statusReason: Error: expect(received).toBeUndefined()

Received: {"data": "test"}

[Killed] ConditionalExpression
src/cache/manager.ts:48:13
       const wrappedValue = this.cache.get<any>(key);
       if (wrappedValue !== undefined) {
         // Validate cache entry integrity
-        if (!this.validateCacheEntry(key, wrappedValue)) {
+        if (true) {
           Logger.warn(`Cache corruption detected for key: ${key}`);
           this.delete(key);
killedBy: CacheManager get should retrieve value from cache
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"data": "test"}
Received: undefined

[Survived] StringLiteral
src/cache/manager.ts:49:23
       if (wrappedValue !== undefined) {
         // Validate cache entry integrity
         if (!this.validateCacheEntry(key, wrappedValue)) {
-          Logger.warn(`Cache corruption detected for key: ${key}`);
+          Logger.warn(``);
           this.delete(key);
           return undefined;

[Survived] ObjectLiteral
src/cache/manager.ts:61:75
       }
       return undefined;
     } catch (error) {
-      const cacheError = new CacheError(`Cache get error for key ${key}`, {
-        operation: "get",
-        details: {
-          key,
-          error: error instanceof Error ? error.message : String(error),
-        },
-      });
+      const cacheError = new CacheError(`Cache get error for key ${key}`, {});
       ErrorHandler.logError(cacheError);
       return undefined;

[Survived] StringLiteral
src/cache/manager.ts:62:20
       return undefined;
     } catch (error) {
       const cacheError = new CacheError(`Cache get error for key ${key}`, {
-        operation: "get",
+        operation: "",
         details: {
           key,

[Killed] BlockStatement
src/cache/manager.ts:77:24
    * Set value in cache with enhanced metadata
    */
   set<T>(key: string, value: T, ttlMs?: number): boolean {
-    if (!this.enabled) {
-      return false;
-    }
+    if (!this.enabled) {}
 
     try {
killedBy: CacheManager set should return false when cache is disabled
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/cache/manager.ts:77:9
    * Set value in cache with enhanced metadata
    */
   set<T>(key: string, value: T, ttlMs?: number): boolean {
-    if (!this.enabled) {
+    if (false) {
       return false;
     }
killedBy: CacheManager set should return false when cache is disabled
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/cache/manager.ts:78:14
    */
   set<T>(key: string, value: T, ttlMs?: number): boolean {
     if (!this.enabled) {
-      return false;
+      return true;
     }
 
killedBy: CacheManager set should return false when cache is disabled
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] MethodExpression
src/cache/manager.ts:93:13
         ? this.cache.set(
             key,
             wrappedValue,
-            Math.max(1, Math.floor(ttlMs / 1000)),
+            Math.min(1, Math.floor(ttlMs / 1000)),
           )
         : this.cache.set(key, wrappedValue);
killedBy: CacheManager set should use custom TTL when provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-key", Any<Object>, 10
Received: "test-key", {"integrity": "mock-hash", "timestamp": "2025-07-15T00:19:10.619Z", "value": {"data": "test"}}, 1

Number of calls: 1

[Survived] BlockStatement
src/cache/manager.ts:97:20
           )
         : this.cache.set(key, wrappedValue);
 
-      if (success) {
-        const ttlSeconds = ttlMs
-          ? Math.max(1, Math.floor(ttlMs / 1000))
-          : "default";
-        Logger.cache("set", key, { ttl: `${ttlSeconds}s` });
-      }
+      if (success) {}
 
       return success;

[Survived] ConditionalExpression
src/cache/manager.ts:97:11
           )
         : this.cache.set(key, wrappedValue);
 
-      if (success) {
+      if (true) {
         const ttlSeconds = ttlMs
           ? Math.max(1, Math.floor(ttlMs / 1000))

[Survived] MethodExpression
src/cache/manager.ts:99:13
 
       if (success) {
         const ttlSeconds = ttlMs
-          ? Math.max(1, Math.floor(ttlMs / 1000))
+          ? Math.min(1, Math.floor(ttlMs / 1000))
           : "default";
         Logger.cache("set", key, { ttl: `${ttlSeconds}s` });

[Killed] BooleanLiteral
src/cache/manager.ts:114:14
         },
       });
       ErrorHandler.logError(cacheError);
-      return false;
+      return true;
     }
   }
killedBy: CacheManager set should handle cache set errors gracefully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/cache/manager.ts:122:24
    * Delete value from cache
    */
   delete(key: string): number {
-    if (!this.enabled) {
-      return 0;
-    }
+    if (!this.enabled) {}
 
     try {
killedBy: CacheManager delete should return 0 when cache is disabled
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
src/cache/manager.ts:122:9
    * Delete value from cache
    */
   delete(key: string): number {
-    if (!this.enabled) {
+    if (true) {
       return 0;
     }
killedBy: CacheManager get should validate cache entry integrity
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-key"

Number of calls: 0

[Survived] ConditionalExpression
src/cache/manager.ts:128:11
 
     try {
       const deleted = this.cache.del(key);
-      if (deleted > 0) {
+      if (false) {
         Logger.cache("delete", key);
       }

[Survived] EqualityOperator
src/cache/manager.ts:128:11
 
     try {
       const deleted = this.cache.del(key);
-      if (deleted > 0) {
+      if (deleted >= 0) {
         Logger.cache("delete", key);
       }

[NoCoverage] StringLiteral
src/cache/manager.ts:133:20
       }
       return deleted;
     } catch (error) {
-      Logger.error(`Cache delete error for key ${key}:`, error);
+      Logger.error(``, error);
       return 0;
     }

[Killed] BlockStatement
src/cache/manager.ts:141:17
   /**
    * Clear all cache entries
    */
-  clear(): void {
-    if (!this.enabled) {
-      return;
-    }
-
-    try {
-      this.cache.flushAll();
-      Logger.cache("clear", "all");
-    } catch (error) {
-      Logger.error("Cache clear error:", error);
-    }
-  }
+  clear(): void {}
 
   /**
killedBy: CacheManager clear should clear all cache entries
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BooleanLiteral
src/cache/manager.ts:142:9
    * Clear all cache entries
    */
   clear(): void {
-    if (!this.enabled) {
+    if (this.enabled) {
       return;
     }
killedBy: CacheManager clear should clear all cache entries
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/cache/manager.ts:142:9
    * Clear all cache entries
    */
   clear(): void {
-    if (!this.enabled) {
+    if (true) {
       return;
     }
killedBy: CacheManager clear should clear all cache entries
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/cache/manager.ts:146:9
       return;
     }
 
-    try {
-      this.cache.flushAll();
-      Logger.cache("clear", "all");
-    } catch (error) {
+    try {} catch (error) {
       Logger.error("Cache clear error:", error);
     }
killedBy: CacheManager clear should clear all cache entries
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] StringLiteral
src/cache/manager.ts:148:20
 
     try {
       this.cache.flushAll();
-      Logger.cache("clear", "all");
+      Logger.cache("", "all");
     } catch (error) {
       Logger.error("Cache clear error:", error);

[NoCoverage] BlockStatement
src/cache/manager.ts:149:21
     try {
       this.cache.flushAll();
       Logger.cache("clear", "all");
-    } catch (error) {
-      Logger.error("Cache clear error:", error);
-    }
+    } catch (error) {}
   }
 

[Survived] BlockStatement
src/cache/manager.ts:157:19
   /**
    * Destroy the cache and clean up resources
    */
-  destroy(): void {
-    if (!this.enabled) return;
-
-    try {
-      // Clear all data
-      this.cache.flushAll();
-
-      // Close the cache to stop any internal timers
-      if (typeof (this.cache as any).close === "function") {
-        (this.cache as any).close();
-      }
-    } catch (error) {
-      Logger.error("Cache destroy error:", error);
-    }
-  }
+  destroy(): void {}
 
   /**

[Survived] ConditionalExpression
src/cache/manager.ts:158:9
    * Destroy the cache and clean up resources
    */
   destroy(): void {
-    if (!this.enabled) return;
+    if (false) return;
 
     try {

[Survived] BooleanLiteral
src/cache/manager.ts:158:9
    * Destroy the cache and clean up resources
    */
   destroy(): void {
-    if (!this.enabled) return;
+    if (this.enabled) return;
 
     try {

[Survived] BlockStatement
src/cache/manager.ts:160:9
   destroy(): void {
     if (!this.enabled) return;
 
-    try {
-      // Clear all data
-      this.cache.flushAll();
-
-      // Close the cache to stop any internal timers
-      if (typeof (this.cache as any).close === "function") {
-        (this.cache as any).close();
-      }
-    } catch (error) {
+    try {} catch (error) {
       Logger.error("Cache destroy error:", error);
     }

[Survived] ConditionalExpression
src/cache/manager.ts:165:11
       this.cache.flushAll();
 
       // Close the cache to stop any internal timers
-      if (typeof (this.cache as any).close === "function") {
+      if (false) {
         (this.cache as any).close();
       }

[Survived] EqualityOperator
src/cache/manager.ts:165:11
       this.cache.flushAll();
 
       // Close the cache to stop any internal timers
-      if (typeof (this.cache as any).close === "function") {
+      if (typeof (this.cache as any).close !== "function") {
         (this.cache as any).close();
       }

[NoCoverage] BlockStatement
src/cache/manager.ts:168:21
       if (typeof (this.cache as any).close === "function") {
         (this.cache as any).close();
       }
-    } catch (error) {
-      Logger.error("Cache destroy error:", error);
-    }
+    } catch (error) {}
   }
 

[Killed] BooleanLiteral
src/cache/manager.ts:183:9
     ksize: number;
     vsize: number;
   } {
-    if (!this.enabled) {
+    if (this.enabled) {
       return {
         keys: 0,
killedBy: CacheManager getStats should return cache statistics
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Object {
-   "hits": 50,
-   "keys": 10,

[Killed] ConditionalExpression
src/cache/manager.ts:183:9
     ksize: number;
     vsize: number;
   } {
-    if (!this.enabled) {
+    if (true) {
       return {
         keys: 0,
killedBy: CacheManager getStats should return cache statistics
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Object {
-   "hits": 50,
-   "keys": 10,

[Killed] BooleanLiteral
src/cache/manager.ts:200:9
    * Get all cache keys
    */
   keys(): string[] {
-    if (!this.enabled) {
+    if (this.enabled) {
       return [];
     }
killedBy: CacheManager keys should return all cache keys
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   "key1",
-   "key2",

[Killed] ConditionalExpression
src/cache/manager.ts:200:9
    * Get all cache keys
    */
   keys(): string[] {
-    if (!this.enabled) {
+    if (true) {
       return [];
     }
killedBy: CacheManager keys should return all cache keys
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   "key1",
-   "key2",

[Killed] ConditionalExpression
src/cache/manager.ts:211:9
    * Check if cache has a key
    */
   has(key: string): boolean {
-    if (!this.enabled) {
+    if (false) {
       return false;
     }
killedBy: CacheManager has should return false when cache is disabled
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] BlockStatement
src/cache/manager.ts:211:24
    * Check if cache has a key
    */
   has(key: string): boolean {
-    if (!this.enabled) {
-      return false;
-    }
+    if (!this.enabled) {}
 
     return this.cache.has(key);
killedBy: CacheManager has should return false when cache is disabled
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] BooleanLiteral
src/cache/manager.ts:222:9
    * Get TTL for a key (in seconds)
    */
   getTtl(key: string): number | undefined {
-    if (!this.enabled) {
+    if (this.enabled) {
       return undefined;
     }
killedBy: CacheManager getTtl should return TTL for key
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-key"

Number of calls: 0

[Killed] ConditionalExpression
src/cache/manager.ts:222:9
    * Get TTL for a key (in seconds)
    */
   getTtl(key: string): number | undefined {
-    if (!this.enabled) {
+    if (true) {
       return undefined;
     }
killedBy: CacheManager getTtl should return TTL for key
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test-key"

Number of calls: 0

[Killed] EqualityOperator
src/cache/manager.ts:228:12
 
     const ttl = this.cache.getTtl(key);
     // NodeCache returns 0 for non-existent keys
-    return ttl === 0 ? undefined : ttl;
+    return ttl !== 0 ? undefined : ttl;
   }
 
killedBy: CacheManager getTtl should return TTL for key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1752538784447
Received: undefined

[Killed] ConditionalExpression
src/cache/manager.ts:228:12
 
     const ttl = this.cache.getTtl(key);
     // NodeCache returns 0 for non-existent keys
-    return ttl === 0 ? undefined : ttl;
+    return true ? undefined : ttl;
   }
 
killedBy: CacheManager getTtl should return TTL for key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1752538783643
Received: undefined

[NoCoverage] ConditionalExpression
src/cache/manager.ts:235:9
    * Get cache size information
    */
   getSize(): number {
-    if (!this.enabled) {
+    if (true) {
       return 0;
     }

[NoCoverage] ConditionalExpression
src/cache/manager.ts:235:9
    * Get cache size information
    */
   getSize(): number {
-    if (!this.enabled) {
+    if (false) {
       return 0;
     }

[NoCoverage] ConditionalExpression
src/cache/manager.ts:246:9
    * Get cache memory usage (approximate)
    */
   getMemoryUsage(): number {
-    if (!this.enabled) {
+    if (false) {
       return 0;
     }

[NoCoverage] ConditionalExpression
src/cache/manager.ts:246:9
    * Get cache memory usage (approximate)
    */
   getMemoryUsage(): number {
-    if (!this.enabled) {
+    if (true) {
       return 0;
     }

[NoCoverage] BlockStatement
src/cache/manager.ts:257:17
   /**
    * Prune expired entries manually
    */
-  prune(): void {
-    if (!this.enabled) {
-      return;
-    }
-
-    // NodeCache handles this automatically, but we can force it
-    const keys = this.cache.keys();
-    const now = Date.now();
-
-    for (const key of keys) {
-      const ttl = this.cache.getTtl(key);
-      if (ttl && ttl < now) {
-        this.cache.del(key);
-      }
-    }
-  }
+  prune(): void {}
 
   /**

[NoCoverage] BlockStatement
src/cache/manager.ts:258:24
    * Prune expired entries manually
    */
   prune(): void {
-    if (!this.enabled) {
-      return;
-    }
+    if (!this.enabled) {}
 
     // NodeCache handles this automatically, but we can force it

[NoCoverage] ConditionalExpression
src/cache/manager.ts:258:9
    * Prune expired entries manually
    */
   prune(): void {
-    if (!this.enabled) {
+    if (false) {
       return;
     }

[NoCoverage] BlockStatement
src/cache/manager.ts:266:29
     const keys = this.cache.keys();
     const now = Date.now();
 
-    for (const key of keys) {
-      const ttl = this.cache.getTtl(key);
-      if (ttl && ttl < now) {
-        this.cache.del(key);
-      }
-    }
+    for (const key of keys) {}
   }
 

[NoCoverage] ConditionalExpression
src/cache/manager.ts:268:11
 
     for (const key of keys) {
       const ttl = this.cache.getTtl(key);
-      if (ttl && ttl < now) {
+      if (true) {
         this.cache.del(key);
       }

[NoCoverage] EqualityOperator
src/cache/manager.ts:268:18
 
     for (const key of keys) {
       const ttl = this.cache.getTtl(key);
-      if (ttl && ttl < now) {
+      if (ttl && ttl <= now) {
         this.cache.del(key);
       }

[NoCoverage] BlockStatement
src/cache/manager.ts:277:38
   /**
    * Set cache enabled/disabled
    */
-  setEnabled(enabled: boolean): void {
-    this.enabled = enabled;
-    if (!enabled) {
-      this.clear();
-    }
-  }
+  setEnabled(enabled: boolean): void {}
 
   /**

[NoCoverage] ConditionalExpression
src/cache/manager.ts:279:9
    */
   setEnabled(enabled: boolean): void {
     this.enabled = enabled;
-    if (!enabled) {
+    if (true) {
       this.clear();
     }

[NoCoverage] ConditionalExpression
src/cache/manager.ts:279:9
    */
   setEnabled(enabled: boolean): void {
     this.enabled = enabled;
-    if (!enabled) {
+    if (false) {
       this.clear();
     }

[Killed] BooleanLiteral
src/cache/manager.ts:310:9
    * Invalidate cache keys matching a pattern (supports * wildcard)
    */
   invalidatePattern(pattern: string): number {
-    if (!this.enabled) {
+    if (this.enabled) {
       return 0;
     }
killedBy: CacheManager pattern invalidation should invalidate keys matching pattern
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "api:v1"

Number of calls: 0

[Killed] ConditionalExpression
src/cache/manager.ts:310:9
    * Invalidate cache keys matching a pattern (supports * wildcard)
    */
   invalidatePattern(pattern: string): number {
-    if (!this.enabled) {
+    if (true) {
       return 0;
     }
killedBy: CacheManager pattern invalidation should invalidate keys matching pattern
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "api:v1"

Number of calls: 0

[Killed] StringLiteral
src/cache/manager.ts:316:61
 
     try {
       const keys = this.keys();
-      const regex = new RegExp("^" + pattern.replace(/\*/g, ".*") + "$");
+      const regex = new RegExp("^" + pattern.replace(/\*/g, "") + "$");
       let deletedCount = 0;
 
killedBy: CacheManager pattern invalidation should invalidate keys matching pattern
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "api:v1"

Number of calls: 0

[Survived] StringLiteral
src/cache/manager.ts:316:32
 
     try {
       const keys = this.keys();
-      const regex = new RegExp("^" + pattern.replace(/\*/g, ".*") + "$");
+      const regex = new RegExp("" + pattern.replace(/\*/g, ".*") + "$");
       let deletedCount = 0;
 

[Killed] BlockStatement
src/cache/manager.ts:319:31
       const regex = new RegExp("^" + pattern.replace(/\*/g, ".*") + "$");
       let deletedCount = 0;
 
-      for (const key of keys) {
-        if (regex.test(key)) {
-          deletedCount += this.cache.del(key);
-        }
-      }
+      for (const key of keys) {}
 
       if (deletedCount > 0) {
killedBy: CacheManager pattern invalidation should invalidate keys matching pattern
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "api:v1"

Number of calls: 0

[Killed] BlockStatement
src/cache/manager.ts:320:30
       let deletedCount = 0;
 
       for (const key of keys) {
-        if (regex.test(key)) {
-          deletedCount += this.cache.del(key);
-        }
+        if (regex.test(key)) {}
       }
 
killedBy: CacheManager pattern invalidation should invalidate keys matching pattern
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "api:v1"

Number of calls: 0

[Killed] ConditionalExpression
src/cache/manager.ts:320:13
       let deletedCount = 0;
 
       for (const key of keys) {
-        if (regex.test(key)) {
+        if (true) {
           deletedCount += this.cache.del(key);
         }
killedBy: CacheManager pattern invalidation should invalidate keys matching pattern
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 3

[Killed] AssignmentOperator
src/cache/manager.ts:321:11
 
       for (const key of keys) {
         if (regex.test(key)) {
-          deletedCount += this.cache.del(key);
+          deletedCount -= this.cache.del(key);
         }
       }
killedBy: CacheManager pattern invalidation should invalidate keys matching pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -2

[Survived] ConditionalExpression
src/cache/manager.ts:325:11
         }
       }
 
-      if (deletedCount > 0) {
+      if (true) {
         Logger.cache("invalidatePattern", pattern, { count: deletedCount });
       }

[Survived] ConditionalExpression
src/cache/manager.ts:325:11
         }
       }
 
-      if (deletedCount > 0) {
+      if (false) {
         Logger.cache("invalidatePattern", pattern, { count: deletedCount });
       }

[Survived] StringLiteral
src/cache/manager.ts:326:22
       }
 
       if (deletedCount > 0) {
-        Logger.cache("invalidatePattern", pattern, { count: deletedCount });
+        Logger.cache("", pattern, { count: deletedCount });
       }
 

[Killed] ConditionalExpression
src/cache/manager.ts:343:9
    * Invalidate multiple specific cache keys
    */
   invalidateKeys(keys: string[]): number {
-    if (!this.enabled) {
+    if (true) {
       return 0;
     }
killedBy: CacheManager multiple key invalidation should invalidate multiple specific keys
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "key1"

Number of calls: 0

[Killed] BooleanLiteral
src/cache/manager.ts:343:9
    * Invalidate multiple specific cache keys
    */
   invalidateKeys(keys: string[]): number {
-    if (!this.enabled) {
+    if (this.enabled) {
       return 0;
     }
killedBy: CacheManager multiple key invalidation should invalidate multiple specific keys
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "key1"

Number of calls: 0

[Killed] BlockStatement
src/cache/manager.ts:350:31
     try {
       let deletedCount = 0;
 
-      for (const key of keys) {
-        deletedCount += this.cache.del(key);
-      }
+      for (const key of keys) {}
 
       if (deletedCount > 0) {
killedBy: CacheManager multiple key invalidation should invalidate multiple specific keys
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "key1"

Number of calls: 0
