[Killed] BlockStatement
src/utils/validation.ts:264:45
   /**
    * Validate API identifier
    */
-  static validateAPIId(apiId: string): void {
-    if (!apiId || typeof apiId !== "string") {
-      throw new ValidationError("API ID must be a non-empty string");
-    }
-
-    if (apiId.length > 500) {
-      throw new ValidationError("API ID too long (max 500 characters)");
-    }
-
-    // Check for valid format (provider:service:version or provider:service)
-    const parts = apiId.split(":");
-    if (parts.length < 2 || parts.length > 3) {
-      throw new ValidationError(
-        "Invalid API ID format (expected provider:service or provider:service:version)",
-      );
-    }
-
-    parts.forEach((part, index) => {
-      if (!part.trim()) {
-        throw new ValidationError(`API ID part ${index + 1} cannot be empty`);
-      }
-    });
-  }
+  static validateAPIId(apiId: string): void {}
 
   /**
killedBy: APIDataValidator validateAPIId should reject invalid API IDs
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] BooleanLiteral
src/utils/validation.ts:265:9
    * Validate API identifier
    */
   static validateAPIId(apiId: string): void {
-    if (!apiId || typeof apiId !== "string") {
+    if (apiId || typeof apiId !== "string") {
       throw new ValidationError("API ID must be a non-empty string");
     }
killedBy: APIDataValidator validateAPIId should accept valid API IDs
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "API ID must be a non-empty string"

      479 |         } else {
      480 |           stryCov_9fa48("2498");
    > 481 |           throw new ValidationError(stryMutAct_9fa48("2499") ? "" : (stryCov_9fa48("2499"), "API ID must be a non-empty string"));

[Killed] BlockStatement
src/utils/validation.ts:265:46
    * Validate API identifier
    */
   static validateAPIId(apiId: string): void {
-    if (!apiId || typeof apiId !== "string") {
-      throw new ValidationError("API ID must be a non-empty string");
-    }
+    if (!apiId || typeof apiId !== "string") {}
 
     if (apiId.length > 500) {
killedBy: APIDataValidator validateAPIId should reject invalid API IDs
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError
Received constructor: TypeError

Received message: "Cannot read properties of null (reading 'length')"

      482 |         }

[Survived] StringLiteral
src/utils/validation.ts:266:33
    */
   static validateAPIId(apiId: string): void {
     if (!apiId || typeof apiId !== "string") {
-      throw new ValidationError("API ID must be a non-empty string");
+      throw new ValidationError("");
     }
 

[Killed] EqualityOperator
src/utils/validation.ts:269:9
       throw new ValidationError("API ID must be a non-empty string");
     }
 
-    if (apiId.length > 500) {
+    if (apiId.length <= 500) {
       throw new ValidationError("API ID too long (max 500 characters)");
     }
killedBy: APIDataValidator validateAPIId should accept valid API IDs
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "API ID too long (max 500 characters)"

      487 |         } else {
      488 |           stryCov_9fa48("2504");
    > 489 |           throw new ValidationError(stryMutAct_9fa48("2505") ? "" : (stryCov_9fa48("2505"), "API ID too long (max 500 characters)"));

[Killed] ConditionalExpression
src/utils/validation.ts:269:9
       throw new ValidationError("API ID must be a non-empty string");
     }
 
-    if (apiId.length > 500) {
+    if (true) {
       throw new ValidationError("API ID too long (max 500 characters)");
     }
killedBy: APIDataValidator validateAPIId should accept valid API IDs
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "API ID too long (max 500 characters)"

      487 |         } else {
      488 |           stryCov_9fa48("2504");
    > 489 |           throw new ValidationError(stryMutAct_9fa48("2505") ? "" : (stryCov_9fa48("2505"), "API ID too long (max 500 characters)"));

[Survived] StringLiteral
src/utils/validation.ts:270:33
     }
 
     if (apiId.length > 500) {
-      throw new ValidationError("API ID too long (max 500 characters)");
+      throw new ValidationError("");
     }
 

[Killed] ConditionalExpression
src/utils/validation.ts:275:9
 
     // Check for valid format (provider:service:version or provider:service)
     const parts = apiId.split(":");
-    if (parts.length < 2 || parts.length > 3) {
+    if (true) {
       throw new ValidationError(
         "Invalid API ID format (expected provider:service or provider:service:version)",
killedBy: APIDataValidator validateAPIId should accept valid API IDs
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "Invalid API ID format (expected provider:service or provider:service:version)"

      498 |         } else {
      499 |           stryCov_9fa48("2516");
    > 500 |           throw new ValidationError(stryMutAct_9fa48("2517") ? "" : (stryCov_9fa48("2517"), "Invalid API ID format (expected provider:service or p

[Killed] EqualityOperator
src/utils/validation.ts:275:29
 
     // Check for valid format (provider:service:version or provider:service)
     const parts = apiId.split(":");
-    if (parts.length < 2 || parts.length > 3) {
+    if (parts.length < 2 || parts.length <= 3) {
       throw new ValidationError(
         "Invalid API ID format (expected provider:service or provider:service:version)",
killedBy: APIDataValidator validateAPIId should accept valid API IDs
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "Invalid API ID format (expected provider:service or provider:service:version)"

      498 |         } else {
      499 |           stryCov_9fa48("2516");
    > 500 |           throw new ValidationError(stryMutAct_9fa48("2517") ? "" : (stryCov_9fa48("2517"), "Invalid API ID format (expected provider:service or p

[Survived] BlockStatement
src/utils/validation.ts:281:36
       );
     }
 
-    parts.forEach((part, index) => {
-      if (!part.trim()) {
-        throw new ValidationError(`API ID part ${index + 1} cannot be empty`);
-      }
-    });
+    parts.forEach((part, index) => {});
   }
 

[Killed] ConditionalExpression
src/utils/validation.ts:282:11
     }
 
     parts.forEach((part, index) => {
-      if (!part.trim()) {
+      if (true) {
         throw new ValidationError(`API ID part ${index + 1} cannot be empty`);
       }
killedBy: APIDataValidator validateAPIId should accept valid API IDs
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "API ID part 1 cannot be empty"

      511 |             } else {
      512 |               stryCov_9fa48("2523");
    > 513 |               throw new ValidationError(stryMutAct_9fa48("2524") ? `` : (stryCov_9fa48("2524"), `API ID part ${index + 1} cannot be empty`));

[Killed] BooleanLiteral
src/utils/validation.ts:282:11
     }
 
     parts.forEach((part, index) => {
-      if (!part.trim()) {
+      if (part.trim()) {
         throw new ValidationError(`API ID part ${index + 1} cannot be empty`);
       }
killedBy: APIDataValidator validateAPIId should accept valid API IDs
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "API ID part 1 cannot be empty"

      511 |             } else {
      512 |               stryCov_9fa48("2523");
    > 513 |               throw new ValidationError(stryMutAct_9fa48("2524") ? `` : (stryCov_9fa48("2524"), `API ID part ${index + 1} cannot be empty`));

[NoCoverage] MethodExpression
src/utils/validation.ts:295:27
     page?: number,
     limit?: number,
   ): { page: number; limit: number } {
-    const validatedPage = Math.max(1, Math.floor(page || 1));
+    const validatedPage = Math.min(1, Math.floor(page || 1));
     const validatedLimit = Math.max(
       VALIDATION.MIN_SPEC_SIZE_BYTES,

[NoCoverage] MethodExpression
src/utils/validation.ts:296:28
     limit?: number,
   ): { page: number; limit: number } {
     const validatedPage = Math.max(1, Math.floor(page || 1));
-    const validatedLimit = Math.max(
-      VALIDATION.MIN_SPEC_SIZE_BYTES,
-      Math.min(100, Math.floor(limit || 20)),
-    );
+    const validatedLimit = Math.min(VALIDATION.MIN_SPEC_SIZE_BYTES, Math.min(100, Math.floor(limit || 20)));
 
     return { page: validatedPage, limit: validatedLimit };

[NoCoverage] MethodExpression
src/utils/validation.ts:298:7
     const validatedPage = Math.max(1, Math.floor(page || 1));
     const validatedLimit = Math.max(
       VALIDATION.MIN_SPEC_SIZE_BYTES,
-      Math.min(100, Math.floor(limit || 20)),
+      Math.max(100, Math.floor(limit || 20)),
     );
 

[Killed] ConditionalExpression
src/utils/validation.ts:308:9
    * Validate search query
    */
   static validateSearchQuery(query: string): void {
-    if (!query || typeof query !== "string") {
+    if (true) {
       throw new ValidationError("Search query must be a non-empty string");
     }
killedBy: APIDataValidator validateSearchQuery should accept valid search queries
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "Search query must be a non-empty string"

      552 |         } else {
      553 |           stryCov_9fa48("2545");
    > 554 |           throw new ValidationError(stryMutAct_9fa48("2546") ? "" : (stryCov_9fa48("2546"), "Search query must be a non-empty string"));

[Killed] BooleanLiteral
src/utils/validation.ts:308:9
    * Validate search query
    */
   static validateSearchQuery(query: string): void {
-    if (!query || typeof query !== "string") {
+    if (query || typeof query !== "string") {
       throw new ValidationError("Search query must be a non-empty string");
     }
killedBy: APIDataValidator validateSearchQuery should accept valid search queries
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "Search query must be a non-empty string"

      552 |         } else {
      553 |           stryCov_9fa48("2545");
    > 554 |           throw new ValidationError(stryMutAct_9fa48("2546") ? "" : (stryCov_9fa48("2546"), "Search query must be a non-empty string"));

[Survived] StringLiteral
src/utils/validation.ts:309:33
    */
   static validateSearchQuery(query: string): void {
     if (!query || typeof query !== "string") {
-      throw new ValidationError("Search query must be a non-empty string");
+      throw new ValidationError("");
     }
 

[Killed] EqualityOperator
src/utils/validation.ts:312:9
       throw new ValidationError("Search query must be a non-empty string");
     }
 
-    if (query.length < 2) {
+    if (query.length >= 2) {
       throw new ValidationError(
         "Search query too short (minimum 2 characters)",
killedBy: APIDataValidator validateSearchQuery should accept valid search queries
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "Search query too short (minimum 2 characters)"

      560 |         } else {
      561 |           stryCov_9fa48("2551");
    > 562 |           throw new ValidationError(stryMutAct_9fa48("2552") ? "" : (stryCov_9fa48("2552"), "Search query too short (minimum 2 characters)"));

[Killed] ConditionalExpression
src/utils/validation.ts:312:9
       throw new ValidationError("Search query must be a non-empty string");
     }
 
-    if (query.length < 2) {
+    if (false) {
       throw new ValidationError(
         "Search query too short (minimum 2 characters)",
killedBy: APIDataValidator validateSearchQuery should reject invalid search queries
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Survived] StringLiteral
src/utils/validation.ts:314:9
 
     if (query.length < 2) {
       throw new ValidationError(
-        "Search query too short (minimum 2 characters)",
+        "",
       );
     }

[Killed] ConditionalExpression
src/utils/validation.ts:318:9
       );
     }
 
-    if (query.length > 1000) {
+    if (true) {
       throw new ValidationError(
         "Search query too long (maximum 1000 characters)",
killedBy: APIDataValidator validateSearchQuery should accept valid search queries
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "Search query too long (maximum 1000 characters)"

      568 |         } else {
      569 |           stryCov_9fa48("2557");
    > 570 |           throw new ValidationError(stryMutAct_9fa48("2558") ? "" : (stryCov_9fa48("2558"), "Search query too long (maximum 1000 characters)"));

[Killed] ConditionalExpression
src/utils/validation.ts:318:9
       );
     }
 
-    if (query.length > 1000) {
+    if (false) {
       throw new ValidationError(
         "Search query too long (maximum 1000 characters)",
killedBy: APIDataValidator validateSearchQuery should reject invalid search queries
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] ConditionalExpression
src/utils/validation.ts:332:9
       /vbscript:/i,
     ];
 
-    if (suspiciousPatterns.some((pattern) => pattern.test(query))) {
+    if (true) {
       throw new ValidationError("Search query contains invalid content");
     }
killedBy: APIDataValidator validateSearchQuery should accept valid search queries
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "Search query contains invalid content"

      579 |         } else {
      580 |           stryCov_9fa48("2564");
    > 581 |           throw new ValidationError(stryMutAct_9fa48("2565") ? "" : (stryCov_9fa48("2565"), "Search query contains invalid content"));

[Survived] MethodExpression
src/utils/validation.ts:332:9
       /vbscript:/i,
     ];
 
-    if (suspiciousPatterns.some((pattern) => pattern.test(query))) {
+    if (suspiciousPatterns.every(pattern => pattern.test(query))) {
       throw new ValidationError("Search query contains invalid content");
     }

[Killed] EqualityOperator
src/utils/validation.ts:346:17
    * Validate URL format and security
    */
   static validateURL(url: string): void {
-    if (!url || typeof url !== "string") {
+    if (!url || typeof url === "string") {
       throw new ValidationError("URL must be a non-empty string");
     }
killedBy: URLValidator validateURL should accept valid URLs
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "URL must be a non-empty string"

      603 |         } else {
      604 |           stryCov_9fa48("2574");
    > 605 |           throw new ValidationError(stryMutAct_9fa48("2575") ? "" : (stryCov_9fa48("2575"), "URL must be a non-empty string"));

[Killed] ConditionalExpression
src/utils/validation.ts:346:9
    * Validate URL format and security
    */
   static validateURL(url: string): void {
-    if (!url || typeof url !== "string") {
+    if (true) {
       throw new ValidationError("URL must be a non-empty string");
     }
killedBy: URLValidator validateURL should accept valid URLs
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "URL must be a non-empty string"

      603 |         } else {
      604 |           stryCov_9fa48("2574");
    > 605 |           throw new ValidationError(stryMutAct_9fa48("2575") ? "" : (stryCov_9fa48("2575"), "URL must be a non-empty string"));

[Killed] StringLiteral
src/utils/validation.ts:347:33
    */
   static validateURL(url: string): void {
     if (!url || typeof url !== "string") {
-      throw new ValidationError("URL must be a non-empty string");
+      throw new ValidationError("");
     }
 
killedBy: URLValidator validateURL should reject invalid or dangerous URLs
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "URL must be a non-empty string"
Received message:   ""

      603 |         } else {
      604 |           stryCov_9fa48("2574");
    > 605 |           throw new ValidationError(stryMutAct_9fa48("2575") ? "" : (stryCov_9fa48("2575"), "URL must be a non-empty string"));

[Killed] BlockStatement
src/utils/validation.ts:350:9
       throw new ValidationError("URL must be a non-empty string");
     }
 
-    try {
-      const parsedURL = new URL(url);
-
-      // Only allow HTTP and HTTPS
-      if (!["http:", "https:"].includes(parsedURL.protocol)) {
-        throw new ValidationError("Only HTTP and HTTPS URLs are allowed");
-      }
-
-      // Block local/private addresses
-      if (URLValidator.isLocalAddress(parsedURL.hostname)) {
-        throw new ValidationError(
-          "Local and private addresses are not allowed",
-        );
-      }
-    } catch (error) {
+    try {} catch (error) {
       if (error instanceof ValidationError) {
         throw error;
killedBy: URLValidator validateURL should reject invalid or dangerous URLs
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Only HTTP and HTTPS URLs are allowed"

Received function did not throw

[Killed] ConditionalExpression
src/utils/validation.ts:354:11
       const parsedURL = new URL(url);
 
       // Only allow HTTP and HTTPS
-      if (!["http:", "https:"].includes(parsedURL.protocol)) {
+      if (false) {
         throw new ValidationError("Only HTTP and HTTPS URLs are allowed");
       }
killedBy: URLValidator validateURL should reject invalid or dangerous URLs
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Only HTTP and HTTPS URLs are allowed"

Received function did not throw

[Killed] BlockStatement
src/utils/validation.ts:354:62
       const parsedURL = new URL(url);
 
       // Only allow HTTP and HTTPS
-      if (!["http:", "https:"].includes(parsedURL.protocol)) {
-        throw new ValidationError("Only HTTP and HTTPS URLs are allowed");
-      }
+      if (!["http:", "https:"].includes(parsedURL.protocol)) {}
 
       // Block local/private addresses
killedBy: URLValidator validateURL should reject invalid or dangerous URLs
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Only HTTP and HTTPS URLs are allowed"

Received function did not throw

[Killed] StringLiteral
src/utils/validation.ts:355:35
 
       // Only allow HTTP and HTTPS
       if (!["http:", "https:"].includes(parsedURL.protocol)) {
-        throw new ValidationError("Only HTTP and HTTPS URLs are allowed");
+        throw new ValidationError("");
       }
 
killedBy: URLValidator validateURL should reject invalid or dangerous URLs
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Only HTTP and HTTPS URLs are allowed"
Received message:   ""

      619 |             } else {
      620 |               stryCov_9fa48("2583");
    > 621 |               throw new ValidationError(stryMutAct_9fa48("2584") ? "" : (stryCov_9fa48("2584"), "Only HTTP and HTTPS URLs are allowed"));

[Killed] BlockStatement
src/utils/validation.ts:359:60
       }
 
       // Block local/private addresses
-      if (URLValidator.isLocalAddress(parsedURL.hostname)) {
-        throw new ValidationError(
-          "Local and private addresses are not allowed",
-        );
-      }
+      if (URLValidator.isLocalAddress(parsedURL.hostname)) {}
     } catch (error) {
       if (error instanceof ValidationError) {
killedBy: URLValidator validateURL should reject local addresses
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Local and private addresses are not allowed"

Received function did not throw

[Killed] ConditionalExpression
src/utils/validation.ts:359:11
       }
 
       // Block local/private addresses
-      if (URLValidator.isLocalAddress(parsedURL.hostname)) {
+      if (true) {
         throw new ValidationError(
           "Local and private addresses are not allowed",
killedBy: URLValidator validateURL should accept valid URLs
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "Local and private addresses are not allowed"

      629 |             } else {
      630 |               stryCov_9fa48("2587");
    > 631 |               throw new ValidationError(stryMutAct_9fa48("2588") ? "" : (stryCov_9fa48("2588"), "Local and private addresses are not allowed"));

[Killed] StringLiteral
src/utils/validation.ts:361:11
       // Block local/private addresses
       if (URLValidator.isLocalAddress(parsedURL.hostname)) {
         throw new ValidationError(
-          "Local and private addresses are not allowed",
+          "",
         );
       }
killedBy: URLValidator validateURL should reject local addresses
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Local and private addresses are not allowed"
Received message:   ""

      629 |             } else {
      630 |               stryCov_9fa48("2587");
    > 631 |               throw new ValidationError(stryMutAct_9fa48("2588") ? "" : (stryCov_9fa48("2588"), "Local and private addresses are not allowed"));

[Killed] BlockStatement
src/utils/validation.ts:364:21
           "Local and private addresses are not allowed",
         );
       }
-    } catch (error) {
-      if (error instanceof ValidationError) {
-        throw error;
-      }
-      throw new ValidationError("Invalid URL format");
-    }
+    } catch (error) {}
   }
 
killedBy: URLValidator validateURL should reject invalid or dangerous URLs
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Only HTTP and HTTPS URLs are allowed"

Received function did not throw

[Killed] ConditionalExpression
src/utils/validation.ts:365:11
         );
       }
     } catch (error) {
-      if (error instanceof ValidationError) {
+      if (true) {
         throw error;
       }
killedBy: URLValidator validateURL should reject invalid or dangerous URLs
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid URL format"
Received message:   "Invalid URL"

      611 |         } else {
      612 |           stryCov_9fa48("2576");
    > 613 |           const parsedURL = new URL(url);

[Killed] ConditionalExpression
src/utils/validation.ts:365:11
         );
       }
     } catch (error) {
-      if (error instanceof ValidationError) {
+      if (false) {
         throw error;
       }
killedBy: URLValidator validateURL should reject invalid or dangerous URLs
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Only HTTP and HTTPS URLs are allowed"
Received message:   "Invalid URL format"

      646 |             }
      647 |           }
    > 648 |           throw new ValidationError(stryMutAct_9fa48("2593") ? "" : (stryCov_9fa48("2593"), "Invalid URL format"));

[Killed] StringLiteral
src/utils/validation.ts:368:33
       if (error instanceof ValidationError) {
         throw error;
       }
-      throw new ValidationError("Invalid URL format");
+      throw new ValidationError("");
     }
   }
killedBy: URLValidator validateURL should reject invalid or dangerous URLs
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid URL format"
Received message:   ""

      646 |             }
      647 |           }
    > 648 |           throw new ValidationError(stryMutAct_9fa48("2593") ? "" : (stryCov_9fa48("2593"), "Invalid URL format"));

[Survived] Regex
src/utils/validation.ts:381:7
       /^127\./,
       /^192\.168\./,
       /^10\./,
-      /^172\.(1[6-9]|2[0-9]|3[0-1])\./,
+      /^172\.(1[6-9]|2[0-9]|3[^0-1])\./,
       /^169\.254\./,
       /^::1$/,

[Killed] MethodExpression
src/utils/validation.ts:387:12
       /^fe80:/i,
     ];
 
-    return localPatterns.some((pattern) => pattern.test(hostname));
+    return localPatterns.every(pattern => pattern.test(hostname));
   }
 }
killedBy: URLValidator validateURL should reject local addresses
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Local and private addresses are not allowed"

Received function did not throw

[Killed] ArrowFunction
src/utils/validation.ts:387:31
       /^fe80:/i,
     ];
 
-    return localPatterns.some((pattern) => pattern.test(hostname));
+    return localPatterns.some(() => undefined);
   }
 }
killedBy: URLValidator validateURL should reject local addresses
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Local and private addresses are not allowed"

Received function did not throw

[Killed] ArrayDeclaration
src/utils/validation.ts:413:30
   static validateProviders(
     providers: any,
   ): ValidationResult<{ data: string[] }> {
-    const errors: string[] = [];
+    const errors: string[] = ["Stryker was here"];
     const warnings: string[] = [];
     const sanitizedData: string[] = [];
killedBy: DataValidator validateProviders should validate and sanitize provider list
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  ["Stryker was here"]

[Killed] ConditionalExpression
src/utils/validation.ts:418:9
     const sanitizedData: string[] = [];
 
     // Check if providers is an object with data property
-    if (!providers || typeof providers !== "object") {
+    if (true) {
       errors.push("Providers response must be an object");
       return {
killedBy: DataValidator validateProviders should validate and sanitize provider list
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/utils/validation.ts:418:54
     const sanitizedData: string[] = [];
 
     // Check if providers is an object with data property
-    if (!providers || typeof providers !== "object") {
-      errors.push("Providers response must be an object");
-      return {
-        isValid: false,
-        data: { data: [] },
-        errors,
-        warnings,
-      };
-    }
+    if (!providers || typeof providers !== "object") {}
 
     // Check if data property exists and is an array
killedBy: DataValidator validateProviders should handle invalid provider data structures
statusReason: TypeError: Cannot read properties of null (reading 'data')

[Killed] BlockStatement
src/utils/validation.ts:429:41
     }
 
     // Check if data property exists and is an array
-    if (!Array.isArray(providers.data)) {
-      errors.push("Providers data must be an array");
-      return {
-        isValid: false,
-        data: { data: [] },
-        errors,
-        warnings,
-      };
-    }
+    if (!Array.isArray(providers.data)) {}
 
     // Validate and sanitize each provider entry
killedBy: DataValidator validateProviders should handle invalid provider data structures
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/utils/validation.ts:429:9
     }
 
     // Check if data property exists and is an array
-    if (!Array.isArray(providers.data)) {
+    if (true) {
       errors.push("Providers data must be an array");
       return {
killedBy: DataValidator validateProviders should validate and sanitize provider list
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/utils/validation.ts:440:21
     }
 
     // Validate and sanitize each provider entry
-    for (let i = 0; i < providers.data.length; i++) {
+    for (let i = 0; false; i++) {
       const provider = providers.data[i];
 
killedBy: DataValidator validateProviders should validate and sanitize provider list
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   "google.com",
-   "microsoft.com",

[Killed] EqualityOperator
src/utils/validation.ts:440:21
     }
 
     // Validate and sanitize each provider entry
-    for (let i = 0; i < providers.data.length; i++) {
+    for (let i = 0; i >= providers.data.length; i++) {
       const provider = providers.data[i];
 
killedBy: DataValidator validateProviders should validate and sanitize provider list
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   "google.com",
-   "microsoft.com",

[Killed] EqualityOperator
src/utils/validation.ts:444:11
       const provider = providers.data[i];
 
       // Skip null, undefined, or empty values
-      if (provider == null || provider === "") {
+      if (provider != null || provider === "") {
         warnings.push(`Skipped null/empty provider at index ${i}`);
         continue;
killedBy: DataValidator validateProviders should validate and sanitize provider list
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   "google.com",
-   "microsoft.com",

[Killed] EqualityOperator
src/utils/validation.ts:444:31
       const provider = providers.data[i];
 
       // Skip null, undefined, or empty values
-      if (provider == null || provider === "") {
+      if (provider == null || provider !== "") {
         warnings.push(`Skipped null/empty provider at index ${i}`);
         continue;
killedBy: DataValidator validateProviders should validate and sanitize provider list
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   "google.com",
-   "microsoft.com",
