[Killed] AssignmentOperator
src/cache/manager.ts:351:9
       let deletedCount = 0;
 
       for (const key of keys) {
-        deletedCount += this.cache.del(key);
+        deletedCount -= this.cache.del(key);
       }
 
killedBy: CacheManager multiple key invalidation should invalidate multiple specific keys
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -2

[Survived] EqualityOperator
src/cache/manager.ts:354:11
         deletedCount += this.cache.del(key);
       }
 
-      if (deletedCount > 0) {
+      if (deletedCount <= 0) {
         Logger.cache("invalidateKeys", "multiple", { count: deletedCount });
       }

[Survived] StringLiteral
src/cache/manager.ts:355:40
       }
 
       if (deletedCount > 0) {
-        Logger.cache("invalidateKeys", "multiple", { count: deletedCount });
+        Logger.cache("invalidateKeys", "", { count: deletedCount });
       }
 

[Survived] StringLiteral
src/cache/manager.ts:355:22
       }
 
       if (deletedCount > 0) {
-        Logger.cache("invalidateKeys", "multiple", { count: deletedCount });
+        Logger.cache("", "multiple", { count: deletedCount });
       }
 

[NoCoverage] StringLiteral
src/cache/manager.ts:360:20
 
       return deletedCount;
     } catch (error) {
-      Logger.error(`Cache invalidateKeys error:`, error);
+      Logger.error(``, error);
       return 0;
     }

[Killed] BooleanLiteral
src/cache/manager.ts:373:9
     fetchFn: () => Promise<T>,
     ttlMs?: number,
   ): Promise<T> {
-    if (!this.enabled) {
+    if (this.enabled) {
       // If cache is disabled, just fetch and return the data
       return await fetchFn();
killedBy: CacheManager cache warming should warm cache with fetched data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "warm-key"

Number of calls: 0

[Survived] ConditionalExpression
src/cache/manager.ts:373:9
     fetchFn: () => Promise<T>,
     ttlMs?: number,
   ): Promise<T> {
-    if (!this.enabled) {
+    if (false) {
       // If cache is disabled, just fetch and return the data
       return await fetchFn();

[Killed] BlockStatement
src/cache/manager.ts:381:33
     try {
       // Check if we already have fresh data
       const cached = this.get<T>(key);
-      if (cached !== undefined) {
-        return cached;
-      }
+      if (cached !== undefined) {}
 
       // Fetch fresh data
killedBy: CacheManager cache warming should return cached data if available
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: called with 0 arguments

[Survived] StringLiteral
src/cache/manager.ts:386:20
       }
 
       // Fetch fresh data
-      Logger.cache("warming", key);
+      Logger.cache("", key);
       const data = await fetchFn();
 

[NoCoverage] StringLiteral
src/cache/manager.ts:394:20
 
       return data;
     } catch (error) {
-      Logger.error(`Cache warmCache error for key ${key}:`, error);
+      Logger.error(``, error);
       // On error, try to fetch without caching
       return await fetchFn();

[Killed] EqualityOperator
src/cache/manager.ts:406:28
   private validateCacheEntry(key: string, wrappedValue: any): boolean {
     try {
       // Check if it's a wrapped value with metadata
-      if (!wrappedValue || typeof wrappedValue !== "object") {
+      if (!wrappedValue || typeof wrappedValue === "object") {
         return false;
       }
killedBy: CacheManager get should retrieve value from cache
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"data": "test"}
Received: undefined

[Killed] ConditionalExpression
src/cache/manager.ts:406:11
   private validateCacheEntry(key: string, wrappedValue: any): boolean {
     try {
       // Check if it's a wrapped value with metadata
-      if (!wrappedValue || typeof wrappedValue !== "object") {
+      if (true) {
         return false;
       }
killedBy: CacheManager get should retrieve value from cache
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"data": "test"}
Received: undefined

[NoCoverage] BooleanLiteral
src/cache/manager.ts:407:16
     try {
       // Check if it's a wrapped value with metadata
       if (!wrappedValue || typeof wrappedValue !== "object") {
-        return false;
+        return true;
       }
 

[Killed] ConditionalExpression
src/cache/manager.ts:412:9
 
       // For backward compatibility, allow unwrapped values
       if (
-        !wrappedValue.value &&
-        !wrappedValue.timestamp &&
-        !wrappedValue.integrity
+        true
       ) {
         return true; // Old format, assume valid
killedBy: CacheManager get should validate cache entry integrity
statusReason: Error: expect(received).toBeUndefined()

Received: {"data": "test"}

[Survived] ConditionalExpression
src/cache/manager.ts:412:9
 
       // For backward compatibility, allow unwrapped values
       if (
-        !wrappedValue.value &&
-        !wrappedValue.timestamp &&
+        true &&
         !wrappedValue.integrity
       ) {

[NoCoverage] BooleanLiteral
src/cache/manager.ts:413:9
       // For backward compatibility, allow unwrapped values
       if (
         !wrappedValue.value &&
-        !wrappedValue.timestamp &&
+        wrappedValue.timestamp &&
         !wrappedValue.integrity
       ) {

[NoCoverage] BooleanLiteral
src/cache/manager.ts:414:9
       if (
         !wrappedValue.value &&
         !wrappedValue.timestamp &&
-        !wrappedValue.integrity
+        wrappedValue.integrity
       ) {
         return true; // Old format, assume valid

[NoCoverage] BlockStatement
src/cache/manager.ts:415:9
         !wrappedValue.value &&
         !wrappedValue.timestamp &&
         !wrappedValue.integrity
-      ) {
-        return true; // Old format, assume valid
-      }
+      ) {}
 
       // Use cache validator for integrity check

[NoCoverage] BooleanLiteral
src/cache/manager.ts:416:16
         !wrappedValue.timestamp &&
         !wrappedValue.integrity
       ) {
-        return true; // Old format, assume valid
+        return false; // Old format, assume valid
       }
 

[Killed] ConditionalExpression
src/cache/manager.ts:420:11
       }
 
       // Use cache validator for integrity check
-      if (!CacheValidator.validateCacheEntry(key, wrappedValue)) {
+      if (true) {
         return false;
       }
killedBy: CacheManager get should retrieve value from cache
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"data": "test"}
Received: undefined

[Killed] ConditionalExpression
src/cache/manager.ts:420:11
       }
 
       // Use cache validator for integrity check
-      if (!CacheValidator.validateCacheEntry(key, wrappedValue)) {
+      if (false) {
         return false;
       }
killedBy: CacheManager get should validate cache entry integrity
statusReason: Error: expect(received).toBeUndefined()

Received: {"data": "test"}

[Killed] BooleanLiteral
src/cache/manager.ts:421:16
 
       // Use cache validator for integrity check
       if (!CacheValidator.validateCacheEntry(key, wrappedValue)) {
-        return false;
+        return true;
       }
 
killedBy: CacheManager get should validate cache entry integrity
statusReason: Error: expect(received).toBeUndefined()

Received: {"data": "test"}

[Survived] ConditionalExpression
src/cache/manager.ts:425:11
       }
 
       // Verify integrity hash if present
-      if (wrappedValue.integrity) {
+      if (true) {
         return CacheValidator.verifyCacheIntegrity(
           wrappedValue.value,

[Survived] BlockStatement
src/cache/manager.ts:425:35
       }
 
       // Verify integrity hash if present
-      if (wrappedValue.integrity) {
-        return CacheValidator.verifyCacheIntegrity(
-          wrappedValue.value,
-          wrappedValue.integrity,
-        );
-      }
+      if (wrappedValue.integrity) {}
 
       return true;

[NoCoverage] BooleanLiteral
src/cache/manager.ts:435:14
       return true;
     } catch (error) {
       Logger.error(`Cache validation error for key ${key}:`, error);
-      return false;
+      return true;
     }
   }

[NoCoverage] BlockStatement
src/cache/manager.ts:448:24
     cleanedKeys: number;
     memoryUsage: number;
   } {
-    if (!this.enabled) {
-      return { totalKeys: 0, corruptedKeys: 0, cleanedKeys: 0, memoryUsage: 0 };
-    }
+    if (!this.enabled) {}
 
     const keys = this.keys();

[NoCoverage] BlockStatement
src/cache/manager.ts:456:29
     let corruptedKeys = 0;
     let cleanedKeys = 0;
 
-    for (const key of keys) {
-      const wrappedValue = this.cache.get(key);
-      if (!this.validateCacheEntry(key, wrappedValue)) {
-        this.delete(key);
-        corruptedKeys++;
-        cleanedKeys++;
-      }
-    }
+    for (const key of keys) {}
 
     const memoryUsage = this.getMemoryUsage();

[NoCoverage] ConditionalExpression
src/cache/manager.ts:458:11
 
     for (const key of keys) {
       const wrappedValue = this.cache.get(key);
-      if (!this.validateCacheEntry(key, wrappedValue)) {
+      if (false) {
         this.delete(key);
         corruptedKeys++;

[NoCoverage] BooleanLiteral
src/cache/manager.ts:458:11
 
     for (const key of keys) {
       const wrappedValue = this.cache.get(key);
-      if (!this.validateCacheEntry(key, wrappedValue)) {
+      if (this.validateCacheEntry(key, wrappedValue)) {
         this.delete(key);
         corruptedKeys++;

[NoCoverage] ObjectLiteral
src/cache/manager.ts:467:46
 
     const memoryUsage = this.getMemoryUsage();
 
-    Logger.cache("healthCheck", "completed", {
-      cleaned: cleanedKeys,
-      total: keys.length,
-      corrupted: corruptedKeys,
-    });
+    Logger.cache("healthCheck", "completed", {});
 
     return {

[NoCoverage] StringLiteral
src/cache/manager.ts:467:18
 
     const memoryUsage = this.getMemoryUsage();
 
-    Logger.cache("healthCheck", "completed", {
+    Logger.cache("", "completed", {
       cleaned: cleanedKeys,
       total: keys.length,
