[Killed] ConditionalExpression
src/utils/validation.ts:450:11
       }
 
       // Convert to string if not already
-      if (typeof provider !== "string") {
+      if (true) {
         warnings.push(
           `Converted non-string provider at index ${i}: ${typeof provider}`,
killedBy: DataValidator validateProviders should handle malicious provider names
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/utils/validation.ts:450:11
       }
 
       // Convert to string if not already
-      if (typeof provider !== "string") {
+      if (typeof provider === "string") {
         warnings.push(
           `Converted non-string provider at index ${i}: ${typeof provider}`,
killedBy: DataValidator validateProviders should handle malicious provider names
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[NoCoverage] ConditionalExpression
src/utils/validation.ts:455:13
           `Converted non-string provider at index ${i}: ${typeof provider}`,
         );
         const stringified = String(provider);
-        if (stringified === "[object Object]") {
+        if (true) {
           warnings.push(`Skipped unparseable object at index ${i}`);
           continue;

[NoCoverage] BlockStatement
src/utils/validation.ts:455:48
           `Converted non-string provider at index ${i}: ${typeof provider}`,
         );
         const stringified = String(provider);
-        if (stringified === "[object Object]") {
-          warnings.push(`Skipped unparseable object at index ${i}`);
-          continue;
-        }
+        if (stringified === "[object Object]") {}
         sanitizedData.push(stringified);
         continue;

[Survived] MethodExpression
src/utils/validation.ts:464:23
       }
 
       // Validate string is not empty after trim
-      const trimmed = provider.trim();
+      const trimmed = provider;
       if (trimmed.length === 0) {
         warnings.push(`Skipped empty provider at index ${i}`);

[Killed] ConditionalExpression
src/utils/validation.ts:465:11
 
       // Validate string is not empty after trim
       const trimmed = provider.trim();
-      if (trimmed.length === 0) {
+      if (true) {
         warnings.push(`Skipped empty provider at index ${i}`);
         continue;
killedBy: DataValidator validateProviders should validate and sanitize provider list
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   "google.com",
-   "microsoft.com",

[Killed] EqualityOperator
src/utils/validation.ts:465:11
 
       // Validate string is not empty after trim
       const trimmed = provider.trim();
-      if (trimmed.length === 0) {
+      if (trimmed.length !== 0) {
         warnings.push(`Skipped empty provider at index ${i}`);
         continue;
killedBy: DataValidator validateProviders should validate and sanitize provider list
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   "google.com",
-   "microsoft.com",

[NoCoverage] StringLiteral
src/utils/validation.ts:466:23
       // Validate string is not empty after trim
       const trimmed = provider.trim();
       if (trimmed.length === 0) {
-        warnings.push(`Skipped empty provider at index ${i}`);
+        warnings.push(``);
         continue;
       }

[Survived] ConditionalExpression
src/utils/validation.ts:471:11
       }
 
       // Basic domain validation (contains dot and no spaces)
-      if (!trimmed.includes(".") || trimmed.includes(" ")) {
+      if (false) {
         warnings.push(`Suspicious provider format at index ${i}: "${trimmed}"`);
       }

[Survived] BlockStatement
src/utils/validation.ts:471:60
       }
 
       // Basic domain validation (contains dot and no spaces)
-      if (!trimmed.includes(".") || trimmed.includes(" ")) {
-        warnings.push(`Suspicious provider format at index ${i}: "${trimmed}"`);
-      }
+      if (!trimmed.includes(".") || trimmed.includes(" ")) {}
 
       // Check for potential XSS/injection attempts

[Survived] StringLiteral
src/utils/validation.ts:472:23
 
       // Basic domain validation (contains dot and no spaces)
       if (!trimmed.includes(".") || trimmed.includes(" ")) {
-        warnings.push(`Suspicious provider format at index ${i}: "${trimmed}"`);
+        warnings.push(``);
       }
 

[Killed] ConditionalExpression
src/utils/validation.ts:476:11
       }
 
       // Check for potential XSS/injection attempts
-      if (this.containsSuspiciousContent(trimmed)) {
+      if (false) {
         warnings.push(
           `Potentially malicious provider at index ${i}: "${trimmed}"`,
killedBy: DataValidator validateProviders should handle malicious provider names
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/utils/validation.ts:476:52
       }
 
       // Check for potential XSS/injection attempts
-      if (this.containsSuspiciousContent(trimmed)) {
-        warnings.push(
-          `Potentially malicious provider at index ${i}: "${trimmed}"`,
-        );
-        // Still include it but logged for monitoring
-      }
+      if (this.containsSuspiciousContent(trimmed)) {}
 
       sanitizedData.push(trimmed);
killedBy: DataValidator validateProviders should handle malicious provider names
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/utils/validation.ts:518:9
     const errors: string[] = [];
     const warnings: string[] = [];
 
-    if (!searchResults || typeof searchResults !== "object") {
+    if (searchResults || typeof searchResults !== "object") {
       errors.push("Search results must be an object");
       return {
killedBy: DataValidator validateSearchResults should validate valid search results
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/utils/validation.ts:518:9
     const errors: string[] = [];
     const warnings: string[] = [];
 
-    if (!searchResults || typeof searchResults !== "object") {
+    if (true) {
       errors.push("Search results must be an object");
       return {
killedBy: DataValidator validateSearchResults should validate valid search results
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/utils/validation.ts:540:9
 
     // Validate results array
     const results: any[] = [];
-    if (Array.isArray(searchResults.results)) {
+    if (false) {
       for (let i = 0; i < searchResults.results.length; i++) {
         const result = searchResults.results[i];
killedBy: DataValidator validateSearchResults should validate valid search results
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Survived] ConditionalExpression
src/utils/validation.ts:540:9
 
     // Validate results array
     const results: any[] = [];
-    if (Array.isArray(searchResults.results)) {
+    if (true) {
       for (let i = 0; i < searchResults.results.length; i++) {
         const result = searchResults.results[i];

[Killed] EqualityOperator
src/utils/validation.ts:541:23
     // Validate results array
     const results: any[] = [];
     if (Array.isArray(searchResults.results)) {
-      for (let i = 0; i < searchResults.results.length; i++) {
+      for (let i = 0; i >= searchResults.results.length; i++) {
         const result = searchResults.results[i];
         if (result && typeof result === "object") {
killedBy: DataValidator validateSearchResults should validate valid search results
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] ConditionalExpression
src/utils/validation.ts:541:23
     // Validate results array
     const results: any[] = [];
     if (Array.isArray(searchResults.results)) {
-      for (let i = 0; i < searchResults.results.length; i++) {
+      for (let i = 0; false; i++) {
         const result = searchResults.results[i];
         if (result && typeof result === "object") {
killedBy: DataValidator validateSearchResults should validate valid search results
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] EqualityOperator
src/utils/validation.ts:543:23
     if (Array.isArray(searchResults.results)) {
       for (let i = 0; i < searchResults.results.length; i++) {
         const result = searchResults.results[i];
-        if (result && typeof result === "object") {
+        if (result && typeof result !== "object") {
           const sanitized = {
             id: String(result.id || `unknown-${i}`),
killedBy: DataValidator validateSearchResults should validate valid search results
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] ConditionalExpression
src/utils/validation.ts:543:13
     if (Array.isArray(searchResults.results)) {
       for (let i = 0; i < searchResults.results.length; i++) {
         const result = searchResults.results[i];
-        if (result && typeof result === "object") {
+        if (false) {
           const sanitized = {
             id: String(result.id || `unknown-${i}`),
killedBy: DataValidator validateSearchResults should validate valid search results
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Survived] ConditionalExpression
src/utils/validation.ts:545:24
         const result = searchResults.results[i];
         if (result && typeof result === "object") {
           const sanitized = {
-            id: String(result.id || `unknown-${i}`),
+            id: String(true),
             title: String(result.title || "Untitled API"),
             description: String(result.description || "").substring(0, 500),

[Survived] LogicalOperator
src/utils/validation.ts:545:24
         const result = searchResults.results[i];
         if (result && typeof result === "object") {
           const sanitized = {
-            id: String(result.id || `unknown-${i}`),
+            id: String(result.id && `unknown-${i}`),
             title: String(result.title || "Untitled API"),
             description: String(result.description || "").substring(0, 500),

[Survived] ConditionalExpression
src/utils/validation.ts:546:27
         if (result && typeof result === "object") {
           const sanitized = {
             id: String(result.id || `unknown-${i}`),
-            title: String(result.title || "Untitled API"),
+            title: String(false),
             description: String(result.description || "").substring(0, 500),
             provider: String(result.provider || "unknown"),

[Survived] ConditionalExpression
src/utils/validation.ts:546:27
         if (result && typeof result === "object") {
           const sanitized = {
             id: String(result.id || `unknown-${i}`),
-            title: String(result.title || "Untitled API"),
+            title: String(true),
             description: String(result.description || "").substring(0, 500),
             provider: String(result.provider || "unknown"),

[Survived] ConditionalExpression
src/utils/validation.ts:547:33
           const sanitized = {
             id: String(result.id || `unknown-${i}`),
             title: String(result.title || "Untitled API"),
-            description: String(result.description || "").substring(0, 500),
+            description: String(false).substring(0, 500),
             provider: String(result.provider || "unknown"),
             preferred: String(result.preferred || "v1"),

[Survived] ConditionalExpression
src/utils/validation.ts:547:33
           const sanitized = {
             id: String(result.id || `unknown-${i}`),
             title: String(result.title || "Untitled API"),
-            description: String(result.description || "").substring(0, 500),
+            description: String(true).substring(0, 500),
             provider: String(result.provider || "unknown"),
             preferred: String(result.preferred || "v1"),

[Survived] LogicalOperator
src/utils/validation.ts:548:30
             id: String(result.id || `unknown-${i}`),
             title: String(result.title || "Untitled API"),
             description: String(result.description || "").substring(0, 500),
-            provider: String(result.provider || "unknown"),
+            provider: String(result.provider && "unknown"),
             preferred: String(result.preferred || "v1"),
             categories: Array.isArray(result.categories)

[Survived] ConditionalExpression
src/utils/validation.ts:548:30
             id: String(result.id || `unknown-${i}`),
             title: String(result.title || "Untitled API"),
             description: String(result.description || "").substring(0, 500),
-            provider: String(result.provider || "unknown"),
+            provider: String(true),
             preferred: String(result.preferred || "v1"),
             categories: Array.isArray(result.categories)

[Survived] ConditionalExpression
src/utils/validation.ts:549:31
             title: String(result.title || "Untitled API"),
             description: String(result.description || "").substring(0, 500),
             provider: String(result.provider || "unknown"),
-            preferred: String(result.preferred || "v1"),
+            preferred: String(true),
             categories: Array.isArray(result.categories)
               ? result.categories

[Survived] LogicalOperator
src/utils/validation.ts:549:31
             title: String(result.title || "Untitled API"),
             description: String(result.description || "").substring(0, 500),
             provider: String(result.provider || "unknown"),
-            preferred: String(result.preferred || "v1"),
+            preferred: String(result.preferred && "v1"),
             categories: Array.isArray(result.categories)
               ? result.categories

[Survived] MethodExpression
src/utils/validation.ts:551:17
             provider: String(result.provider || "unknown"),
             preferred: String(result.preferred || "v1"),
             categories: Array.isArray(result.categories)
-              ? result.categories
-                  .filter((c: any) => c != null && c !== "")
+              ? result.categories
                   .map((c: any) => String(c))
                   .filter((c: string) => c.length > 0)

[Survived] MethodExpression
src/utils/validation.ts:551:17
             provider: String(result.provider || "unknown"),
             preferred: String(result.preferred || "v1"),
             categories: Array.isArray(result.categories)
-              ? result.categories
-                  .filter((c: any) => c != null && c !== "")
-                  .map((c: any) => String(c))
-                  .filter((c: string) => c.length > 0)
+              ? result.categories.filter((c: any) => c != null && c !== "").map((c: any) => String(c))
               : [],
           };

[Survived] ArrowFunction
src/utils/validation.ts:552:27
             preferred: String(result.preferred || "v1"),
             categories: Array.isArray(result.categories)
               ? result.categories
-                  .filter((c: any) => c != null && c !== "")
+                  .filter(() => undefined)
                   .map((c: any) => String(c))
                   .filter((c: string) => c.length > 0)

[Survived] ConditionalExpression
src/utils/validation.ts:552:39
             preferred: String(result.preferred || "v1"),
             categories: Array.isArray(result.categories)
               ? result.categories
-                  .filter((c: any) => c != null && c !== "")
+                  .filter((c: any) => true)
                   .map((c: any) => String(c))
                   .filter((c: string) => c.length > 0)

[Killed] ArrowFunction
src/utils/validation.ts:553:24
             categories: Array.isArray(result.categories)
               ? result.categories
                   .filter((c: any) => c != null && c !== "")
-                  .map((c: any) => String(c))
+                  .map(() => undefined)
                   .filter((c: string) => c.length > 0)
               : [],
killedBy: DataValidator validateSearchResults should validate valid search results
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Survived] EqualityOperator
src/utils/validation.ts:554:42
               ? result.categories
                   .filter((c: any) => c != null && c !== "")
                   .map((c: any) => String(c))
-                  .filter((c: string) => c.length > 0)
+                  .filter((c: string) => c.length <= 0)
               : [],
           };

[Survived] ArrowFunction
src/utils/validation.ts:554:27
               ? result.categories
                   .filter((c: any) => c != null && c !== "")
                   .map((c: any) => String(c))
-                  .filter((c: string) => c.length > 0)
+                  .filter(() => undefined)
               : [],
           };

[Killed] ConditionalExpression
src/utils/validation.ts:560:13
 
           // Check for suspicious content
           if (
-            this.containsSuspiciousContent(sanitized.id) ||
-            this.containsSuspiciousContent(sanitized.title) ||
-            this.containsSuspiciousContent(sanitized.description)
+            false
           ) {
             warnings.push(
killedBy: DataValidator validateSearchResults should detect and flag malicious content in search results
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Survived] ConditionalExpression
src/utils/validation.ts:560:13
 
           // Check for suspicious content
           if (
-            this.containsSuspiciousContent(sanitized.id) ||
-            this.containsSuspiciousContent(sanitized.title) ||
+            false ||
             this.containsSuspiciousContent(sanitized.description)
           ) {

[Killed] BlockStatement
src/utils/validation.ts:563:13
             this.containsSuspiciousContent(sanitized.id) ||
             this.containsSuspiciousContent(sanitized.title) ||
             this.containsSuspiciousContent(sanitized.description)
-          ) {
-            warnings.push(
-              `Potentially malicious content in search result ${i}`,
-            );
-          }
+          ) {}
 
           results.push(sanitized);
killedBy: DataValidator validateSearchResults should detect and flag malicious content in search results
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] StringLiteral
src/utils/validation.ts:565:15
             this.containsSuspiciousContent(sanitized.description)
           ) {
             warnings.push(
-              `Potentially malicious content in search result ${i}`,
+              ``,
             );
           }
killedBy: DataValidator validateSearchResults should detect and flag malicious content in search results
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[NoCoverage] BlockStatement
src/utils/validation.ts:570:16
           }
 
           results.push(sanitized);
-        } else {
-          warnings.push(`Skipped invalid search result at index ${i}`);
-        }
+        } else {}
       }
     } else {

[NoCoverage] BlockStatement
src/utils/validation.ts:574:12
           warnings.push(`Skipped invalid search result at index ${i}`);
         }
       }
-    } else {
-      warnings.push(
-        "Search results.results must be an array, using empty array",
-      );
-    }
+    } else {}
 
     // Validate pagination

[NoCoverage] StringLiteral
src/utils/validation.ts:576:9
       }
     } else {
       warnings.push(
-        "Search results.results must be an array, using empty array",
+        "",
       );
     }

[Survived] OptionalChaining
src/utils/validation.ts:582:7
 
     // Validate pagination
     const paginationPage = this.validateNumber(
-      searchResults.pagination?.page,
+      searchResults.pagination.page,
       "pagination.page",
       warnings,

[Survived] OptionalChaining
src/utils/validation.ts:587:7
       warnings,
     );
     const paginationLimit = this.validateNumber(
-      searchResults.pagination?.limit,
+      searchResults.pagination.limit,
       "pagination.limit",
       warnings,

[Survived] StringLiteral
src/utils/validation.ts:588:7
     );
     const paginationLimit = this.validateNumber(
       searchResults.pagination?.limit,
-      "pagination.limit",
+      "",
       warnings,
     );

[Survived] OptionalChaining
src/utils/validation.ts:592:7
       warnings,
     );
     const paginationTotalResults = this.validateNumber(
-      searchResults.pagination?.total_results,
+      searchResults.pagination.total_results,
       "pagination.total_results",
       warnings,

[Survived] OptionalChaining
src/utils/validation.ts:597:7
       warnings,
     );
     const paginationTotalPages = this.validateNumber(
-      searchResults.pagination?.total_pages,
+      searchResults.pagination.total_pages,
       "pagination.total_pages",
       warnings,

[Survived] StringLiteral
src/utils/validation.ts:598:7
     );
     const paginationTotalPages = this.validateNumber(
       searchResults.pagination?.total_pages,
-      "pagination.total_pages",
+      "",
       warnings,
     );

[Survived] EqualityOperator
src/utils/validation.ts:603:13
     );
 
     const pagination = {
-      page: paginationPage > 0 ? paginationPage : 1,
+      page: paginationPage <= 0 ? paginationPage : 1,
       limit: paginationLimit > 0 ? paginationLimit : 20,
       total_results:

[Survived] EqualityOperator
src/utils/validation.ts:603:13
     );
 
     const pagination = {
-      page: paginationPage > 0 ? paginationPage : 1,
+      page: paginationPage >= 0 ? paginationPage : 1,
       limit: paginationLimit > 0 ? paginationLimit : 20,
       total_results:

[Survived] EqualityOperator
src/utils/validation.ts:604:14
 
     const pagination = {
       page: paginationPage > 0 ? paginationPage : 1,
-      limit: paginationLimit > 0 ? paginationLimit : 20,
+      limit: paginationLimit <= 0 ? paginationLimit : 20,
       total_results:
         paginationTotalResults >= 0 ? paginationTotalResults : results.length,

[Survived] EqualityOperator
src/utils/validation.ts:604:14
 
     const pagination = {
       page: paginationPage > 0 ? paginationPage : 1,
-      limit: paginationLimit > 0 ? paginationLimit : 20,
+      limit: paginationLimit >= 0 ? paginationLimit : 20,
       total_results:
         paginationTotalResults >= 0 ? paginationTotalResults : results.length,

[Survived] EqualityOperator
src/utils/validation.ts:606:9
       page: paginationPage > 0 ? paginationPage : 1,
       limit: paginationLimit > 0 ? paginationLimit : 20,
       total_results:
-        paginationTotalResults >= 0 ? paginationTotalResults : results.length,
+        paginationTotalResults > 0 ? paginationTotalResults : results.length,
       total_pages: paginationTotalPages > 0 ? paginationTotalPages : 1,
       has_next: Boolean(searchResults.pagination?.has_next),

[Survived] EqualityOperator
src/utils/validation.ts:606:9
       page: paginationPage > 0 ? paginationPage : 1,
       limit: paginationLimit > 0 ? paginationLimit : 20,
       total_results:
-        paginationTotalResults >= 0 ? paginationTotalResults : results.length,
+        paginationTotalResults < 0 ? paginationTotalResults : results.length,
       total_pages: paginationTotalPages > 0 ? paginationTotalPages : 1,
       has_next: Boolean(searchResults.pagination?.has_next),

[Survived] EqualityOperator
src/utils/validation.ts:607:20
       limit: paginationLimit > 0 ? paginationLimit : 20,
       total_results:
         paginationTotalResults >= 0 ? paginationTotalResults : results.length,
-      total_pages: paginationTotalPages > 0 ? paginationTotalPages : 1,
+      total_pages: paginationTotalPages >= 0 ? paginationTotalPages : 1,
       has_next: Boolean(searchResults.pagination?.has_next),
       has_previous: Boolean(searchResults.pagination?.has_previous),

[Survived] ConditionalExpression
src/utils/validation.ts:607:20
       limit: paginationLimit > 0 ? paginationLimit : 20,
       total_results:
         paginationTotalResults >= 0 ? paginationTotalResults : results.length,
-      total_pages: paginationTotalPages > 0 ? paginationTotalPages : 1,
+      total_pages: true ? paginationTotalPages : 1,
       has_next: Boolean(searchResults.pagination?.has_next),
       has_previous: Boolean(searchResults.pagination?.has_previous),

[Survived] OptionalChaining
src/utils/validation.ts:608:25
       total_results:
         paginationTotalResults >= 0 ? paginationTotalResults : results.length,
       total_pages: paginationTotalPages > 0 ? paginationTotalPages : 1,
-      has_next: Boolean(searchResults.pagination?.has_next),
+      has_next: Boolean(searchResults.pagination.has_next),
       has_previous: Boolean(searchResults.pagination?.has_previous),
     };

[Survived] OptionalChaining
src/utils/validation.ts:609:29
         paginationTotalResults >= 0 ? paginationTotalResults : results.length,
       total_pages: paginationTotalPages > 0 ? paginationTotalPages : 1,
       has_next: Boolean(searchResults.pagination?.has_next),
-      has_previous: Boolean(searchResults.pagination?.has_previous),
+      has_previous: Boolean(searchResults.pagination.has_previous),
     };
 

[Survived] ArrayDeclaration
src/utils/validation.ts:629:30
     numEndpoints: number;
     [key: string]: any;
   }> {
-    const errors: string[] = [];
+    const errors: string[] = ["Stryker was here"];
     const warnings: string[] = [];
 

[Killed] ConditionalExpression
src/utils/validation.ts:632:9
     const errors: string[] = [];
     const warnings: string[] = [];
 
-    if (!metrics || typeof metrics !== "object") {
+    if (true) {
       errors.push("Metrics response must be an object");
       return {
killedBy: DataValidator validateMetrics should validate valid metrics
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/utils/validation.ts:632:9
     const errors: string[] = [];
     const warnings: string[] = [];
 
-    if (!metrics || typeof metrics !== "object") {
+    if (metrics || typeof metrics !== "object") {
       errors.push("Metrics response must be an object");
       return {
killedBy: DataValidator validateMetrics should validate valid metrics
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] StringLiteral
src/utils/validation.ts:648:58
       "numSpecs",
       warnings,
     );
-    const numAPIs = this.validateNumber(metrics.numAPIs, "numAPIs", warnings);
+    const numAPIs = this.validateNumber(metrics.numAPIs, "", warnings);
     const numEndpoints = this.validateNumber(
       metrics.numEndpoints,

[Survived] StringLiteral
src/utils/validation.ts:651:7
     const numAPIs = this.validateNumber(metrics.numAPIs, "numAPIs", warnings);
     const numEndpoints = this.validateNumber(
       metrics.numEndpoints,
-      "numEndpoints",
+      "",
       warnings,
     );

[Killed] EqualityOperator
src/utils/validation.ts:739:9
     fieldName: string,
     warnings: string[],
   ): number {
-    if (typeof value === "number" && !isNaN(value) && value >= 0) {
+    if (typeof value !== "number" && !isNaN(value) && value >= 0) {
       return Math.floor(value); // Ensure integer
     }
killedBy: DataValidator validateMetrics should validate valid metrics
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 0

[Killed] BlockStatement
src/utils/validation.ts:739:67
     fieldName: string,
     warnings: string[],
   ): number {
-    if (typeof value === "number" && !isNaN(value) && value >= 0) {
-      return Math.floor(value); // Ensure integer
-    }
+    if (typeof value === "number" && !isNaN(value) && value >= 0) {}
 
     if (typeof value === "string") {
killedBy: DataValidator validateMetrics should validate valid metrics
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 0

[Survived] BlockStatement
src/utils/validation.ts:743:36
       return Math.floor(value); // Ensure integer
     }
 
-    if (typeof value === "string") {
-      const parsed = parseInt(value, 10);
-      if (!isNaN(parsed) && parsed >= 0) {
-        warnings.push(
-          `Converted string to number for ${fieldName}: "${value}" -> ${parsed}`,
-        );
-        return parsed;
-      }
-    }
+    if (typeof value === "string") {}
 
     warnings.push(`Invalid ${fieldName} value: ${value}, using 0`);

[Killed] ConditionalExpression
src/utils/validation.ts:745:11
 
     if (typeof value === "string") {
       const parsed = parseInt(value, 10);
-      if (!isNaN(parsed) && parsed >= 0) {
+      if (true) {
         warnings.push(
           `Converted string to number for ${fieldName}: "${value}" -> ${parsed}`,
killedBy: DataValidator validateMetrics should handle invalid metrics gracefully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: NaN
