[Killed] EqualityOperator
src/cache/persistent-manager.ts:25:20
 
   constructor(ttlMs: number = 86400000) {
     // 24 hours default
-    this.enabled = process.env.DISABLE_CACHE !== "true";
+    this.enabled = process.env.DISABLE_CACHE === "true";
     this.ttlMs = ttlMs;
     this.cacheData = new Map<string, CacheEntry>();
killedBy: PersistentCacheManager constructor should initialize with default TTL and cache directory
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/cache/persistent-manager.ts:25:20
 
   constructor(ttlMs: number = 86400000) {
     // 24 hours default
-    this.enabled = process.env.DISABLE_CACHE !== "true";
+    this.enabled = false;
     this.ttlMs = ttlMs;
     this.cacheData = new Map<string, CacheEntry>();
killedBy: PersistentCacheManager constructor should initialize with default TTL and cache directory
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
src/cache/persistent-manager.ts:34:47
       process.env.OPENAPI_DIRECTORY_CACHE_DIR ||
       join(homedir(), ".cache", "openapi-directory-mcp");
     this.cacheFile = join(this.cacheDir, "cache.json");
-    this.invalidateFlag = join(this.cacheDir, ".invalidate");
+    this.invalidateFlag = join(this.cacheDir, "");
 
     if (this.enabled) {
killedBy: PersistentCacheManager invalidation should check for invalidation flag on get
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/home/test/.cache/openapi-directory-mcp/.invalidate"
Received: "/home/test/.cache/openapi-directory-mcp"

Number of calls: 1

[Killed] BlockStatement
src/cache/persistent-manager.ts:36:23
     this.cacheFile = join(this.cacheDir, "cache.json");
     this.invalidateFlag = join(this.cacheDir, ".invalidate");
 
-    if (this.enabled) {
-      this.initializeCache();
-    }
+    if (this.enabled) {}
   }
 
killedBy: PersistentCacheManager constructor should create cache directory if it does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/home/test/.cache/openapi-directory-mcp", {"recursive": true}

Number of calls: 0

[Killed] ConditionalExpression
src/cache/persistent-manager.ts:36:9
     this.cacheFile = join(this.cacheDir, "cache.json");
     this.invalidateFlag = join(this.cacheDir, ".invalidate");
 
-    if (this.enabled) {
+    if (false) {
       this.initializeCache();
     }
killedBy: PersistentCacheManager constructor should create cache directory if it does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/home/test/.cache/openapi-directory-mcp", {"recursive": true}

Number of calls: 0

[Killed] BlockStatement
src/cache/persistent-manager.ts:42:9
   }
 
   private initializeCache(): void {
-    try {
-      // Create cache directory if it doesn't exist
-      if (!existsSync(this.cacheDir)) {
-        mkdirSync(this.cacheDir, { recursive: true });
-        Logger.info(`Created cache directory: ${this.cacheDir}`);
-      }
-
-      // Check for invalidation flag before loading cache
-      this.checkInvalidationFlag();
-
-      // Load existing cache data if it exists
-      this.loadFromDisk();
-
-      Logger.info(`Persistent cache initialized: ${this.cacheFile}`);
-
-      // Set up automatic persistence interval (disabled in test environment)
-      if (process.env.NODE_ENV !== "test") {
-        this.persistTimer = setInterval(() => {
-          this.persistToDisk();
-        }, this.persistInterval);
-      }
-
-      // Clean expired entries on startup
-      this.cleanExpired();
-    } catch (error) {
+    try {} catch (error) {
       Logger.error("Failed to initialize persistent cache:", error);
       this.enabled = false;
killedBy: PersistentCacheManager constructor should create cache directory if it does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/home/test/.cache/openapi-directory-mcp", {"recursive": true}

Number of calls: 0

[Killed] ConditionalExpression
src/cache/persistent-manager.ts:44:11
   private initializeCache(): void {
     try {
       // Create cache directory if it doesn't exist
-      if (!existsSync(this.cacheDir)) {
+      if (false) {
         mkdirSync(this.cacheDir, { recursive: true });
         Logger.info(`Created cache directory: ${this.cacheDir}`);
killedBy: PersistentCacheManager constructor should create cache directory if it does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/home/test/.cache/openapi-directory-mcp", {"recursive": true}

Number of calls: 0

[Killed] ConditionalExpression
src/cache/persistent-manager.ts:44:11
   private initializeCache(): void {
     try {
       // Create cache directory if it doesn't exist
-      if (!existsSync(this.cacheDir)) {
+      if (true) {
         mkdirSync(this.cacheDir, { recursive: true });
         Logger.info(`Created cache directory: ${this.cacheDir}`);
killedBy: PersistentCacheManager constructor should load existing cache on initialization
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/home/test/.cache/openapi-directory-mcp/cache.json", "utf8"

Number of calls: 0

[Killed] BooleanLiteral
src/cache/persistent-manager.ts:45:47
     try {
       // Create cache directory if it doesn't exist
       if (!existsSync(this.cacheDir)) {
-        mkdirSync(this.cacheDir, { recursive: true });
+        mkdirSync(this.cacheDir, { recursive: false });
         Logger.info(`Created cache directory: ${this.cacheDir}`);
       }
killedBy: PersistentCacheManager constructor should create cache directory if it does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/home/test/.cache/openapi-directory-mcp", {"recursive": true}
Received
       1
          "/home/test/.cache/openapi-directory-mcp",
          Object {
        -   "recursive": true,

[Survived] StringLiteral
src/cache/persistent-manager.ts:46:21
       // Create cache directory if it doesn't exist
       if (!existsSync(this.cacheDir)) {
         mkdirSync(this.cacheDir, { recursive: true });
-        Logger.info(`Created cache directory: ${this.cacheDir}`);
+        Logger.info(``);
       }
 

[Survived] EqualityOperator
src/cache/persistent-manager.ts:58:11
       Logger.info(`Persistent cache initialized: ${this.cacheFile}`);
 
       // Set up automatic persistence interval (disabled in test environment)
-      if (process.env.NODE_ENV !== "test") {
+      if (process.env.NODE_ENV === "test") {
         this.persistTimer = setInterval(() => {
           this.persistToDisk();

[Survived] ConditionalExpression
src/cache/persistent-manager.ts:58:11
       Logger.info(`Persistent cache initialized: ${this.cacheFile}`);
 
       // Set up automatic persistence interval (disabled in test environment)
-      if (process.env.NODE_ENV !== "test") {
+      if (false) {
         this.persistTimer = setInterval(() => {
           this.persistToDisk();

[NoCoverage] BlockStatement
src/cache/persistent-manager.ts:59:47
 
       // Set up automatic persistence interval (disabled in test environment)
       if (process.env.NODE_ENV !== "test") {
-        this.persistTimer = setInterval(() => {
-          this.persistToDisk();
-        }, this.persistInterval);
+        this.persistTimer = setInterval(() => {}, this.persistInterval);
       }
 

[Survived] BlockStatement
src/cache/persistent-manager.ts:66:21
 
       // Clean expired entries on startup
       this.cleanExpired();
-    } catch (error) {
-      Logger.error("Failed to initialize persistent cache:", error);
-      this.enabled = false;
-    }
+    } catch (error) {}
   }
 

[Survived] BooleanLiteral
src/cache/persistent-manager.ts:68:22
       this.cleanExpired();
     } catch (error) {
       Logger.error("Failed to initialize persistent cache:", error);
-      this.enabled = false;
+      this.enabled = true;
     }
   }

[Killed] BlockStatement
src/cache/persistent-manager.ts:75:41
   /**
    * Check for invalidation flag and clear cache if present
    */
-  private checkInvalidationFlag(): void {
-    if (existsSync(this.invalidateFlag)) {
-      Logger.info("Cache invalidation flag detected, clearing cache...");
-      this.cacheData.clear();
-      try {
-        require("fs").unlinkSync(this.invalidateFlag);
-        Logger.info("Cache invalidation flag removed");
-      } catch (error) {
-        Logger.error("Failed to remove invalidation flag:", error);
-      }
-    }
-  }
+  private checkInvalidationFlag(): void {}
 
   /**
killedBy: PersistentCacheManager constructor should load existing cache on initialization
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/home/test/.cache/openapi-directory-mcp/cache.json", "utf8"

Number of calls: 0

[Killed] BlockStatement
src/cache/persistent-manager.ts:76:42
    * Check for invalidation flag and clear cache if present
    */
   private checkInvalidationFlag(): void {
-    if (existsSync(this.invalidateFlag)) {
-      Logger.info("Cache invalidation flag detected, clearing cache...");
-      this.cacheData.clear();
-      try {
-        require("fs").unlinkSync(this.invalidateFlag);
-        Logger.info("Cache invalidation flag removed");
-      } catch (error) {
-        Logger.error("Failed to remove invalidation flag:", error);
-      }
-    }
+    if (existsSync(this.invalidateFlag)) {}
   }
 
killedBy: PersistentCacheManager invalidation should check for invalidation flag on get
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/home/test/.cache/openapi-directory-mcp/.invalidate"

Number of calls: 0

[Killed] ConditionalExpression
src/cache/persistent-manager.ts:76:9
    * Check for invalidation flag and clear cache if present
    */
   private checkInvalidationFlag(): void {
-    if (existsSync(this.invalidateFlag)) {
+    if (false) {
       Logger.info("Cache invalidation flag detected, clearing cache...");
       this.cacheData.clear();
killedBy: PersistentCacheManager constructor should load existing cache on initialization
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/home/test/.cache/openapi-directory-mcp/cache.json", "utf8"

Number of calls: 0

[Survived] StringLiteral
src/cache/persistent-manager.ts:77:19
    */
   private checkInvalidationFlag(): void {
     if (existsSync(this.invalidateFlag)) {
-      Logger.info("Cache invalidation flag detected, clearing cache...");
+      Logger.info("");
       this.cacheData.clear();
       try {

[Killed] BlockStatement
src/cache/persistent-manager.ts:79:11
     if (existsSync(this.invalidateFlag)) {
       Logger.info("Cache invalidation flag detected, clearing cache...");
       this.cacheData.clear();
-      try {
-        require("fs").unlinkSync(this.invalidateFlag);
-        Logger.info("Cache invalidation flag removed");
-      } catch (error) {
+      try {} catch (error) {
         Logger.error("Failed to remove invalidation flag:", error);
       }
killedBy: PersistentCacheManager invalidation should check for invalidation flag on get
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/home/test/.cache/openapi-directory-mcp/.invalidate"

Number of calls: 0

[Survived] StringLiteral
src/cache/persistent-manager.ts:81:21
       this.cacheData.clear();
       try {
         require("fs").unlinkSync(this.invalidateFlag);
-        Logger.info("Cache invalidation flag removed");
+        Logger.info("");
       } catch (error) {
         Logger.error("Failed to remove invalidation flag:", error);

[NoCoverage] BlockStatement
src/cache/persistent-manager.ts:82:23
       try {
         require("fs").unlinkSync(this.invalidateFlag);
         Logger.info("Cache invalidation flag removed");
-      } catch (error) {
-        Logger.error("Failed to remove invalidation flag:", error);
-      }
+      } catch (error) {}
     }
   }

[Killed] BooleanLiteral
src/cache/persistent-manager.ts:92:9
    * Get value from cache
    */
   get<T>(key: string): T | undefined {
-    if (!this.enabled) {
+    if (this.enabled) {
       return undefined;
     }
killedBy: PersistentCacheManager get should return cached value if not expired
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test-value"
Received: undefined

[Killed] LogicalOperator
src/cache/persistent-manager.ts:106:11
       }
 
       // Check TTL expiration
-      if (entry.expires && Date.now() > entry.expires) {
+      if (entry.expires || Date.now() > entry.expires) {
         this.cacheData.delete(key);
         return undefined;
killedBy: PersistentCacheManager get should return cached value if not expired
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "test-value"
Received: undefined

[Killed] BlockStatement
src/cache/persistent-manager.ts:106:56
       }
 
       // Check TTL expiration
-      if (entry.expires && Date.now() > entry.expires) {
-        this.cacheData.delete(key);
-        return undefined;
-      }
+      if (entry.expires && Date.now() > entry.expires) {}
 
       Logger.cache("hit", key);
killedBy: PersistentCacheManager get should return undefined for expired entries
statusReason: Error: expect(received).toBeUndefined()

Received: "expired-value"

[NoCoverage] StringLiteral
src/cache/persistent-manager.ts:114:20
       Logger.cache("hit", key);
       return entry.value as T;
     } catch (error) {
-      Logger.error(`Cache get error for key ${key}:`, error);
+      Logger.error(``, error);
       return undefined;
     }

[Killed] ConditionalExpression
src/cache/persistent-manager.ts:129:23
 
     try {
       const effectiveTtl = ttlMs || this.ttlMs;
-      const expires = effectiveTtl > 0 ? Date.now() + effectiveTtl : 0;
+      const expires = false ? Date.now() + effectiveTtl : 0;
 
       const entry: CacheEntry = {
killedBy: PersistentCacheManager set should store value with expiration time
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 1752538760357
Received:   0

[Killed] EqualityOperator
src/cache/persistent-manager.ts:129:23
 
     try {
       const effectiveTtl = ttlMs || this.ttlMs;
-      const expires = effectiveTtl > 0 ? Date.now() + effectiveTtl : 0;
+      const expires = effectiveTtl <= 0 ? Date.now() + effectiveTtl : 0;
 
       const entry: CacheEntry = {
killedBy: PersistentCacheManager set should store value with expiration time
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 1752538761119
Received:   0

[Survived] ConditionalExpression
src/cache/persistent-manager.ts:140:9
       this.cacheData.set(key, entry);
 
       const ttlSeconds =
-        effectiveTtl > 0 ? Math.floor(effectiveTtl / 1000) : "never";
+        false ? Math.floor(effectiveTtl / 1000) : "never";
       Logger.cache("set", key, { ttl: `${ttlSeconds}s` });
 

[Survived] ConditionalExpression
src/cache/persistent-manager.ts:140:9
       this.cacheData.set(key, entry);
 
       const ttlSeconds =
-        effectiveTtl > 0 ? Math.floor(effectiveTtl / 1000) : "never";
+        true ? Math.floor(effectiveTtl / 1000) : "never";
       Logger.cache("set", key, { ttl: `${ttlSeconds}s` });
 

[NoCoverage] BooleanLiteral
src/cache/persistent-manager.ts:146:14
       return true;
     } catch (error) {
       Logger.error(`Cache set error for key ${key}:`, error);
-      return false;
+      return true;
     }
   }

[Killed] BooleanLiteral
src/cache/persistent-manager.ts:154:9
    * Delete value from cache
    */
   delete(key: string): number {
-    if (!this.enabled) {
+    if (this.enabled) {
       return 0;
     }
killedBy: PersistentCacheManager delete should remove key from cache
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
src/cache/persistent-manager.ts:160:11
 
     try {
       const existed = this.cacheData.has(key);
-      if (existed) {
+      if (true) {
         this.cacheData.delete(key);
         Logger.cache("delete", key);
killedBy: PersistentCacheManager delete should return false for non-existent key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
src/cache/persistent-manager.ts:160:11
 
     try {
       const existed = this.cacheData.has(key);
-      if (existed) {
+      if (false) {
         this.cacheData.delete(key);
         Logger.cache("delete", key);
killedBy: PersistentCacheManager delete should remove key from cache
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/cache/persistent-manager.ts:175:17
   /**
    * Clear all cache entries
    */
-  clear(): void {
-    if (!this.enabled) {
-      return;
-    }
-
-    try {
-      this.cacheData.clear();
-
-      // Also delete the cache file
-      if (existsSync(this.cacheFile)) {
-        try {
-          require("fs").unlinkSync(this.cacheFile);
-          Logger.info("Cache file deleted");
-        } catch (error) {
-          Logger.error("Failed to delete cache file:", error);
-        }
-      }
-
-      Logger.cache("clear", "all");
-    } catch (error) {
-      Logger.error("Cache clear error:", error);
-    }
-  }
+  clear(): void {}
 
   /**
killedBy: PersistentCacheManager clear should remove all entries from cache
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 2

[Killed] BlockStatement
src/cache/persistent-manager.ts:180:9
       return;
     }
 
-    try {
-      this.cacheData.clear();
-
-      // Also delete the cache file
-      if (existsSync(this.cacheFile)) {
-        try {
-          require("fs").unlinkSync(this.cacheFile);
-          Logger.info("Cache file deleted");
-        } catch (error) {
-          Logger.error("Failed to delete cache file:", error);
-        }
-      }
-
-      Logger.cache("clear", "all");
-    } catch (error) {
+    try {} catch (error) {
       Logger.error("Cache clear error:", error);
     }
killedBy: PersistentCacheManager clear should remove all entries from cache
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 2

[Killed] ConditionalExpression
src/cache/persistent-manager.ts:184:11
       this.cacheData.clear();
 
       // Also delete the cache file
-      if (existsSync(this.cacheFile)) {
+      if (false) {
         try {
           require("fs").unlinkSync(this.cacheFile);
killedBy: PersistentCacheManager clear should delete cache file
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/home/test/.cache/openapi-directory-mcp/cache.json"

Number of calls: 0

[Killed] BlockStatement
src/cache/persistent-manager.ts:184:39
       this.cacheData.clear();
 
       // Also delete the cache file
-      if (existsSync(this.cacheFile)) {
-        try {
-          require("fs").unlinkSync(this.cacheFile);
-          Logger.info("Cache file deleted");
-        } catch (error) {
-          Logger.error("Failed to delete cache file:", error);
-        }
-      }
+      if (existsSync(this.cacheFile)) {}
 
       Logger.cache("clear", "all");
killedBy: PersistentCacheManager clear should delete cache file
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/home/test/.cache/openapi-directory-mcp/cache.json"

Number of calls: 0

[Killed] BlockStatement
src/cache/persistent-manager.ts:185:13
 
       // Also delete the cache file
       if (existsSync(this.cacheFile)) {
-        try {
-          require("fs").unlinkSync(this.cacheFile);
-          Logger.info("Cache file deleted");
-        } catch (error) {
+        try {} catch (error) {
           Logger.error("Failed to delete cache file:", error);
         }
killedBy: PersistentCacheManager clear should delete cache file
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/home/test/.cache/openapi-directory-mcp/cache.json"

Number of calls: 0

[Survived] StringLiteral
src/cache/persistent-manager.ts:187:23
       if (existsSync(this.cacheFile)) {
         try {
           require("fs").unlinkSync(this.cacheFile);
-          Logger.info("Cache file deleted");
+          Logger.info("");
         } catch (error) {
           Logger.error("Failed to delete cache file:", error);

[Survived] BlockStatement
src/cache/persistent-manager.ts:188:25
         try {
           require("fs").unlinkSync(this.cacheFile);
           Logger.info("Cache file deleted");
-        } catch (error) {
-          Logger.error("Failed to delete cache file:", error);
-        }
+        } catch (error) {}
       }
 

[NoCoverage] BlockStatement
src/cache/persistent-manager.ts:209:24
     ksize: number;
     vsize: number;
   } {
-    if (!this.enabled) {
-      return {
-        keys: 0,
-        hits: 0,
-        misses: 0,
-        ksize: 0,
-        vsize: 0,
-      };
-    }
+    if (!this.enabled) {}
 
     const keys = this.keys();

[NoCoverage] ConditionalExpression
src/cache/persistent-manager.ts:209:9
     ksize: number;
     vsize: number;
   } {
-    if (!this.enabled) {
+    if (false) {
       return {
         keys: 0,

[NoCoverage] BlockStatement
src/cache/persistent-manager.ts:223:27
     let ksize = 0;
     let vsize = 0;
 
-    keys.forEach((key) => {
-      const entry = this.cacheData.get(key);
-      if (entry && entry.value !== undefined) {
-        ksize += Buffer.byteLength(key, "utf8");
-        vsize += Buffer.byteLength(JSON.stringify(entry.value), "utf8");
-      }
-    });
+    keys.forEach((key) => {});
 
     return {

[NoCoverage] ConditionalExpression
src/cache/persistent-manager.ts:225:20
 
     keys.forEach((key) => {
       const entry = this.cacheData.get(key);
-      if (entry && entry.value !== undefined) {
+      if (entry && true) {
         ksize += Buffer.byteLength(key, "utf8");
         vsize += Buffer.byteLength(JSON.stringify(entry.value), "utf8");

[NoCoverage] EqualityOperator
src/cache/persistent-manager.ts:225:20
 
     keys.forEach((key) => {
       const entry = this.cacheData.get(key);
-      if (entry && entry.value !== undefined) {
+      if (entry && entry.value === undefined) {
         ksize += Buffer.byteLength(key, "utf8");
         vsize += Buffer.byteLength(JSON.stringify(entry.value), "utf8");

[NoCoverage] AssignmentOperator
src/cache/persistent-manager.ts:226:9
     keys.forEach((key) => {
       const entry = this.cacheData.get(key);
       if (entry && entry.value !== undefined) {
-        ksize += Buffer.byteLength(key, "utf8");
+        ksize -= Buffer.byteLength(key, "utf8");
         vsize += Buffer.byteLength(JSON.stringify(entry.value), "utf8");
       }

[NoCoverage] AssignmentOperator
src/cache/persistent-manager.ts:227:9
       const entry = this.cacheData.get(key);
       if (entry && entry.value !== undefined) {
         ksize += Buffer.byteLength(key, "utf8");
-        vsize += Buffer.byteLength(JSON.stringify(entry.value), "utf8");
+        vsize -= Buffer.byteLength(JSON.stringify(entry.value), "utf8");
       }
     });

[NoCoverage] BlockStatement
src/cache/persistent-manager.ts:244:24
    * Get all cache keys
    */
   keys(): string[] {
-    if (!this.enabled) {
-      return [];
-    }
+    if (!this.enabled) {}
 
     try {

[NoCoverage] StringLiteral
src/cache/persistent-manager.ts:251:21
     try {
       return Array.from(this.cacheData.keys());
     } catch (error) {
-      console.error("Cache keys error:", error);
+      console.error("", error);
       return [];
     }

[Killed] BooleanLiteral
src/cache/persistent-manager.ts:260:9
    * Check if cache has a key
    */
   has(key: string): boolean {
-    if (!this.enabled) {
+    if (this.enabled) {
       return false;
     }
killedBy: PersistentCacheManager has should return true for existing non-expired keys
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/cache/persistent-manager.ts:267:16
     try {
       const entry = this.cacheData.get(key);
       if (!entry) {
-        return false;
+        return true;
       }
 
killedBy: PersistentCacheManager has should return false for non-existent keys
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/cache/persistent-manager.ts:271:28
       }
 
       // Check TTL expiration
-      if (entry.expires && Date.now() > entry.expires) {
+      if (entry.expires && Date.now() <= entry.expires) {
         this.cacheData.delete(key);
         return false;
killedBy: PersistentCacheManager has should return true for existing non-expired keys
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/cache/persistent-manager.ts:271:11
       }
 
       // Check TTL expiration
-      if (entry.expires && Date.now() > entry.expires) {
+      if (true) {
         this.cacheData.delete(key);
         return false;
killedBy: PersistentCacheManager has should return true for existing non-expired keys
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/cache/persistent-manager.ts:273:16
       // Check TTL expiration
       if (entry.expires && Date.now() > entry.expires) {
         this.cacheData.delete(key);
-        return false;
+        return true;
       }
 
killedBy: PersistentCacheManager has should return false for expired keys
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[NoCoverage] BooleanLiteral
src/cache/persistent-manager.ts:279:14
       return true;
     } catch (error) {
       console.error(`Cache has error for key ${key}:`, error);
-      return false;
+      return true;
     }
   }

[NoCoverage] ConditionalExpression
src/cache/persistent-manager.ts:287:9
    * Get TTL for a key (in milliseconds)
    */
   getTtl(key: string): number | undefined {
-    if (!this.enabled) {
+    if (false) {
       return undefined;
     }

[NoCoverage] BlockStatement
src/cache/persistent-manager.ts:287:24
    * Get TTL for a key (in milliseconds)
    */
   getTtl(key: string): number | undefined {
-    if (!this.enabled) {
-      return undefined;
-    }
+    if (!this.enabled) {}
 
     try {

[NoCoverage] BooleanLiteral
src/cache/persistent-manager.ts:293:21
 
     try {
       const entry = this.cacheData.get(key);
-      if (!entry || !entry.expires) {
+      if (!entry || entry.expires) {
         return undefined;
       }

[NoCoverage] ConditionalExpression
src/cache/persistent-manager.ts:298:14
       }
 
       const remaining = entry.expires - Date.now();
-      return remaining > 0 ? remaining : undefined;
+      return false ? remaining : undefined;
     } catch (error) {
       console.error(`Cache getTtl error for key ${key}:`, error);

[NoCoverage] EqualityOperator
src/cache/persistent-manager.ts:298:14
       }
 
       const remaining = entry.expires - Date.now();
-      return remaining > 0 ? remaining : undefined;
+      return remaining >= 0 ? remaining : undefined;
     } catch (error) {
       console.error(`Cache getTtl error for key ${key}:`, error);

[NoCoverage] BlockStatement
src/cache/persistent-manager.ts:323:17
   /**
    * Prune expired entries manually
    */
-  prune(): void {
-    this.cleanExpired();
-  }
+  prune(): void {}
 
   /**

[NoCoverage] BlockStatement
src/cache/persistent-manager.ts:330:38
   /**
    * Set cache enabled/disabled
    */
-  setEnabled(enabled: boolean): void {
-    this.enabled = enabled;
-    if (!enabled && this.cacheData) {
-      this.clear();
-    } else if (enabled && !this.cacheData) {
-      this.initializeCache();
-    }
-  }
+  setEnabled(enabled: boolean): void {}
 
   /**

[NoCoverage] ConditionalExpression
src/cache/persistent-manager.ts:332:9
    */
   setEnabled(enabled: boolean): void {
     this.enabled = enabled;
-    if (!enabled && this.cacheData) {
+    if (true) {
       this.clear();
     } else if (enabled && !this.cacheData) {

[NoCoverage] BlockStatement
src/cache/persistent-manager.ts:332:37
    */
   setEnabled(enabled: boolean): void {
     this.enabled = enabled;
-    if (!enabled && this.cacheData) {
-      this.clear();
-    } else if (enabled && !this.cacheData) {
+    if (!enabled && this.cacheData) {} else if (enabled && !this.cacheData) {
       this.initializeCache();
     }

[NoCoverage] LogicalOperator
src/cache/persistent-manager.ts:334:16
     this.enabled = enabled;
     if (!enabled && this.cacheData) {
       this.clear();
-    } else if (enabled && !this.cacheData) {
+    } else if (enabled || !this.cacheData) {
       this.initializeCache();
     }

[NoCoverage] BooleanLiteral
src/cache/persistent-manager.ts:334:27
     this.enabled = enabled;
     if (!enabled && this.cacheData) {
       this.clear();
-    } else if (enabled && !this.cacheData) {
+    } else if (enabled && this.cacheData) {
       this.initializeCache();
     }

[NoCoverage] BlockStatement
src/cache/persistent-manager.ts:364:16
   /**
    * Force persistence to disk
    */
-  save(): void {
-    this.persistToDisk();
-  }
+  save(): void {}
 
   /**
