[NoCoverage] BlockStatement
src/cache/persistent-manager.ts:371:34
   /**
    * Create invalidation flag file to signal cache refresh needed
    */
-  createInvalidationFlag(): void {
-    if (!this.enabled) {
-      return;
-    }
-
-    try {
-      writeFileSync(this.invalidateFlag, "", "utf-8");
-      console.error("Cache invalidation flag created");
-    } catch (error) {
-      console.error("Failed to create invalidation flag:", error);
-    }
-  }
+  createInvalidationFlag(): void {}
 
   /**

[NoCoverage] ConditionalExpression
src/cache/persistent-manager.ts:372:9
    * Create invalidation flag file to signal cache refresh needed
    */
   createInvalidationFlag(): void {
-    if (!this.enabled) {
+    if (false) {
       return;
     }

[NoCoverage] ConditionalExpression
src/cache/persistent-manager.ts:372:9
    * Create invalidation flag file to signal cache refresh needed
    */
   createInvalidationFlag(): void {
-    if (!this.enabled) {
+    if (true) {
       return;
     }

[NoCoverage] BlockStatement
src/cache/persistent-manager.ts:376:9
       return;
     }
 
-    try {
-      writeFileSync(this.invalidateFlag, "", "utf-8");
-      console.error("Cache invalidation flag created");
-    } catch (error) {
+    try {} catch (error) {
       console.error("Failed to create invalidation flag:", error);
     }

[NoCoverage] BlockStatement
src/cache/persistent-manager.ts:379:21
     try {
       writeFileSync(this.invalidateFlag, "", "utf-8");
       console.error("Cache invalidation flag created");
-    } catch (error) {
-      console.error("Failed to create invalidation flag:", error);
-    }
+    } catch (error) {}
   }
 

[Killed] BlockStatement
src/cache/persistent-manager.ts:394:32
   /**
    * Clean expired entries
    */
-  private cleanExpired(): void {
-    if (!this.enabled) {
-      return;
-    }
-
-    try {
-      const keys = Array.from(this.cacheData.keys());
-      const now = Date.now();
-      let cleanedCount = 0;
-
-      keys.forEach((key: string) => {
-        const entry = this.cacheData.get(key);
-        if (entry && entry.expires && now > entry.expires) {
-          this.cacheData.delete(key);
-          cleanedCount++;
-        }
-      });
-
-      if (cleanedCount > 0) {
-        console.error(`Cleaned ${cleanedCount} expired cache entries`);
-      }
-    } catch (error) {
-      console.error("Cache cleanup error:", error);
-    }
-  }
+  private cleanExpired(): void {}
 
   /**
killedBy: PersistentCacheManager persistence should clean expired entries before persisting
statusReason: Error: expect(received).not.toHaveProperty(path)

Expected path: not "expired"

Received value: {"created": 1752538795420, "expires": 1752538805420, "value": "expired"}

[Killed] ConditionalExpression
src/cache/persistent-manager.ts:395:9
    * Clean expired entries
    */
   private cleanExpired(): void {
-    if (!this.enabled) {
+    if (true) {
       return;
     }
killedBy: PersistentCacheManager persistence should clean expired entries before persisting
statusReason: Error: expect(received).not.toHaveProperty(path)

Expected path: not "expired"

Received value: {"created": 1752538796159, "expires": 1752538806159, "value": "expired"}

[Killed] BooleanLiteral
src/cache/persistent-manager.ts:395:9
    * Clean expired entries
    */
   private cleanExpired(): void {
-    if (!this.enabled) {
+    if (this.enabled) {
       return;
     }
killedBy: PersistentCacheManager persistence should clean expired entries before persisting
statusReason: Error: expect(received).not.toHaveProperty(path)

Expected path: not "expired"

Received value: {"created": 1752538795696, "expires": 1752538805696, "value": "expired"}

[Killed] BlockStatement
src/cache/persistent-manager.ts:399:9
       return;
     }
 
-    try {
-      const keys = Array.from(this.cacheData.keys());
-      const now = Date.now();
-      let cleanedCount = 0;
-
-      keys.forEach((key: string) => {
-        const entry = this.cacheData.get(key);
-        if (entry && entry.expires && now > entry.expires) {
-          this.cacheData.delete(key);
-          cleanedCount++;
-        }
-      });
-
-      if (cleanedCount > 0) {
-        console.error(`Cleaned ${cleanedCount} expired cache entries`);
-      }
-    } catch (error) {
+    try {} catch (error) {
       console.error("Cache cleanup error:", error);
     }
killedBy: PersistentCacheManager persistence should clean expired entries before persisting
statusReason: Error: expect(received).not.toHaveProperty(path)

Expected path: not "expired"

Received value: {"created": 1752538797228, "expires": 1752538807228, "value": "expired"}

[Killed] BlockStatement
src/cache/persistent-manager.ts:404:37
       const now = Date.now();
       let cleanedCount = 0;
 
-      keys.forEach((key: string) => {
-        const entry = this.cacheData.get(key);
-        if (entry && entry.expires && now > entry.expires) {
-          this.cacheData.delete(key);
-          cleanedCount++;
-        }
-      });
+      keys.forEach((key: string) => {});
 
       if (cleanedCount > 0) {
killedBy: PersistentCacheManager persistence should clean expired entries before persisting
statusReason: Error: expect(received).not.toHaveProperty(path)

Expected path: not "expired"

Received value: {"created": 1752538797734, "expires": 1752538807734, "value": "expired"}

[Killed] BlockStatement
src/cache/persistent-manager.ts:406:60
 
       keys.forEach((key: string) => {
         const entry = this.cacheData.get(key);
-        if (entry && entry.expires && now > entry.expires) {
-          this.cacheData.delete(key);
-          cleanedCount++;
-        }
+        if (entry && entry.expires && now > entry.expires) {}
       });
 
killedBy: PersistentCacheManager persistence should clean expired entries before persisting
statusReason: Error: expect(received).not.toHaveProperty(path)

Expected path: not "expired"

Received value: {"created": 1752538801048, "expires": 1752538811048, "value": "expired"}

[Killed] EqualityOperator
src/cache/persistent-manager.ts:406:39
 
       keys.forEach((key: string) => {
         const entry = this.cacheData.get(key);
-        if (entry && entry.expires && now > entry.expires) {
+        if (entry && entry.expires && now <= entry.expires) {
           this.cacheData.delete(key);
           cleanedCount++;
killedBy: PersistentCacheManager persistence should persist cache to disk
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/home/test/.cache/openapi-directory-mcp/cache.json", StringContaining "persist1", "utf8"
Received: "/home/test/.cache/openapi-directory-mcp/cache.json", "{}", "utf8"

Number of calls: 1

[Survived] EqualityOperator
src/cache/persistent-manager.ts:412:11
         }
       });
 
-      if (cleanedCount > 0) {
+      if (cleanedCount <= 0) {
         console.error(`Cleaned ${cleanedCount} expired cache entries`);
       }

[Survived] EqualityOperator
src/cache/persistent-manager.ts:412:11
         }
       });
 
-      if (cleanedCount > 0) {
+      if (cleanedCount >= 0) {
         console.error(`Cleaned ${cleanedCount} expired cache entries`);
       }

[NoCoverage] BlockStatement
src/cache/persistent-manager.ts:415:21
       if (cleanedCount > 0) {
         console.error(`Cleaned ${cleanedCount} expired cache entries`);
       }
-    } catch (error) {
-      console.error("Cache cleanup error:", error);
-    }
+    } catch (error) {}
   }
 

[Killed] BlockStatement
src/cache/persistent-manager.ts:423:32
   /**
    * Persist cache to disk
    */
-  private loadFromDisk(): void {
-    if (!existsSync(this.cacheFile)) {
-      return; // No cache file exists yet
-    }
-
-    try {
-      const data = readFileSync(this.cacheFile, "utf8");
-      const cacheObject = JSON.parse(data);
-
-      // Convert the object back to a Map
-      this.cacheData = new Map(Object.entries(cacheObject));
-
-      console.error(`Loaded ${this.cacheData.size} cache entries from disk`);
-    } catch (error) {
-      console.error("Cache load error:", error);
-      this.cacheData = new Map(); // Start with empty cache on error
-    }
-  }
+  private loadFromDisk(): void {}
 
   private persistToDisk(): void {
killedBy: PersistentCacheManager constructor should load existing cache on initialization
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/home/test/.cache/openapi-directory-mcp/cache.json", "utf8"

Number of calls: 0

[Killed] ConditionalExpression
src/cache/persistent-manager.ts:424:9
    * Persist cache to disk
    */
   private loadFromDisk(): void {
-    if (!existsSync(this.cacheFile)) {
+    if (true) {
       return; // No cache file exists yet
     }
killedBy: PersistentCacheManager constructor should load existing cache on initialization
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/home/test/.cache/openapi-directory-mcp/cache.json", "utf8"

Number of calls: 0

[Survived] ConditionalExpression
src/cache/persistent-manager.ts:424:9
    * Persist cache to disk
    */
   private loadFromDisk(): void {
-    if (!existsSync(this.cacheFile)) {
+    if (false) {
       return; // No cache file exists yet
     }

[Killed] BlockStatement
src/cache/persistent-manager.ts:428:9
       return; // No cache file exists yet
     }
 
-    try {
-      const data = readFileSync(this.cacheFile, "utf8");
-      const cacheObject = JSON.parse(data);
-
-      // Convert the object back to a Map
-      this.cacheData = new Map(Object.entries(cacheObject));
-
-      console.error(`Loaded ${this.cacheData.size} cache entries from disk`);
-    } catch (error) {
+    try {} catch (error) {
       console.error("Cache load error:", error);
       this.cacheData = new Map(); // Start with empty cache on error
killedBy: PersistentCacheManager constructor should load existing cache on initialization
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/home/test/.cache/openapi-directory-mcp/cache.json", "utf8"

Number of calls: 0

[Survived] StringLiteral
src/cache/persistent-manager.ts:435:21
       // Convert the object back to a Map
       this.cacheData = new Map(Object.entries(cacheObject));
 
-      console.error(`Loaded ${this.cacheData.size} cache entries from disk`);
+      console.error(``);
     } catch (error) {
       console.error("Cache load error:", error);

[NoCoverage] BlockStatement
src/cache/persistent-manager.ts:436:21
       this.cacheData = new Map(Object.entries(cacheObject));
 
       console.error(`Loaded ${this.cacheData.size} cache entries from disk`);
-    } catch (error) {
-      console.error("Cache load error:", error);
-      this.cacheData = new Map(); // Start with empty cache on error
-    }
+    } catch (error) {}
   }
 

[Killed] BlockStatement
src/cache/persistent-manager.ts:442:33
     }
   }
 
-  private persistToDisk(): void {
-    if (!this.enabled) {
-      return;
-    }
-
-    try {
-      // Clean expired entries before persisting
-      this.cleanExpired();
-
-      const cacheObject = Object.fromEntries(this.cacheData.entries());
-      writeFileSync(
-        this.cacheFile,
-        JSON.stringify(cacheObject, null, 2),
-        "utf8",
-      );
-    } catch (error) {
-      console.error("Cache persistence error:", error);
-    }
-  }
+  private persistToDisk(): void {}
 
   /**
killedBy: PersistentCacheManager persistence should persist cache to disk
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/home/test/.cache/openapi-directory-mcp/cache.json", StringContaining "persist1", "utf8"

Number of calls: 0

[Killed] ConditionalExpression
src/cache/persistent-manager.ts:443:9
   }
 
   private persistToDisk(): void {
-    if (!this.enabled) {
+    if (true) {
       return;
     }
killedBy: PersistentCacheManager persistence should persist cache to disk
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/home/test/.cache/openapi-directory-mcp/cache.json", StringContaining "persist1", "utf8"

Number of calls: 0

[Killed] BooleanLiteral
src/cache/persistent-manager.ts:443:9
   }
 
   private persistToDisk(): void {
-    if (!this.enabled) {
+    if (this.enabled) {
       return;
     }
killedBy: PersistentCacheManager persistence should persist cache to disk
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/home/test/.cache/openapi-directory-mcp/cache.json", StringContaining "persist1", "utf8"

Number of calls: 0

[Killed] BlockStatement
src/cache/persistent-manager.ts:447:9
       return;
     }
 
-    try {
-      // Clean expired entries before persisting
-      this.cleanExpired();
-
-      const cacheObject = Object.fromEntries(this.cacheData.entries());
-      writeFileSync(
-        this.cacheFile,
-        JSON.stringify(cacheObject, null, 2),
-        "utf8",
-      );
-    } catch (error) {
+    try {} catch (error) {
       console.error("Cache persistence error:", error);
     }
killedBy: PersistentCacheManager persistence should persist cache to disk
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/home/test/.cache/openapi-directory-mcp/cache.json", StringContaining "persist1", "utf8"

Number of calls: 0

[Survived] BlockStatement
src/cache/persistent-manager.ts:457:21
         JSON.stringify(cacheObject, null, 2),
         "utf8",
       );
-    } catch (error) {
-      console.error("Cache persistence error:", error);
-    }
+    } catch (error) {}
   }
 

[NoCoverage] ConditionalExpression
src/cache/persistent-manager.ts:466:9
    * Invalidate cache keys matching a pattern (supports * wildcard)
    */
   invalidatePattern(pattern: string): number {
-    if (!this.enabled) {
+    if (false) {
       return 0;
     }

[NoCoverage] BlockStatement
src/cache/persistent-manager.ts:475:31
       const regex = new RegExp("^" + pattern.replace(/\*/g, ".*") + "$");
       let deletedCount = 0;
 
-      for (const key of keys) {
-        if (regex.test(key)) {
-          if (this.cacheData.delete(key)) {
-            deletedCount++;
-          }
-        }
-      }
+      for (const key of keys) {}
 
       if (deletedCount > 0) {

[NoCoverage] ConditionalExpression
src/cache/persistent-manager.ts:476:13
       let deletedCount = 0;
 
       for (const key of keys) {
-        if (regex.test(key)) {
+        if (false) {
           if (this.cacheData.delete(key)) {
             deletedCount++;

[NoCoverage] BlockStatement
src/cache/persistent-manager.ts:477:43
 
       for (const key of keys) {
         if (regex.test(key)) {
-          if (this.cacheData.delete(key)) {
-            deletedCount++;
-          }
+          if (this.cacheData.delete(key)) {}
         }
       }

[NoCoverage] ConditionalExpression
src/cache/persistent-manager.ts:477:15
 
       for (const key of keys) {
         if (regex.test(key)) {
-          if (this.cacheData.delete(key)) {
+          if (false) {
             deletedCount++;
           }

[NoCoverage] StringLiteral
src/cache/persistent-manager.ts:485:11
 
       if (deletedCount > 0) {
         console.error(
-          `Cache invalidated ${deletedCount} keys matching pattern: ${pattern}`,
+          ``,
         );
       }

[NoCoverage] StringLiteral
src/cache/persistent-manager.ts:492:9
       return deletedCount;
     } catch (error) {
       console.error(
-        `Cache invalidatePattern error for pattern ${pattern}:`,
+        ``,
         error,
       );

[NoCoverage] BlockStatement
src/cache/persistent-manager.ts:510:31
     try {
       let deletedCount = 0;
 
-      for (const key of keys) {
-        if (this.cacheData.delete(key)) {
-          deletedCount++;
-        }
-      }
+      for (const key of keys) {}
 
       if (deletedCount > 0) {

[NoCoverage] ConditionalExpression
src/cache/persistent-manager.ts:511:13
       let deletedCount = 0;
 
       for (const key of keys) {
-        if (this.cacheData.delete(key)) {
+        if (true) {
           deletedCount++;
         }

[NoCoverage] ConditionalExpression
src/cache/persistent-manager.ts:511:13
       let deletedCount = 0;
 
       for (const key of keys) {
-        if (this.cacheData.delete(key)) {
+        if (false) {
           deletedCount++;
         }

[NoCoverage] EqualityOperator
src/cache/persistent-manager.ts:516:11
         }
       }
 
-      if (deletedCount > 0) {
+      if (deletedCount >= 0) {
         console.error(`Cache invalidated ${deletedCount} specific keys`);
       }

[NoCoverage] StringLiteral
src/cache/persistent-manager.ts:517:23
       }
 
       if (deletedCount > 0) {
-        console.error(`Cache invalidated ${deletedCount} specific keys`);
+        console.error(``);
       }
 

[NoCoverage] StringLiteral
src/cache/persistent-manager.ts:522:21
 
       return deletedCount;
     } catch (error) {
-      console.error(`Cache invalidateKeys error:`, error);
+      console.error(``, error);
       return 0;
     }

[NoCoverage] StringLiteral
src/cache/persistent-manager.ts:548:21
       }
 
       // Fetch fresh data
-      console.error(`Cache warming: ${key}`);
+      console.error(``);
       const data = await fetchFn();
 

[NoCoverage] StringLiteral
src/cache/persistent-manager.ts:556:21
 
       return data;
     } catch (error) {
-      console.error(`Cache warmCache error for key ${key}:`, error);
+      console.error(``, error);
       // On error, try to fetch without caching
       return await fetchFn();

[Survived] BlockStatement
src/cache/persistent-manager.ts:565:19
   /**
    * Clean up and save on shutdown
    */
-  destroy(): void {
-    if (this.enabled) {
-      if (this.persistTimer) {
-        clearInterval(this.persistTimer);
-      }
-      this.cleanExpired();
-      this.persistToDisk();
-    }
-  }
+  destroy(): void {}
 }
 

[Survived] ConditionalExpression
src/cache/persistent-manager.ts:566:9
    * Clean up and save on shutdown
    */
   destroy(): void {
-    if (this.enabled) {
+    if (true) {
       if (this.persistTimer) {
         clearInterval(this.persistTimer);

[Survived] ConditionalExpression
src/cache/persistent-manager.ts:566:9
    * Clean up and save on shutdown
    */
   destroy(): void {
-    if (this.enabled) {
+    if (false) {
       if (this.persistTimer) {
         clearInterval(this.persistTimer);

[Survived] ConditionalExpression
src/cache/persistent-manager.ts:567:11
    */
   destroy(): void {
     if (this.enabled) {
-      if (this.persistTimer) {
+      if (true) {
         clearInterval(this.persistTimer);
       }

[NoCoverage] BlockStatement
src/cache/persistent-manager.ts:567:30
    */
   destroy(): void {
     if (this.enabled) {
-      if (this.persistTimer) {
-        clearInterval(this.persistTimer);
-      }
+      if (this.persistTimer) {}
       this.cleanExpired();
       this.persistToDisk();
