[NoCoverage] ConditionalExpression
src/utils/validation.ts:745:29
 
     if (typeof value === "string") {
       const parsed = parseInt(value, 10);
-      if (!isNaN(parsed) && parsed >= 0) {
+      if (!isNaN(parsed) && true) {
         warnings.push(
           `Converted string to number for ${fieldName}: "${value}" -> ${parsed}`,

[NoCoverage] StringLiteral
src/utils/validation.ts:747:11
       const parsed = parseInt(value, 10);
       if (!isNaN(parsed) && parsed >= 0) {
         warnings.push(
-          `Converted string to number for ${fieldName}: "${value}" -> ${parsed}`,
+          ``,
         );
         return parsed;

[Killed] BlockStatement
src/utils/validation.ts:767:53
   ): Record<string, any> {
     const sanitized: Record<string, any> = {};
 
-    for (const [key, value] of Object.entries(obj)) {
-      if (excludeKeys.includes(key)) {
-        continue;
-      }
-
-      // Skip functions and symbols
-      if (typeof value === "function" || typeof value === "symbol") {
-        warnings.push(`Skipped ${typeof value} property: ${key}`);
-        continue;
-      }
-
-      // Handle potential XSS in string values
-      if (typeof value === "string" && this.containsSuspiciousContent(value)) {
-        warnings.push(`Potentially suspicious content in ${key}: "${value}"`);
-      }
-
-      sanitized[key] = value;
-    }
+    for (const [key, value] of Object.entries(obj)) {}
 
     return sanitized;
killedBy: DataValidator validateMetrics should handle invalid metrics gracefully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/utils/validation.ts:768:11
     const sanitized: Record<string, any> = {};
 
     for (const [key, value] of Object.entries(obj)) {
-      if (excludeKeys.includes(key)) {
+      if (false) {
         continue;
       }
killedBy: DataValidator validateMetrics should handle invalid metrics gracefully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: "not-a-number"

[Killed] BlockStatement
src/utils/validation.ts:768:38
     const sanitized: Record<string, any> = {};
 
     for (const [key, value] of Object.entries(obj)) {
-      if (excludeKeys.includes(key)) {
-        continue;
-      }
+      if (excludeKeys.includes(key)) {}
 
       // Skip functions and symbols
killedBy: DataValidator validateMetrics should handle invalid metrics gracefully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: "not-a-number"

[Killed] EqualityOperator
src/utils/validation.ts:773:42
       }
 
       // Skip functions and symbols
-      if (typeof value === "function" || typeof value === "symbol") {
+      if (typeof value === "function" || typeof value !== "symbol") {
         warnings.push(`Skipped ${typeof value} property: ${key}`);
         continue;
killedBy: DataValidator validateMetrics should handle invalid metrics gracefully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/utils/validation.ts:773:11
       }
 
       // Skip functions and symbols
-      if (typeof value === "function" || typeof value === "symbol") {
+      if (typeof value !== "function" || typeof value === "symbol") {
         warnings.push(`Skipped ${typeof value} property: ${key}`);
         continue;
killedBy: DataValidator validateMetrics should handle invalid metrics gracefully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/utils/validation.ts:779:11
       }
 
       // Handle potential XSS in string values
-      if (typeof value === "string" && this.containsSuspiciousContent(value)) {
+      if (false) {
         warnings.push(`Potentially suspicious content in ${key}: "${value}"`);
       }
killedBy: DataValidator validateMetrics should handle invalid metrics gracefully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/utils/validation.ts:779:79
       }
 
       // Handle potential XSS in string values
-      if (typeof value === "string" && this.containsSuspiciousContent(value)) {
-        warnings.push(`Potentially suspicious content in ${key}: "${value}"`);
-      }
+      if (typeof value === "string" && this.containsSuspiciousContent(value)) {}
 
       sanitized[key] = value;
killedBy: DataValidator validateMetrics should handle invalid metrics gracefully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
src/utils/validation.ts:780:23
 
       // Handle potential XSS in string values
       if (typeof value === "string" && this.containsSuspiciousContent(value)) {
-        warnings.push(`Potentially suspicious content in ${key}: "${value}"`);
+        warnings.push(``);
       }
 
killedBy: DataValidator validateMetrics should handle invalid metrics gracefully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] BlockStatement
src/utils/validation.ts:795:11
   static logValidationResults<T>(
     result: ValidationResult<T>,
     source: string,
-  ): void {
-    // Import ErrorHandler dynamically to avoid circular dependency
-    const { ErrorHandler } = require("./errors.js");
-
-    if (result.errors.length > 0) {
-      ErrorHandler.logError({
-        code: "VALIDATION_ERROR",
-        message: `Validation errors in ${source}`,
-        context: { errors: result.errors },
-        timestamp: new Date(),
-      } as any);
-    }
-
-    if (result.warnings.length > 0) {
-      ErrorHandler.logError({
-        code: "VALIDATION_WARNING",
-        message: `Validation warnings in ${source}`,
-        context: { warnings: result.warnings },
-        timestamp: new Date(),
-      } as any);
-    }
-  }
+  ): void {}
 }
 

[Survived] ConditionalExpression
src/utils/validation.ts:799:9
     // Import ErrorHandler dynamically to avoid circular dependency
     const { ErrorHandler } = require("./errors.js");
 
-    if (result.errors.length > 0) {
+    if (true) {
       ErrorHandler.logError({
         code: "VALIDATION_ERROR",

[NoCoverage] BlockStatement
src/utils/validation.ts:799:35
     // Import ErrorHandler dynamically to avoid circular dependency
     const { ErrorHandler } = require("./errors.js");
 
-    if (result.errors.length > 0) {
-      ErrorHandler.logError({
-        code: "VALIDATION_ERROR",
-        message: `Validation errors in ${source}`,
-        context: { errors: result.errors },
-        timestamp: new Date(),
-      } as any);
-    }
+    if (result.errors.length > 0) {}
 
     if (result.warnings.length > 0) {

[Survived] EqualityOperator
src/utils/validation.ts:808:9
       } as any);
     }
 
-    if (result.warnings.length > 0) {
+    if (result.warnings.length >= 0) {
       ErrorHandler.logError({
         code: "VALIDATION_WARNING",

[Survived] ConditionalExpression
src/utils/validation.ts:808:9
       } as any);
     }
 
-    if (result.warnings.length > 0) {
+    if (false) {
       ErrorHandler.logError({
         code: "VALIDATION_WARNING",
