[Killed] BooleanLiteral
src/custom-specs/spec-processor.ts:30:20
    */
   async processSpec(
     source: string,
-    skipSecurity = false,
+    skipSecurity = true,
   ): Promise<SpecProcessingResult> {
     let content: string;
killedBy: SpecProcessor processSpec should process valid JSON spec from file
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  7
+ Received  + 21

- ObjectContaining {
-   "metadata": ObjectContaining {
+ Object {

[Killed] ConditionalExpression
src/custom-specs/spec-processor.ts:36:9
     let originalFormat: "yaml" | "json";
 
     // Fetch content
-    if (this.isUrl(source)) {
+    if (true) {
       content = await this.fetchFromUrl(source);
     } else {
killedBy: SpecProcessor processSpec should process valid JSON spec from file
statusReason: Error: Unexpected error fetching spec: TypeError: Cannot read properties of undefined (reading 'data')

[Killed] ConditionalExpression
src/custom-specs/spec-processor.ts:36:9
     let originalFormat: "yaml" | "json";
 
     // Fetch content
-    if (this.isUrl(source)) {
+    if (false) {
       content = await this.fetchFromUrl(source);
     } else {
killedBy: SpecProcessor processSpec should process spec from URL
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "https://example.com/api.json", Any<Object>

Number of calls: 0

[Killed] ConditionalExpression
src/custom-specs/spec-processor.ts:50:9
 
     // Validate OpenAPI spec
     const validation = await this.validateOpenAPISpec(specObject);
-    if (!validation.valid) {
+    if (true) {
       throw new Error(
         `Invalid OpenAPI specification: ${validation.errors.join(", ")}`,
killedBy: SpecProcessor processSpec should process valid JSON spec from file
statusReason: Error: Invalid OpenAPI specification:

[Killed] BooleanLiteral
src/custom-specs/spec-processor.ts:50:9
 
     // Validate OpenAPI spec
     const validation = await this.validateOpenAPISpec(specObject);
-    if (!validation.valid) {
+    if (validation.valid) {
       throw new Error(
         `Invalid OpenAPI specification: ${validation.errors.join(", ")}`,
killedBy: SpecProcessor processSpec should process valid JSON spec from file
statusReason: Error: Invalid OpenAPI specification:

[Killed] ConditionalExpression
src/custom-specs/spec-processor.ts:65:9
       : await this.securityScanner.scanSpec(specObject);
 
     // Check if security issues block import
-    if (securityScan.blocked) {
+    if (true) {
       throw new Error(
         `Import blocked by critical security issues:\n${this.securityScanner.generateReport(securityScan)}`,
killedBy: SpecProcessor processSpec should process valid JSON spec from file
statusReason: TypeError: this.securityScanner.generateReport is not a function

[Survived] ConditionalExpression
src/custom-specs/spec-processor.ts:65:9
       : await this.securityScanner.scanSpec(specObject);
 
     // Check if security issues block import
-    if (securityScan.blocked) {
+    if (false) {
       throw new Error(
         `Import blocked by critical security issues:\n${this.securityScanner.generateReport(securityScan)}`,

[NoCoverage] StringLiteral
src/custom-specs/spec-processor.ts:67:9
     // Check if security issues block import
     if (securityScan.blocked) {
       throw new Error(
-        `Import blocked by critical security issues:\n${this.securityScanner.generateReport(securityScan)}`,
+        ``,
       );
     }

[Killed] ConditionalExpression
src/custom-specs/spec-processor.ts:89:12
    * Check if source is a URL
    */
   private isUrl(source: string): boolean {
-    return source.startsWith("http://") || source.startsWith("https://");
+    return true;
   }
 
killedBy: SpecProcessor processSpec should process valid JSON spec from file
statusReason: Error: Unexpected error fetching spec: TypeError: Cannot read properties of undefined (reading 'data')

[Killed] MethodExpression
src/custom-specs/spec-processor.ts:89:44
    * Check if source is a URL
    */
   private isUrl(source: string): boolean {
-    return source.startsWith("http://") || source.startsWith("https://");
+    return source.startsWith("http://") || source.endsWith("https://");
   }
 
killedBy: SpecProcessor processSpec should process spec from URL
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "https://example.com/api.json", Any<Object>

Number of calls: 0

[Survived] ObjectLiteral
src/custom-specs/spec-processor.ts:99:18
     try {
       const response = await axios.get(url, {
         timeout: 30000,
-        headers: {
-          Accept: "application/json, application/yaml, text/yaml, text/plain",
-          "User-Agent": "openapi-directory-mcp/1.2.0",
-        },
+        headers: {},
         maxContentLength: 10 * 1024 * 1024, // 10MB limit
       });

[Killed] ConditionalExpression
src/custom-specs/spec-processor.ts:106:11
         maxContentLength: 10 * 1024 * 1024, // 10MB limit
       });
 
-      if (typeof response.data === "string") {
+      if (false) {
         return response.data;
       } else {
killedBy: SpecProcessor processSpec should process spec from URL
statusReason: Error: Invalid OpenAPI specification: Missing OpenAPI/Swagger version field

[Killed] EqualityOperator
src/custom-specs/spec-processor.ts:106:11
         maxContentLength: 10 * 1024 * 1024, // 10MB limit
       });
 
-      if (typeof response.data === "string") {
+      if (typeof response.data !== "string") {
         return response.data;
       } else {
killedBy: SpecProcessor processSpec should process spec from URL
statusReason: Error: Invalid OpenAPI specification: Missing OpenAPI/Swagger version field

[NoCoverage] BlockStatement
src/custom-specs/spec-processor.ts:112:38
         return JSON.stringify(response.data, null, 2);
       }
     } catch (error) {
-      if (axios.isAxiosError(error)) {
-        throw new Error(`Failed to fetch spec from URL: ${error.message}`);
-      }
+      if (axios.isAxiosError(error)) {}
       throw new Error(`Unexpected error fetching spec: ${error}`);
     }

[Survived] MethodExpression
src/custom-specs/spec-processor.ts:125:28
   private readFromFile(filePath: string): string {
     try {
       // Expand tilde to home directory
-      const expandedPath = filePath.startsWith("~/")
+      const expandedPath = filePath.endsWith("~/")
         ? resolve(homedir(), filePath.slice(2))
         : filePath;

[Survived] StringLiteral
src/custom-specs/spec-processor.ts:125:48
   private readFromFile(filePath: string): string {
     try {
       // Expand tilde to home directory
-      const expandedPath = filePath.startsWith("~/")
+      const expandedPath = filePath.startsWith("")
         ? resolve(homedir(), filePath.slice(2))
         : filePath;

[NoCoverage] MethodExpression
src/custom-specs/spec-processor.ts:126:30
     try {
       // Expand tilde to home directory
       const expandedPath = filePath.startsWith("~/")
-        ? resolve(homedir(), filePath.slice(2))
+        ? resolve(homedir(), filePath)
         : filePath;
 

[Survived] MethodExpression
src/custom-specs/spec-processor.ts:141:21
    * Detect if content is YAML or JSON
    */
   detectFormat(content: string): "yaml" | "json" {
-    const trimmed = content.trim();
+    const trimmed = content;
 
     // Check if it starts with JSON indicators

[Killed] MethodExpression
src/custom-specs/spec-processor.ts:144:9
     const trimmed = content.trim();
 
     // Check if it starts with JSON indicators
-    if (trimmed.startsWith("{") || trimmed.startsWith("[")) {
+    if (trimmed.endsWith("{") || trimmed.startsWith("[")) {
       return "json";
     }
killedBy: SpecProcessor processSpec should handle invalid JSON
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Failed to parse YAML: Invalid YAML"
Received message:   "Failed to parse JSON: Unexpected token 'i', \"invalid json {\" is not valid JSON"

      336 |         } else {
      337 |           stryCov_9fa48("1926");

[Killed] ConditionalExpression
src/custom-specs/spec-processor.ts:144:9
     const trimmed = content.trim();
 
     // Check if it starts with JSON indicators
-    if (trimmed.startsWith("{") || trimmed.startsWith("[")) {
+    if (true) {
       return "json";
     }
killedBy: SpecProcessor processSpec should process valid YAML spec from file
statusReason: Error: Failed to parse JSON: Unexpected token 'o', "
openapi: 3"... is not valid JSON

[Survived] LogicalOperator
src/custom-specs/spec-processor.ts:150:7
 
     // Check for YAML indicators
     if (
-      trimmed.includes("openapi:") ||
-      trimmed.includes("swagger:") ||
+      trimmed.includes("openapi:") && trimmed.includes("swagger:") ||
       trimmed.match(/^[a-zA-Z_][a-zA-Z0-9_]*:\s*$/m)
     ) {

[Survived] LogicalOperator
src/custom-specs/spec-processor.ts:150:7
 
     // Check for YAML indicators
     if (
-      trimmed.includes("openapi:") ||
-      trimmed.includes("swagger:") ||
-      trimmed.match(/^[a-zA-Z_][a-zA-Z0-9_]*:\s*$/m)
+      (trimmed.includes("openapi:") || trimmed.includes("swagger:")) && trimmed.match(/^[a-zA-Z_][a-zA-Z0-9_]*:\s*$/m)
     ) {
       return "yaml";

[Survived] Regex
src/custom-specs/spec-processor.ts:152:21
     if (
       trimmed.includes("openapi:") ||
       trimmed.includes("swagger:") ||
-      trimmed.match(/^[a-zA-Z_][a-zA-Z0-9_]*:\s*$/m)
+      trimmed.match(/^[a-zA-Z_][a-zA-Z0-9_]*:\s$/m)
     ) {
       return "yaml";

[Survived] BlockStatement
src/custom-specs/spec-processor.ts:153:7
       trimmed.includes("openapi:") ||
       trimmed.includes("swagger:") ||
       trimmed.match(/^[a-zA-Z_][a-zA-Z0-9_]*:\s*$/m)
-    ) {
-      return "yaml";
-    }
+    ) {}
 
     // Try to parse as JSON first

[Killed] BlockStatement
src/custom-specs/spec-processor.ts:170:71
   /**
    * Parse content based on format
    */
-  private parseContent(content: string, format: "yaml" | "json"): any {
-    try {
-      if (format === "json") {
-        return JSON.parse(content);
-      } else {
-        return yaml.load(content, {
-          onWarning: (warning) => {
-            console.warn(`YAML warning: ${warning.message}`);
-          },
-          // Security: Don't allow arbitrary code execution
-          schema: yaml.CORE_SCHEMA,
-        });
-      }
-    } catch (error) {
-      throw new Error(
-        `Failed to parse ${format.toUpperCase()}: ${error instanceof Error ? error.message : "Unknown error"}`,
-      );
-    }
-  }
+  private parseContent(content: string, format: "yaml" | "json"): any {}
 
   /**
killedBy: SpecProcessor processSpec should process valid JSON spec from file
statusReason: Error: Invalid OpenAPI specification: Cannot read properties of undefined (reading 'openapi')

[Killed] BlockStatement
src/custom-specs/spec-processor.ts:171:9
    * Parse content based on format
    */
   private parseContent(content: string, format: "yaml" | "json"): any {
-    try {
-      if (format === "json") {
-        return JSON.parse(content);
-      } else {
-        return yaml.load(content, {
-          onWarning: (warning) => {
-            console.warn(`YAML warning: ${warning.message}`);
-          },
-          // Security: Don't allow arbitrary code execution
-          schema: yaml.CORE_SCHEMA,
-        });
-      }
-    } catch (error) {
+    try {} catch (error) {
       throw new Error(
         `Failed to parse ${format.toUpperCase()}: ${error instanceof Error ? error.message : "Unknown error"}`,
killedBy: SpecProcessor processSpec should process valid JSON spec from file
statusReason: Error: Invalid OpenAPI specification: Cannot read properties of undefined (reading 'openapi')

[Killed] ConditionalExpression
src/custom-specs/spec-processor.ts:172:11
    */
   private parseContent(content: string, format: "yaml" | "json"): any {
     try {
-      if (format === "json") {
+      if (false) {
         return JSON.parse(content);
       } else {
killedBy: SpecProcessor processSpec should process valid JSON spec from file
statusReason: Error: Invalid OpenAPI specification: Cannot read properties of undefined (reading 'openapi')

[Killed] EqualityOperator
src/custom-specs/spec-processor.ts:172:11
    */
   private parseContent(content: string, format: "yaml" | "json"): any {
     try {
-      if (format === "json") {
+      if (format !== "json") {
         return JSON.parse(content);
       } else {
killedBy: SpecProcessor processSpec should process valid JSON spec from file
statusReason: Error: Invalid OpenAPI specification: Cannot read properties of undefined (reading 'openapi')

[Killed] BlockStatement
src/custom-specs/spec-processor.ts:174:14
     try {
       if (format === "json") {
         return JSON.parse(content);
-      } else {
-        return yaml.load(content, {
-          onWarning: (warning) => {
-            console.warn(`YAML warning: ${warning.message}`);
-          },
-          // Security: Don't allow arbitrary code execution
-          schema: yaml.CORE_SCHEMA,
-        });
-      }
+      } else {}
     } catch (error) {
       throw new Error(
killedBy: SpecProcessor processSpec should process valid YAML spec from file
statusReason: Error: Invalid OpenAPI specification: Cannot read properties of undefined (reading 'openapi')

[NoCoverage] BlockStatement
src/custom-specs/spec-processor.ts:176:35
         return JSON.parse(content);
       } else {
         return yaml.load(content, {
-          onWarning: (warning) => {
-            console.warn(`YAML warning: ${warning.message}`);
-          },
+          onWarning: (warning) => {},
           // Security: Don't allow arbitrary code execution
           schema: yaml.CORE_SCHEMA,

[NoCoverage] StringLiteral
src/custom-specs/spec-processor.ts:177:26
       } else {
         return yaml.load(content, {
           onWarning: (warning) => {
-            console.warn(`YAML warning: ${warning.message}`);
+            console.warn(``);
           },
           // Security: Don't allow arbitrary code execution

[Killed] BlockStatement
src/custom-specs/spec-processor.ts:183:21
           schema: yaml.CORE_SCHEMA,
         });
       }
-    } catch (error) {
-      throw new Error(
-        `Failed to parse ${format.toUpperCase()}: ${error instanceof Error ? error.message : "Unknown error"}`,
-      );
-    }
+    } catch (error) {}
   }
 
killedBy: SpecProcessor processSpec should handle invalid JSON
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Failed to parse YAML: Invalid YAML"
Received message:   "Invalid OpenAPI specification: Cannot read properties of undefined (reading 'openapi')"

      113 |         } else {
      114 |           stryCov_9fa48("1838");
    > 115 |           throw new Error(stryMutAct_9fa48("1839") ? `` : (stryCov_9fa48("1839"), `Invalid OpenA

[Killed] MethodExpression
src/custom-specs/spec-processor.ts:185:28
       }
     } catch (error) {
       throw new Error(
-        `Failed to parse ${format.toUpperCase()}: ${error instanceof Error ? error.message : "Unknown error"}`,
+        `Failed to parse ${format.toLowerCase()}: ${error instanceof Error ? error.message : "Unknown error"}`,
       );
     }
killedBy: SpecProcessor processSpec should handle invalid JSON
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Failed to parse YAML: Invalid YAML"
Received message:   "Failed to parse yaml: Invalid YAML"

      336 |         } else {
      337 |           stryCov_9fa48("1926");

[Killed] StringLiteral
src/custom-specs/spec-processor.ts:185:9
       }
     } catch (error) {
       throw new Error(
-        `Failed to parse ${format.toUpperCase()}: ${error instanceof Error ? error.message : "Unknown error"}`,
+        ``,
       );
     }
killedBy: SpecProcessor processSpec should handle invalid JSON
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Failed to parse YAML: Invalid YAML"
Received message:   ""

      336 |         } else {
      337 |           stryCov_9fa48("1926");

[Killed] LogicalOperator
src/custom-specs/spec-processor.ts:199:23
 
     try {
       // Check for OpenAPI version
-      const version = spec.openapi || spec.swagger;
+      const version = spec.openapi && spec.swagger;
       if (!version) {
         errors.push("Missing OpenAPI/Swagger version field");
killedBy: SpecProcessor processSpec should process valid JSON spec from file
statusReason: Error: Invalid OpenAPI specification: Missing OpenAPI/Swagger version field

[Killed] ConditionalExpression
src/custom-specs/spec-processor.ts:199:23
 
     try {
       // Check for OpenAPI version
-      const version = spec.openapi || spec.swagger;
+      const version = false;
       if (!version) {
         errors.push("Missing OpenAPI/Swagger version field");
killedBy: SpecProcessor processSpec should process valid JSON spec from file
statusReason: Error: Invalid OpenAPI specification: Missing OpenAPI/Swagger version field

[Killed] BooleanLiteral
src/custom-specs/spec-processor.ts:200:11
     try {
       // Check for OpenAPI version
       const version = spec.openapi || spec.swagger;
-      if (!version) {
+      if (version) {
         errors.push("Missing OpenAPI/Swagger version field");
         return { valid: false, errors, warnings };
killedBy: SpecProcessor processSpec should process valid JSON spec from file
statusReason: Error: Invalid OpenAPI specification: Missing OpenAPI/Swagger version field

[Killed] ConditionalExpression
src/custom-specs/spec-processor.ts:200:11
     try {
       // Check for OpenAPI version
       const version = spec.openapi || spec.swagger;
-      if (!version) {
+      if (true) {
         errors.push("Missing OpenAPI/Swagger version field");
         return { valid: false, errors, warnings };
killedBy: SpecProcessor processSpec should process valid JSON spec from file
statusReason: Error: Invalid OpenAPI specification: Missing OpenAPI/Swagger version field

[Survived] StringLiteral
src/custom-specs/spec-processor.ts:201:21
       // Check for OpenAPI version
       const version = spec.openapi || spec.swagger;
       if (!version) {
-        errors.push("Missing OpenAPI/Swagger version field");
+        errors.push("");
         return { valid: false, errors, warnings };
       }

[Killed] BooleanLiteral
src/custom-specs/spec-processor.ts:202:25
       const version = spec.openapi || spec.swagger;
       if (!version) {
         errors.push("Missing OpenAPI/Swagger version field");
-        return { valid: false, errors, warnings };
+        return { valid: true, errors, warnings };
       }
 
killedBy: SpecProcessor processSpec should handle OpenAPI validation failures
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected

[Killed] BooleanLiteral
src/custom-specs/spec-processor.ts:209:11
       await SwaggerParser.validate(spec);
 
       // Additional custom validations
-      if (!spec.info) {
+      if (spec.info) {
         errors.push('Missing required "info" section');
       } else {
killedBy: SpecProcessor processSpec should process valid JSON spec from file
statusReason: Error: Invalid OpenAPI specification: Missing required "info" section

[Killed] ConditionalExpression
src/custom-specs/spec-processor.ts:209:11
       await SwaggerParser.validate(spec);
 
       // Additional custom validations
-      if (!spec.info) {
+      if (true) {
         errors.push('Missing required "info" section');
       } else {
killedBy: SpecProcessor processSpec should process valid JSON spec from file
statusReason: Error: Invalid OpenAPI specification: Missing required "info" section

[Survived] BlockStatement
src/custom-specs/spec-processor.ts:211:14
       // Additional custom validations
       if (!spec.info) {
         errors.push('Missing required "info" section');
-      } else {
-        if (!spec.info.title) {
-          errors.push('Missing required "info.title" field');
-        }
-        if (!spec.info.version) {
-          warnings.push('Missing "info.version" field');
-        }
-      }
+      } else {}
 
       if (!spec.paths && !spec.components) {

[Killed] ConditionalExpression
src/custom-specs/spec-processor.ts:212:13
       if (!spec.info) {
         errors.push('Missing required "info" section');
       } else {
-        if (!spec.info.title) {
+        if (true) {
           errors.push('Missing required "info.title" field');
         }
killedBy: SpecProcessor processSpec should process valid JSON spec from file
statusReason: Error: Invalid OpenAPI specification: Missing required "info.title" field

[Killed] BooleanLiteral
src/custom-specs/spec-processor.ts:212:13
       if (!spec.info) {
         errors.push('Missing required "info" section');
       } else {
-        if (!spec.info.title) {
+        if (spec.info.title) {
           errors.push('Missing required "info.title" field');
         }
killedBy: SpecProcessor processSpec should process valid JSON spec from file
statusReason: Error: Invalid OpenAPI specification: Missing required "info.title" field

[Survived] BooleanLiteral
src/custom-specs/spec-processor.ts:215:13
         if (!spec.info.title) {
           errors.push('Missing required "info.title" field');
         }
-        if (!spec.info.version) {
+        if (spec.info.version) {
           warnings.push('Missing "info.version" field');
         }

[Survived] ConditionalExpression
src/custom-specs/spec-processor.ts:215:13
         if (!spec.info.title) {
           errors.push('Missing required "info.title" field');
         }
-        if (!spec.info.version) {
+        if (true) {
           warnings.push('Missing "info.version" field');
         }

[Survived] StringLiteral
src/custom-specs/spec-processor.ts:216:25
           errors.push('Missing required "info.title" field');
         }
         if (!spec.info.version) {
-          warnings.push('Missing "info.version" field');
+          warnings.push("");
         }
       }

[Survived] ConditionalExpression
src/custom-specs/spec-processor.ts:220:11
         }
       }
 
-      if (!spec.paths && !spec.components) {
+      if (false) {
         warnings.push(
           "No paths or components defined - this might be an incomplete spec",

[Survived] LogicalOperator
src/custom-specs/spec-processor.ts:220:11
         }
       }
 
-      if (!spec.paths && !spec.components) {
+      if (!spec.paths || !spec.components) {
         warnings.push(
           "No paths or components defined - this might be an incomplete spec",

[NoCoverage] StringLiteral
src/custom-specs/spec-processor.ts:234:50
       };
     } catch (error) {
       const message =
-        error instanceof Error ? error.message : "Unknown validation error";
+        error instanceof Error ? error.message : "";
       errors.push(message);
 

[Killed] LogicalOperator
src/custom-specs/spec-processor.ts:249:18
    * Convert OpenAPI spec to ApiGuruAPI format
    */
   private convertToApiGuruFormat(spec: any): ApiGuruAPI {
-    const info = spec.info || {};
+    const info = spec.info && {};
     const added = new Date().toISOString();
     const version = info.version || "1.0.0";
killedBy: SpecProcessor processSpec should process valid JSON spec from file
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  8
+ Received  + 19

@@ -1,8 +1,9 @@
- ObjectContaining {
-   "metadata": ObjectContaining {

[Survived] LogicalOperator
src/custom-specs/spec-processor.ts:251:21
   private convertToApiGuruFormat(spec: any): ApiGuruAPI {
     const info = spec.info || {};
     const added = new Date().toISOString();
-    const version = info.version || "1.0.0";
+    const version = info.version && "1.0.0";
 
     // Determine file extensions based on original format

[Survived] StringLiteral
src/custom-specs/spec-processor.ts:251:37
   private convertToApiGuruFormat(spec: any): ApiGuruAPI {
     const info = spec.info || {};
     const added = new Date().toISOString();
-    const version = info.version || "1.0.0";
+    const version = info.version || "";
 
     // Determine file extensions based on original format

[Killed] StringLiteral
src/custom-specs/spec-processor.ts:254:22
     const version = info.version || "1.0.0";
 
     // Determine file extensions based on original format
-    const basePath = "custom/spec";
+    const basePath = "";
 
     const apiVersion: ApiGuruApiVersion = {
killedBy: SpecProcessor processSpec should convert to ApiGuruAPI format correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  9
+ Received  + 10

- ObjectContaining {
-   "added": Any<String>,
+ Object {

[Killed] LogicalOperator
src/custom-specs/spec-processor.ts:262:34
       info: {
         ...info,
         "x-providerName": "custom",
-        "x-apisguru-categories": info["x-apisguru-categories"] || ["custom"],
+        "x-apisguru-categories": info["x-apisguru-categories"] && ["custom"],
       },
       swaggerUrl: `${basePath}.json`,
killedBy: SpecProcessor processSpec should convert to ApiGuruAPI format correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  9

- ObjectContaining {
-   "added": Any<String>,
+ Object {

[Killed] ConditionalExpression
src/custom-specs/spec-processor.ts:262:34
       info: {
         ...info,
         "x-providerName": "custom",
-        "x-apisguru-categories": info["x-apisguru-categories"] || ["custom"],
+        "x-apisguru-categories": true,
       },
       swaggerUrl: `${basePath}.json`,
killedBy: SpecProcessor processSpec should convert to ApiGuruAPI format correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  9

- ObjectContaining {
-   "added": Any<String>,
+ Object {

[Killed] LogicalOperator
src/custom-specs/spec-processor.ts:266:19
       },
       swaggerUrl: `${basePath}.json`,
       swaggerYamlUrl: `${basePath}.yaml`,
-      openapiVer: spec.openapi || spec.swagger || "3.0.0",
+      openapiVer: spec.openapi && spec.swagger || "3.0.0",
       link: info.contact?.url || "",
       externalDocs: spec.externalDocs,
killedBy: SpecProcessor processSpec should detect OpenAPI 2.0 specs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2.0"
Received: "3.0.0"

[Killed] ConditionalExpression
src/custom-specs/spec-processor.ts:266:19
       },
       swaggerUrl: `${basePath}.json`,
       swaggerYamlUrl: `${basePath}.yaml`,
-      openapiVer: spec.openapi || spec.swagger || "3.0.0",
+      openapiVer: false || "3.0.0",
       link: info.contact?.url || "",
       externalDocs: spec.externalDocs,
killedBy: SpecProcessor processSpec should detect OpenAPI 2.0 specs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2.0"
Received: "3.0.0"

[Killed] LogicalOperator
src/custom-specs/spec-processor.ts:267:13
       swaggerUrl: `${basePath}.json`,
       swaggerYamlUrl: `${basePath}.yaml`,
       openapiVer: spec.openapi || spec.swagger || "3.0.0",
-      link: info.contact?.url || "",
+      link: info.contact?.url && "",
       externalDocs: spec.externalDocs,
     };
killedBy: SpecProcessor processSpec should convert to ApiGuruAPI format correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 9

- ObjectContaining {
-   "added": Any<String>,
+ Object {

[Killed] OptionalChaining
src/custom-specs/spec-processor.ts:267:13
       swaggerUrl: `${basePath}.json`,
       swaggerYamlUrl: `${basePath}.yaml`,
       openapiVer: spec.openapi || spec.swagger || "3.0.0",
-      link: info.contact?.url || "",
+      link: info.contact.url || "",
       externalDocs: spec.externalDocs,
     };
killedBy: SpecProcessor processSpec should process valid JSON spec from file
statusReason: TypeError: Cannot read properties of undefined (reading 'url')

[Killed] LogicalOperator
src/custom-specs/spec-processor.ts:287:18
     spec: any,
     fileSize: number,
   ): { title: string; description: string; version: string; fileSize: number } {
-    const info = spec.info || {};
+    const info = spec.info && {};
 
     return {
killedBy: SpecProcessor processSpec should process valid JSON spec from file
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  8
+ Received  + 22

@@ -1,9 +1,10 @@
- ObjectContaining {
-   "metadata": ObjectContaining {

[Killed] LogicalOperator
src/custom-specs/spec-processor.ts:290:14
     const info = spec.info || {};
 
     return {
-      title: info.title || "Untitled API",
+      title: info.title && "Untitled API",
       description: info.description || "",
       version: info.version || "1.0.0",
killedBy: SpecProcessor processSpec should process valid JSON spec from file
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  7
+ Received  + 21

@@ -1,9 +1,10 @@
- ObjectContaining {
-   "metadata": ObjectContaining {

[Killed] LogicalOperator
src/custom-specs/spec-processor.ts:291:20
 
     return {
       title: info.title || "Untitled API",
-      description: info.description || "",
+      description: info.description && "",
       version: info.version || "1.0.0",
       fileSize,
killedBy: SpecProcessor processSpec should process valid JSON spec from file
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  7
+ Received  + 21

@@ -1,8 +1,9 @@
- ObjectContaining {
-   "metadata": ObjectContaining {
