[Survived] Regex
src/utils/validation.ts:686:9
         /javascript:/gi,
         /vbscript:/gi, 
         /data:.*base64/gi,
-        /on\w+\s*=/gi, // Event handlers like onclick=
+        /on\w+\S*=/gi, // Event handlers like onclick=
       ];
       

[Killed] ArrowFunction
src/utils/validation.ts:689:54
         /on\w+\s*=/gi, // Event handlers like onclick=
       ];
       
-      const hasNonHtmlThreats = nonHtmlPatterns.some((pattern) => pattern.test(str));
+      const hasNonHtmlThreats = nonHtmlPatterns.some(() => undefined);
       
       // Check for SQL injection patterns
killedBy: DataValidator containsSuspiciousContent should detect javascript: URLs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
src/utils/validation.ts:689:33
         /on\w+\s*=/gi, // Event handlers like onclick=
       ];
       
-      const hasNonHtmlThreats = nonHtmlPatterns.some((pattern) => pattern.test(str));
+      const hasNonHtmlThreats = nonHtmlPatterns.every(pattern => pattern.test(str));
       
       // Check for SQL injection patterns
killedBy: DataValidator containsSuspiciousContent should detect javascript: URLs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] Regex
src/utils/validation.ts:693:9
       
       // Check for SQL injection patterns
       const sqlPatterns = [
-        /\bDROP\s+TABLE\b/gi,
+        /\bDROP\S+TABLE\b/gi,
         /\bSELECT\s+\*\s+FROM\b/gi,
         /['";].*--/gi,

[Killed] Regex
src/utils/validation.ts:694:9
       // Check for SQL injection patterns
       const sqlPatterns = [
         /\bDROP\s+TABLE\b/gi,
-        /\bSELECT\s+\*\s+FROM\b/gi,
+        /\bSELECT\s+\*\S+FROM\b/gi,
         /['";].*--/gi,
       ];
killedBy: DataValidator containsSuspiciousContent should detect SQL injection attempts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] Regex
src/utils/validation.ts:694:9
       // Check for SQL injection patterns
       const sqlPatterns = [
         /\bDROP\s+TABLE\b/gi,
-        /\bSELECT\s+\*\s+FROM\b/gi,
+        /\bSELECT\S+\*\s+FROM\b/gi,
         /['";].*--/gi,
       ];
killedBy: DataValidator containsSuspiciousContent should detect SQL injection attempts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] Regex
src/utils/validation.ts:695:9
       const sqlPatterns = [
         /\bDROP\s+TABLE\b/gi,
         /\bSELECT\s+\*\s+FROM\b/gi,
-        /['";].*--/gi,
+        /[^'";].*--/gi,
       ];
       

[Killed] ArrowFunction
src/utils/validation.ts:698:48
         /['";].*--/gi,
       ];
       
-      const hasSqlInjection = sqlPatterns.some((pattern) => pattern.test(str));
+      const hasSqlInjection = sqlPatterns.some(() => undefined);
       
       // Use DOMPurify for HTML/XSS detection
killedBy: DataValidator containsSuspiciousContent should detect SQL injection attempts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
src/utils/validation.ts:698:31
         /['";].*--/gi,
       ];
       
-      const hasSqlInjection = sqlPatterns.some((pattern) => pattern.test(str));
+      const hasSqlInjection = sqlPatterns.every(pattern => pattern.test(str));
       
       // Use DOMPurify for HTML/XSS detection
killedBy: DataValidator containsSuspiciousContent should detect SQL injection attempts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] StringLiteral
src/utils/validation.ts:701:32
       const hasSqlInjection = sqlPatterns.some((pattern) => pattern.test(str));
       
       // Use DOMPurify for HTML/XSS detection
-      const window = new JSDOM("").window;
+      const window = new JSDOM("Stryker was here!").window;
       const purify = DOMPurify(window as any);
       

[Survived] ObjectLiteral
src/utils/validation.ts:705:46
       const purify = DOMPurify(window as any);
       
       // Sanitize the string with very strict settings
-      const sanitized = purify.sanitize(str, {
-        ALLOWED_TAGS: [], // No HTML tags allowed
-        ALLOWED_ATTR: [], // No attributes allowed
-        KEEP_CONTENT: true, // Keep text content
-        FORBID_TAGS: ["script", "style", "iframe", "object", "embed"],
-        FORBID_ATTR: ["onclick", "onload", "onerror", "javascript", "vbscript"],
-      });
+      const sanitized = purify.sanitize(str, {});
       
       const hasHtmlThreats = sanitized !== str;

[Survived] BooleanLiteral
src/utils/validation.ts:708:23
       const sanitized = purify.sanitize(str, {
         ALLOWED_TAGS: [], // No HTML tags allowed
         ALLOWED_ATTR: [], // No attributes allowed
-        KEEP_CONTENT: true, // Keep text content
+        KEEP_CONTENT: false, // Keep text content
         FORBID_TAGS: ["script", "style", "iframe", "object", "embed"],
         FORBID_ATTR: ["onclick", "onload", "onerror", "javascript", "vbscript"],

[Survived] StringLiteral
src/utils/validation.ts:710:34
         ALLOWED_ATTR: [], // No attributes allowed
         KEEP_CONTENT: true, // Keep text content
         FORBID_TAGS: ["script", "style", "iframe", "object", "embed"],
-        FORBID_ATTR: ["onclick", "onload", "onerror", "javascript", "vbscript"],
+        FORBID_ATTR: ["onclick", "", "onerror", "javascript", "vbscript"],
       });
       

[Killed] EqualityOperator
src/utils/validation.ts:713:30
         FORBID_ATTR: ["onclick", "onload", "onerror", "javascript", "vbscript"],
       });
       
-      const hasHtmlThreats = sanitized !== str;
+      const hasHtmlThreats = sanitized === str;
       
       // Return true if any threats are detected
killedBy: DataValidator containsSuspiciousContent should detect XSS script tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/utils/validation.ts:713:30
         FORBID_ATTR: ["onclick", "onload", "onerror", "javascript", "vbscript"],
       });
       
-      const hasHtmlThreats = sanitized !== str;
+      const hasHtmlThreats = false;
       
       // Return true if any threats are detected
killedBy: DataValidator containsSuspiciousContent should detect XSS script tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/utils/validation.ts:716:14
       const hasHtmlThreats = sanitized !== str;
       
       // Return true if any threats are detected
-      return hasNonHtmlThreats || hasSqlInjection || hasHtmlThreats;
+      return false;
     } catch (error) {
       // If DOMPurify fails, fall back to basic checks
killedBy: DataValidator containsSuspiciousContent should detect XSS script tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/utils/validation.ts:716:14
       const hasHtmlThreats = sanitized !== str;
       
       // Return true if any threats are detected
-      return hasNonHtmlThreats || hasSqlInjection || hasHtmlThreats;
+      return false || hasHtmlThreats;
     } catch (error) {
       // If DOMPurify fails, fall back to basic checks
killedBy: DataValidator containsSuspiciousContent should detect javascript: URLs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] Regex
src/utils/validation.ts:722:9
       const basicPatterns = [
         /<script/i,
         /javascript:/i,
-        /on\w+\s*=/i,
+        /on\w+\s=/i,
         /\bDROP\s+TABLE\b/gi,
         /\bSELECT\s+\*\s+FROM\b/gi,

[Survived] Regex
src/utils/validation.ts:723:9
         /<script/i,
         /javascript:/i,
         /on\w+\s*=/i,
-        /\bDROP\s+TABLE\b/gi,
+        /\bDROP\sTABLE\b/gi,
         /\bSELECT\s+\*\s+FROM\b/gi,
       ];

[Survived] Regex
src/utils/validation.ts:723:9
         /<script/i,
         /javascript:/i,
         /on\w+\s*=/i,
-        /\bDROP\s+TABLE\b/gi,
+        /\bDROP\S+TABLE\b/gi,
         /\bSELECT\s+\*\s+FROM\b/gi,
       ];

[Survived] MethodExpression
src/utils/validation.ts:727:14
         /\bSELECT\s+\*\s+FROM\b/gi,
       ];
 
-      return basicPatterns.some((pattern) => pattern.test(str));
+      return basicPatterns.every(pattern => pattern.test(str));
     }
   }

[Survived] ArrowFunction
src/utils/validation.ts:727:33
         /\bSELECT\s+\*\s+FROM\b/gi,
       ];
 
-      return basicPatterns.some((pattern) => pattern.test(str));
+      return basicPatterns.some(() => undefined);
     }
   }
