[Killed] LogicalOperator
src/custom-specs/spec-processor.ts:292:16
     return {
       title: info.title || "Untitled API",
       description: info.description || "",
-      version: info.version || "1.0.0",
+      version: info.version && "1.0.0",
       fileSize,
     };
killedBy: SpecProcessor processSpec should handle missing required fields gracefully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1.0.0"
Received: undefined

[Killed] StringLiteral
src/custom-specs/spec-processor.ts:292:32
     return {
       title: info.title || "Untitled API",
       description: info.description || "",
-      version: info.version || "1.0.0",
+      version: info.version || "",
       fileSize,
     };
killedBy: SpecProcessor processSpec should handle missing required fields gracefully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1.0.0"
Received: ""

[Killed] BooleanLiteral
src/custom-specs/spec-processor.ts:305:16
       scannedAt: new Date().toISOString(),
       issues: [],
       summary: { critical: 0, high: 0, medium: 0, low: 0 },
-      blocked: false,
+      blocked: true,
     };
   }
killedBy: SpecProcessor processSpec should skip security scanning when requested
statusReason: TypeError: this.securityScanner.generateReport is not a function

[NoCoverage] ConditionalExpression
src/custom-specs/spec-processor.ts:325:11
     try {
       let content: string;
 
-      if (this.isUrl(source)) {
+      if (false) {
         content = await this.fetchFromUrl(source);
       } else {

[NoCoverage] ConditionalExpression
src/custom-specs/spec-processor.ts:325:11
     try {
       let content: string;
 
-      if (this.isUrl(source)) {
+      if (true) {
         content = await this.fetchFromUrl(source);
       } else {
