[Survived] MethodExpression
src/utils/logger.ts:17:19
   private static logLevel: LogLevel = this.getLogLevelFromEnv();
 
   private static getLogLevelFromEnv(): LogLevel {
-    const level = process.env.LOG_LEVEL?.toUpperCase();
+    const level = process.env.LOG_LEVEL?.toLowerCase();
     switch (level) {
       case "ERROR":

[NoCoverage] ConditionalExpression
src/utils/logger.ts:19:7
   private static getLogLevelFromEnv(): LogLevel {
     const level = process.env.LOG_LEVEL?.toUpperCase();
     switch (level) {
-      case "ERROR":
-        return LogLevel.ERROR;
+      case "ERROR":
       case "WARN":
         return LogLevel.WARN;

[Survived] StringLiteral
src/utils/logger.ts:19:12
   private static getLogLevelFromEnv(): LogLevel {
     const level = process.env.LOG_LEVEL?.toUpperCase();
     switch (level) {
-      case "ERROR":
+      case "":
         return LogLevel.ERROR;
       case "WARN":

[NoCoverage] ConditionalExpression
src/utils/logger.ts:21:7
     switch (level) {
       case "ERROR":
         return LogLevel.ERROR;
-      case "WARN":
-        return LogLevel.WARN;
+      case "WARN":
       case "INFO":
         return LogLevel.INFO;

[NoCoverage] ConditionalExpression
src/utils/logger.ts:23:7
         return LogLevel.ERROR;
       case "WARN":
         return LogLevel.WARN;
-      case "INFO":
-        return LogLevel.INFO;
+      case "INFO":
       case "DEBUG":
         return LogLevel.DEBUG;

[NoCoverage] ConditionalExpression
src/utils/logger.ts:25:7
         return LogLevel.WARN;
       case "INFO":
         return LogLevel.INFO;
-      case "DEBUG":
-        return LogLevel.DEBUG;
+      case "DEBUG":
       default:
         // Default to WARN in production, DEBUG in development/test

[Survived] EqualityOperator
src/utils/logger.ts:29:16
         return LogLevel.DEBUG;
       default:
         // Default to WARN in production, DEBUG in development/test
-        return process.env.NODE_ENV === "production"
+        return process.env.NODE_ENV !== "production"
           ? LogLevel.WARN
           : LogLevel.DEBUG;

[Survived] ConditionalExpression
src/utils/logger.ts:29:16
         return LogLevel.DEBUG;
       default:
         // Default to WARN in production, DEBUG in development/test
-        return process.env.NODE_ENV === "production"
+        return true
           ? LogLevel.WARN
           : LogLevel.DEBUG;

[Survived] BlockStatement
src/utils/logger.ts:35:55
     }
   }
 
-  static error(message: string, ...args: any[]): void {
-    if (this.logLevel >= LogLevel.ERROR) {
-      // eslint-disable-next-line no-console
-      console.error(`[ERROR] ${message}`, ...args);
-    }
-  }
+  static error(message: string, ...args: any[]): void {}
 
   static warn(message: string, ...args: any[]): void {

[Survived] EqualityOperator
src/utils/logger.ts:36:9
   }
 
   static error(message: string, ...args: any[]): void {
-    if (this.logLevel >= LogLevel.ERROR) {
+    if (this.logLevel < LogLevel.ERROR) {
       // eslint-disable-next-line no-console
       console.error(`[ERROR] ${message}`, ...args);

[Survived] BlockStatement
src/utils/logger.ts:36:42
   }
 
   static error(message: string, ...args: any[]): void {
-    if (this.logLevel >= LogLevel.ERROR) {
-      // eslint-disable-next-line no-console
-      console.error(`[ERROR] ${message}`, ...args);
-    }
+    if (this.logLevel >= LogLevel.ERROR) {}
   }
 

[Survived] BlockStatement
src/utils/logger.ts:42:54
     }
   }
 
-  static warn(message: string, ...args: any[]): void {
-    if (this.logLevel >= LogLevel.WARN) {
-      // eslint-disable-next-line no-console
-      console.warn(`[WARN] ${message}`, ...args);
-    }
-  }
+  static warn(message: string, ...args: any[]): void {}
 
   static info(message: string, ...args: any[]): void {

[Survived] EqualityOperator
src/utils/logger.ts:43:9
   }
 
   static warn(message: string, ...args: any[]): void {
-    if (this.logLevel >= LogLevel.WARN) {
+    if (this.logLevel > LogLevel.WARN) {
       // eslint-disable-next-line no-console
       console.warn(`[WARN] ${message}`, ...args);

[Survived] ConditionalExpression
src/utils/logger.ts:43:9
   }
 
   static warn(message: string, ...args: any[]): void {
-    if (this.logLevel >= LogLevel.WARN) {
+    if (false) {
       // eslint-disable-next-line no-console
       console.warn(`[WARN] ${message}`, ...args);

[Survived] StringLiteral
src/utils/logger.ts:45:20
   static warn(message: string, ...args: any[]): void {
     if (this.logLevel >= LogLevel.WARN) {
       // eslint-disable-next-line no-console
-      console.warn(`[WARN] ${message}`, ...args);
+      console.warn(``, ...args);
     }
   }

[Survived] BlockStatement
src/utils/logger.ts:49:54
     }
   }
 
-  static info(message: string, ...args: any[]): void {
-    if (this.logLevel >= LogLevel.INFO) {
-      // eslint-disable-next-line no-console
-      console.info(`[INFO] ${message}`, ...args);
-    }
-  }
+  static info(message: string, ...args: any[]): void {}
 
   static debug(message: string, ...args: any[]): void {

[Survived] ConditionalExpression
src/utils/logger.ts:50:9
   }
 
   static info(message: string, ...args: any[]): void {
-    if (this.logLevel >= LogLevel.INFO) {
+    if (false) {
       // eslint-disable-next-line no-console
       console.info(`[INFO] ${message}`, ...args);

[Survived] EqualityOperator
src/utils/logger.ts:50:9
   }
 
   static info(message: string, ...args: any[]): void {
-    if (this.logLevel >= LogLevel.INFO) {
+    if (this.logLevel > LogLevel.INFO) {
       // eslint-disable-next-line no-console
       console.info(`[INFO] ${message}`, ...args);

[Survived] StringLiteral
src/utils/logger.ts:52:20
   static info(message: string, ...args: any[]): void {
     if (this.logLevel >= LogLevel.INFO) {
       // eslint-disable-next-line no-console
-      console.info(`[INFO] ${message}`, ...args);
+      console.info(``, ...args);
     }
   }

[NoCoverage] BlockStatement
src/utils/logger.ts:56:55
     }
   }
 
-  static debug(message: string, ...args: any[]): void {
-    if (this.logLevel >= LogLevel.DEBUG) {
-      // eslint-disable-next-line no-console
-      console.log(`[DEBUG] ${message}`, ...args);
-    }
-  }
+  static debug(message: string, ...args: any[]): void {}
 
   /**

[NoCoverage] EqualityOperator
src/utils/logger.ts:57:9
   }
 
   static debug(message: string, ...args: any[]): void {
-    if (this.logLevel >= LogLevel.DEBUG) {
+    if (this.logLevel < LogLevel.DEBUG) {
       // eslint-disable-next-line no-console
       console.log(`[DEBUG] ${message}`, ...args);

[NoCoverage] BlockStatement
src/utils/logger.ts:57:42
   }
 
   static debug(message: string, ...args: any[]): void {
-    if (this.logLevel >= LogLevel.DEBUG) {
-      // eslint-disable-next-line no-console
-      console.log(`[DEBUG] ${message}`, ...args);
-    }
+    if (this.logLevel >= LogLevel.DEBUG) {}
   }
 

[Survived] BlockStatement
src/utils/logger.ts:67:70
    * Special method for cache operations - uses debug level
    * to avoid cluttering production logs
    */
-  static cache(operation: string, key?: string, details?: any): void {
-    if (this.logLevel >= LogLevel.DEBUG) {
-      const sanitizedKey = key ? this.sanitizeKey(key) : "";
-      const message = details
-        ? `[CACHE] ${operation}: ${sanitizedKey} - ${JSON.stringify(details)}`
-        : `[CACHE] ${operation}: ${sanitizedKey}`;
-      // eslint-disable-next-line no-console
-      console.log(message);
-    }
-  }
+  static cache(operation: string, key?: string, details?: any): void {}
 
   /**

[Survived] BlockStatement
src/utils/logger.ts:68:42
    * to avoid cluttering production logs
    */
   static cache(operation: string, key?: string, details?: any): void {
-    if (this.logLevel >= LogLevel.DEBUG) {
-      const sanitizedKey = key ? this.sanitizeKey(key) : "";
-      const message = details
-        ? `[CACHE] ${operation}: ${sanitizedKey} - ${JSON.stringify(details)}`
-        : `[CACHE] ${operation}: ${sanitizedKey}`;
-      // eslint-disable-next-line no-console
-      console.log(message);
-    }
+    if (this.logLevel >= LogLevel.DEBUG) {}
   }
 

[Survived] ConditionalExpression
src/utils/logger.ts:68:9
    * to avoid cluttering production logs
    */
   static cache(operation: string, key?: string, details?: any): void {
-    if (this.logLevel >= LogLevel.DEBUG) {
+    if (true) {
       const sanitizedKey = key ? this.sanitizeKey(key) : "";
       const message = details

[Survived] StringLiteral
src/utils/logger.ts:72:11
       const sanitizedKey = key ? this.sanitizeKey(key) : "";
       const message = details
         ? `[CACHE] ${operation}: ${sanitizedKey} - ${JSON.stringify(details)}`
-        : `[CACHE] ${operation}: ${sanitizedKey}`;
+        : ``;
       // eslint-disable-next-line no-console
       console.log(message);

[Survived] EqualityOperator
src/utils/logger.ts:83:9
    */
   private static sanitizeKey(key: string): string {
     // Truncate long keys and mask potentially sensitive parts
-    if (key.length > 50) {
+    if (key.length >= 50) {
       return `${key.substring(0, 20)}...${key.substring(key.length - 20)}`;
     }

[NoCoverage] BlockStatement
src/utils/logger.ts:83:26
    */
   private static sanitizeKey(key: string): string {
     // Truncate long keys and mask potentially sensitive parts
-    if (key.length > 50) {
-      return `${key.substring(0, 20)}...${key.substring(key.length - 20)}`;
-    }
+    if (key.length > 50) {}
     return key;
   }

[NoCoverage] MethodExpression
src/utils/logger.ts:84:43
   private static sanitizeKey(key: string): string {
     // Truncate long keys and mask potentially sensitive parts
     if (key.length > 50) {
-      return `${key.substring(0, 20)}...${key.substring(key.length - 20)}`;
+      return `${key.substring(0, 20)}...${key}`;
     }
     return key;

[NoCoverage] MethodExpression
src/utils/logger.ts:84:17
   private static sanitizeKey(key: string): string {
     // Truncate long keys and mask potentially sensitive parts
     if (key.length > 50) {
-      return `${key.substring(0, 20)}...${key.substring(key.length - 20)}`;
+      return `${key}...${key.substring(key.length - 20)}`;
     }
     return key;

[NoCoverage] BlockStatement
src/utils/logger.ts:92:45
   /**
    * Set log level dynamically
    */
-  static setLogLevel(level: LogLevel): void {
-    this.logLevel = level;
-  }
+  static setLogLevel(level: LogLevel): void {}
 }
 
