[Survived] ConditionalExpression
src/utils/errors.ts:38:9
     this.userMessage = userMessage || this.generateUserMessage();
 
     // Maintain proper stack trace
-    if (Error.captureStackTrace) {
+    if (true) {
       Error.captureStackTrace(this, this.constructor);
     }

[Survived] ConditionalExpression
src/utils/errors.ts:38:9
     this.userMessage = userMessage || this.generateUserMessage();
 
     // Maintain proper stack trace
-    if (Error.captureStackTrace) {
+    if (false) {
       Error.captureStackTrace(this, this.constructor);
     }

[Killed] ConditionalExpression
src/utils/errors.ts:47:7
     const { operation, source, provider, apiId } = this.context;
 
     switch (this.code) {
-      case ERROR_CODES.NETWORK_ERROR:
-        return `Unable to connect to ${source || "API"} service. Please check your internet connection and try again.`;
+      case ERROR_CODES.NETWORK_ERROR:
 
       case ERROR_CODES.TIMEOUT_ERROR:
killedBy: Error Classes OpenAPIDirectoryError should generate default user message
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Unable to connect to primary service"
Received string:    "The operation took too long to complete. Please try again or contact support if the problem persists."

[Killed] LogicalOperator
src/utils/errors.ts:48:40
 
     switch (this.code) {
       case ERROR_CODES.NETWORK_ERROR:
-        return `Unable to connect to ${source || "API"} service. Please check your internet connection and try again.`;
+        return `Unable to connect to ${source && "API"} service. Please check your internet connection and try again.`;
 
       case ERROR_CODES.TIMEOUT_ERROR:
killedBy: Error Classes OpenAPIDirectoryError should generate default user message
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Unable to connect to primary service"
Received string:    "Unable to connect to API service. Please check your internet connection and try again."

[Killed] ConditionalExpression
src/utils/errors.ts:48:40
 
     switch (this.code) {
       case ERROR_CODES.NETWORK_ERROR:
-        return `Unable to connect to ${source || "API"} service. Please check your internet connection and try again.`;
+        return `Unable to connect to ${true} service. Please check your internet connection and try again.`;
 
       case ERROR_CODES.TIMEOUT_ERROR:
killedBy: Error Classes OpenAPIDirectoryError should generate default user message
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Unable to connect to primary service"
Received string:    "Unable to connect to true service. Please check your internet connection and try again."

[Killed] ConditionalExpression
src/utils/errors.ts:50:7
       case ERROR_CODES.NETWORK_ERROR:
         return `Unable to connect to ${source || "API"} service. Please check your internet connection and try again.`;
 
-      case ERROR_CODES.TIMEOUT_ERROR:
-        return `The ${operation || "operation"} took too long to complete. Please try again or contact support if the problem persists.`;
+      case ERROR_CODES.TIMEOUT_ERROR:
 
       case ERROR_CODES.NOT_FOUND_ERROR:
killedBy: Error Classes TimeoutError should create timeout error with correct properties
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "took too long to complete"
Received string:    "The requested resource was not found. Please verify your request and try again."

[Survived] ConditionalExpression
src/utils/errors.ts:51:23
         return `Unable to connect to ${source || "API"} service. Please check your internet connection and try again.`;
 
       case ERROR_CODES.TIMEOUT_ERROR:
-        return `The ${operation || "operation"} took too long to complete. Please try again or contact support if the problem persists.`;
+        return `The ${false} took too long to complete. Please try again or contact support if the problem persists.`;
 
       case ERROR_CODES.NOT_FOUND_ERROR:

[Survived] ConditionalExpression
src/utils/errors.ts:51:23
         return `Unable to connect to ${source || "API"} service. Please check your internet connection and try again.`;
 
       case ERROR_CODES.TIMEOUT_ERROR:
-        return `The ${operation || "operation"} took too long to complete. Please try again or contact support if the problem persists.`;
+        return `The ${true} took too long to complete. Please try again or contact support if the problem persists.`;
 
       case ERROR_CODES.NOT_FOUND_ERROR:

[Killed] ConditionalExpression
src/utils/errors.ts:53:7
       case ERROR_CODES.TIMEOUT_ERROR:
         return `The ${operation || "operation"} took too long to complete. Please try again or contact support if the problem persists.`;
 
-      case ERROR_CODES.NOT_FOUND_ERROR:
-        if (apiId) {
-          return `The API "${apiId}" was not found in the ${source || ""} source. Please verify the API identifier.`;
-        }
-        if (provider) {
-          return `The provider "${provider}" was not found. Please check the provider name.`;
-        }
-        return `The requested resource was not found. Please verify your request and try again.`;
+      case ERROR_CODES.NOT_FOUND_ERROR:
 
       case ERROR_CODES.VALIDATION_ERROR:
killedBy: Error Classes NotFoundError should create not found error with correct properties
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "requested resource was not found"
Received string:    "The provided data is invalid. Please check your input and try again."

[Killed] ConditionalExpression
src/utils/errors.ts:54:13
         return `The ${operation || "operation"} took too long to complete. Please try again or contact support if the problem persists.`;
 
       case ERROR_CODES.NOT_FOUND_ERROR:
-        if (apiId) {
+        if (true) {
           return `The API "${apiId}" was not found in the ${source || ""} source. Please verify the API identifier.`;
         }
killedBy: Error Classes NotFoundError should create not found error with correct properties
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "requested resource was not found"
Received string:    "The API \"undefined\" was not found in the  source. Please verify the API identifier."

[NoCoverage] BlockStatement
src/utils/errors.ts:54:20
         return `The ${operation || "operation"} took too long to complete. Please try again or contact support if the problem persists.`;
 
       case ERROR_CODES.NOT_FOUND_ERROR:
-        if (apiId) {
-          return `The API "${apiId}" was not found in the ${source || ""} source. Please verify the API identifier.`;
-        }
+        if (apiId) {}
         if (provider) {
           return `The provider "${provider}" was not found. Please check the provider name.`;

[NoCoverage] LogicalOperator
src/utils/errors.ts:55:61
 
       case ERROR_CODES.NOT_FOUND_ERROR:
         if (apiId) {
-          return `The API "${apiId}" was not found in the ${source || ""} source. Please verify the API identifier.`;
+          return `The API "${apiId}" was not found in the ${source && ""} source. Please verify the API identifier.`;
         }
         if (provider) {

[NoCoverage] ConditionalExpression
src/utils/errors.ts:55:61
 
       case ERROR_CODES.NOT_FOUND_ERROR:
         if (apiId) {
-          return `The API "${apiId}" was not found in the ${source || ""} source. Please verify the API identifier.`;
+          return `The API "${apiId}" was not found in the ${true} source. Please verify the API identifier.`;
         }
         if (provider) {

[Killed] ConditionalExpression
src/utils/errors.ts:57:13
         if (apiId) {
           return `The API "${apiId}" was not found in the ${source || ""} source. Please verify the API identifier.`;
         }
-        if (provider) {
+        if (true) {
           return `The provider "${provider}" was not found. Please check the provider name.`;
         }
killedBy: Error Classes NotFoundError should create not found error with correct properties
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "requested resource was not found"
Received string:    "The provider \"undefined\" was not found. Please check the provider name."

[Survived] ConditionalExpression
src/utils/errors.ts:57:13
         if (apiId) {
           return `The API "${apiId}" was not found in the ${source || ""} source. Please verify the API identifier.`;
         }
-        if (provider) {
+        if (false) {
           return `The provider "${provider}" was not found. Please check the provider name.`;
         }

[NoCoverage] StringLiteral
src/utils/errors.ts:58:18
           return `The API "${apiId}" was not found in the ${source || ""} source. Please verify the API identifier.`;
         }
         if (provider) {
-          return `The provider "${provider}" was not found. Please check the provider name.`;
+          return ``;
         }
         return `The requested resource was not found. Please verify your request and try again.`;

[Killed] ConditionalExpression
src/utils/errors.ts:62:7
         }
         return `The requested resource was not found. Please verify your request and try again.`;
 
-      case ERROR_CODES.VALIDATION_ERROR:
-        return `The provided data is invalid. Please check your input and try again.`;
+      case ERROR_CODES.VALIDATION_ERROR:
 
       case ERROR_CODES.RATE_LIMIT_ERROR:
killedBy: Error Classes ValidationError should create validation error with correct properties
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "provided data is invalid"
Received string:    "Too many requests. Please wait a moment before trying again."

[Killed] ConditionalExpression
src/utils/errors.ts:65:7
       case ERROR_CODES.VALIDATION_ERROR:
         return `The provided data is invalid. Please check your input and try again.`;
 
-      case ERROR_CODES.RATE_LIMIT_ERROR:
-        return `Too many requests. Please wait a moment before trying again.`;
+      case ERROR_CODES.RATE_LIMIT_ERROR:
 
       case ERROR_CODES.SPEC_PARSE_ERROR:
killedBy: Error Classes RateLimitError should create rate limit error with correct properties
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Too many requests"
Received string:    "Unable to parse the OpenAPI specification. The file may be corrupted or in an unsupported format."

[Killed] StringLiteral
src/utils/errors.ts:66:16
         return `The provided data is invalid. Please check your input and try again.`;
 
       case ERROR_CODES.RATE_LIMIT_ERROR:
-        return `Too many requests. Please wait a moment before trying again.`;
+        return ``;
 
       case ERROR_CODES.SPEC_PARSE_ERROR:
killedBy: Error Classes RateLimitError should create rate limit error with correct properties
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Too many requests"
Received string:    ""

[Killed] ConditionalExpression
src/utils/errors.ts:68:7
       case ERROR_CODES.RATE_LIMIT_ERROR:
         return `Too many requests. Please wait a moment before trying again.`;
 
-      case ERROR_CODES.SPEC_PARSE_ERROR:
-        return `Unable to parse the OpenAPI specification. The file may be corrupted or in an unsupported format.`;
+      case ERROR_CODES.SPEC_PARSE_ERROR:
 
       case ERROR_CODES.AUTH_ERROR:
killedBy: Error Classes SpecParseError should create spec parse error with correct properties
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Unable to parse the OpenAPI specification"
Received string:    "Authentication failed. Please check your credentials and try again."

[Killed] StringLiteral
src/utils/errors.ts:69:16
         return `Too many requests. Please wait a moment before trying again.`;
 
       case ERROR_CODES.SPEC_PARSE_ERROR:
-        return `Unable to parse the OpenAPI specification. The file may be corrupted or in an unsupported format.`;
+        return ``;
 
       case ERROR_CODES.AUTH_ERROR:
killedBy: Error Classes SpecParseError should create spec parse error with correct properties
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Unable to parse the OpenAPI specification"
Received string:    ""

[Killed] ConditionalExpression
src/utils/errors.ts:71:7
       case ERROR_CODES.SPEC_PARSE_ERROR:
         return `Unable to parse the OpenAPI specification. The file may be corrupted or in an unsupported format.`;
 
-      case ERROR_CODES.AUTH_ERROR:
-        return `Authentication failed. Please check your credentials and try again.`;
+      case ERROR_CODES.AUTH_ERROR:
 
       case ERROR_CODES.SERVER_ERROR:
killedBy: Error Classes AuthError should create auth error with correct properties
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Authentication failed"
Received string:    "The server encountered an error. Please try again later or contact support."

[Killed] StringLiteral
src/utils/errors.ts:72:16
         return `Unable to parse the OpenAPI specification. The file may be corrupted or in an unsupported format.`;
 
       case ERROR_CODES.AUTH_ERROR:
-        return `Authentication failed. Please check your credentials and try again.`;
+        return ``;
 
       case ERROR_CODES.SERVER_ERROR:
killedBy: Error Classes AuthError should create auth error with correct properties
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Authentication failed"
Received string:    ""

[Killed] ConditionalExpression
src/utils/errors.ts:74:7
       case ERROR_CODES.AUTH_ERROR:
         return `Authentication failed. Please check your credentials and try again.`;
 
-      case ERROR_CODES.SERVER_ERROR:
-        return `The server encountered an error. Please try again later or contact support.`;
+      case ERROR_CODES.SERVER_ERROR:
 
       default:
killedBy: Error Classes ServerError should create server error with correct properties
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "server encountered an error"
Received string:    "An unexpected error occurred. Please try again or contact support."

[Killed] StringLiteral
src/utils/errors.ts:75:16
         return `Authentication failed. Please check your credentials and try again.`;
 
       case ERROR_CODES.SERVER_ERROR:
-        return `The server encountered an error. Please try again later or contact support.`;
+        return ``;
 
       default:
killedBy: Error Classes ServerError should create server error with correct properties
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "server encountered an error"
Received string:    ""

[Killed] StringLiteral
src/utils/errors.ts:78:16
         return `The server encountered an error. Please try again later or contact support.`;
 
       default:
-        return `An unexpected error occurred${operation ? ` during ${operation}` : ""}. Please try again or contact support.`;
+        return ``;
     }
   }
killedBy: Error Classes CacheError should create cache error with correct properties
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "unexpected error occurred during get"
Received string:    ""

[Survived] StringLiteral
src/utils/errors.ts:78:84
         return `The server encountered an error. Please try again later or contact support.`;
 
       default:
-        return `An unexpected error occurred${operation ? ` during ${operation}` : ""}. Please try again or contact support.`;
+        return `An unexpected error occurred${operation ? ` during ${operation}` : "Stryker was here!"}. Please try again or contact support.`;
     }
   }

[Killed] ConditionalExpression
src/utils/errors.ts:187:20
     error: any,
     context: ErrorContext = {},
   ): OpenAPIDirectoryError {
-    const status = error.response?.status || error.status;
+    const status = false;
     const message = error.message || "Unknown error";
 
killedBy: SecondaryApiClient error handling should handle 404 errors
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: NotFoundError
Received constructor: OpenAPIDirectoryError

Received message: "Unknown error"

      387 |         }

[Killed] OptionalChaining
src/utils/errors.ts:187:20
     error: any,
     context: ErrorContext = {},
   ): OpenAPIDirectoryError {
-    const status = error.response?.status || error.status;
+    const status = error.response.status || error.status;
     const message = error.message || "Unknown error";
 
killedBy: SecondaryApiClient getProviders should handle and log errors
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: NetworkError
Received constructor: TypeError

Received message: "Cannot read properties of undefined (reading 'status')"

      322 |     } else {

[Killed] LogicalOperator
src/utils/errors.ts:188:21
     context: ErrorContext = {},
   ): OpenAPIDirectoryError {
     const status = error.response?.status || error.status;
-    const message = error.message || "Unknown error";
+    const message = error.message && "Unknown error";
 
     if (error.code === "ECONNREFUSED" || error.code === "ENOTFOUND") {
killedBy: ErrorFactory fromHttpError should create NotFoundError for 404
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Resource not found"
Received: "Unknown error"

[Killed] ConditionalExpression
src/utils/errors.ts:190:42
     const status = error.response?.status || error.status;
     const message = error.message || "Unknown error";
 
-    if (error.code === "ECONNREFUSED" || error.code === "ENOTFOUND") {
+    if (error.code === "ECONNREFUSED" || false) {
       return new NetworkError(message, context);
     }
killedBy: SecondaryApiClient error handling should handle network errors
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: NetworkError
Received constructor: OpenAPIDirectoryError

Received message: "getaddrinfo ENOTFOUND"

      387 |         }

[Killed] EqualityOperator
src/utils/errors.ts:190:42
     const status = error.response?.status || error.status;
     const message = error.message || "Unknown error";
 
-    if (error.code === "ECONNREFUSED" || error.code === "ENOTFOUND") {
+    if (error.code === "ECONNREFUSED" || error.code !== "ENOTFOUND") {
       return new NetworkError(message, context);
     }
killedBy: SecondaryApiClient error handling should handle 404 errors
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: NotFoundError
Received constructor: NetworkError

Received message: "Unknown error"

      329 |         } else {

[Killed] ConditionalExpression
src/utils/errors.ts:194:9
       return new NetworkError(message, context);
     }
 
-    if (error.code === "ETIMEDOUT" || error.code === "ECONNABORTED") {
+    if (false) {
       return new TimeoutError(message, context);
     }
killedBy: SecondaryApiClient error handling should handle timeout errors
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: TimeoutError
Received constructor: OpenAPIDirectoryError

Received message: "timeout of 30000ms exceeded"

      387 |         }

[Killed] ConditionalExpression
src/utils/errors.ts:194:9
       return new NetworkError(message, context);
     }
 
-    if (error.code === "ETIMEDOUT" || error.code === "ECONNABORTED") {
+    if (false || error.code === "ECONNABORTED") {
       return new TimeoutError(message, context);
     }
killedBy: ErrorFactory fromHttpError should create TimeoutError for timeout
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: TimeoutError
Received constructor: OpenAPIDirectoryError

[Killed] BlockStatement
src/utils/errors.ts:198:17
       return new TimeoutError(message, context);
     }
 
-    if (status) {
-      if (status === 404) {
-        return new NotFoundError(message, context);
-      }
-
-      if (status === 401 || status === 403) {
-        return new AuthError(message, context);
-      }
-
-      if (status === 429) {
-        return new RateLimitError(message, context);
-      }
-
-      if (status >= 400 && status < 500) {
-        return new ValidationError(message, context);
-      }
-
-      if (status >= 500) {
-        return new ServerError(message, context);
-      }
-    }
+    if (status) {}
 
     return new OpenAPIDirectoryError(
killedBy: SecondaryApiClient error handling should handle 404 errors
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: NotFoundError
Received constructor: OpenAPIDirectoryError

Received message: "Unknown error"

      387 |         }

[Killed] ConditionalExpression
src/utils/errors.ts:198:9
       return new TimeoutError(message, context);
     }
 
-    if (status) {
+    if (false) {
       if (status === 404) {
         return new NotFoundError(message, context);
killedBy: SecondaryApiClient error handling should handle 404 errors
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: NotFoundError
Received constructor: OpenAPIDirectoryError

Received message: "Unknown error"

      387 |         }

[Killed] ConditionalExpression
src/utils/errors.ts:199:11
     }
 
     if (status) {
-      if (status === 404) {
+      if (false) {
         return new NotFoundError(message, context);
       }
killedBy: ErrorFactory fromHttpError should create NotFoundError for 404
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: NotFoundError
Received constructor: ValidationError

[Killed] ConditionalExpression
src/utils/errors.ts:199:11
     }
 
     if (status) {
-      if (status === 404) {
+      if (true) {
         return new NotFoundError(message, context);
       }
killedBy: ErrorFactory fromHttpError should create ServerError for 500
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ServerError
Received constructor: NotFoundError

[Killed] LogicalOperator
src/utils/errors.ts:203:11
         return new NotFoundError(message, context);
       }
 
-      if (status === 401 || status === 403) {
+      if (status === 401 && status === 403) {
         return new AuthError(message, context);
       }
killedBy: ErrorFactory fromHttpError should create AuthError for 401
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: AuthError
Received constructor: ValidationError

[Killed] ConditionalExpression
src/utils/errors.ts:203:11
         return new NotFoundError(message, context);
       }
 
-      if (status === 401 || status === 403) {
+      if (true) {
         return new AuthError(message, context);
       }
killedBy: ErrorFactory fromHttpError should create ServerError for 500
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ServerError
Received constructor: AuthError

[Killed] EqualityOperator
src/utils/errors.ts:207:11
         return new AuthError(message, context);
       }
 
-      if (status === 429) {
+      if (status !== 429) {
         return new RateLimitError(message, context);
       }
killedBy: ErrorFactory fromHttpError should create ServerError for 500
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ServerError
Received constructor: RateLimitError

[Killed] BlockStatement
src/utils/errors.ts:207:27
         return new AuthError(message, context);
       }
 
-      if (status === 429) {
-        return new RateLimitError(message, context);
-      }
+      if (status === 429) {}
 
       if (status >= 400 && status < 500) {
killedBy: ErrorFactory fromHttpError should create RateLimitError for 429
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: RateLimitError
Received constructor: ValidationError

[Killed] EqualityOperator
src/utils/errors.ts:211:28
         return new RateLimitError(message, context);
       }
 
-      if (status >= 400 && status < 500) {
+      if (status >= 400 && status >= 500) {
         return new ValidationError(message, context);
       }
killedBy: ErrorFactory fromHttpError should create ServerError for 500
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ServerError
Received constructor: ValidationError

[Killed] ConditionalExpression
src/utils/errors.ts:211:11
         return new RateLimitError(message, context);
       }
 
-      if (status >= 400 && status < 500) {
+      if (true) {
         return new ValidationError(message, context);
       }
killedBy: ErrorFactory fromHttpError should create ServerError for 500
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ServerError
Received constructor: ValidationError

[Killed] EqualityOperator
src/utils/errors.ts:215:11
         return new ValidationError(message, context);
       }
 
-      if (status >= 500) {
+      if (status < 500) {
         return new ServerError(message, context);
       }
killedBy: ErrorFactory fromHttpError should create ServerError for 500
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ServerError
Received constructor: OpenAPIDirectoryError

[Killed] BlockStatement
src/utils/errors.ts:215:26
         return new ValidationError(message, context);
       }
 
-      if (status >= 500) {
-        return new ServerError(message, context);
-      }
+      if (status >= 500) {}
     }
 
killedBy: ErrorFactory fromHttpError should create ServerError for 500
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ServerError
Received constructor: OpenAPIDirectoryError

[Survived] LogicalOperator
src/utils/errors.ts:228:27
   }
 
   static fromCacheError(error: any, context: ErrorContext = {}): CacheError {
-    return new CacheError(error.message || "Cache operation failed", context);
+    return new CacheError(error.message && "Cache operation failed", context);
   }
 

[Killed] LogicalOperator
src/utils/errors.ts:243:7
     context: ErrorContext = {},
   ): SpecParseError {
     return new SpecParseError(
-      error.message || "Failed to parse OpenAPI specification",
+      error.message && "Failed to parse OpenAPI specification",
       context,
     );
killedBy: ErrorFactory fromSpecParseError should create SpecParseError
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Invalid JSON"
Received: "Failed to parse OpenAPI specification"

[Killed] BlockStatement
src/utils/errors.ts:256:63
   /**
    * Log error with appropriate level based on severity
    */
-  static logError(error: OpenAPIDirectoryError | Error): void {
-    if (error instanceof OpenAPIDirectoryError) {
-      const level = ErrorHandler.getLogLevel(error.code);
-      // eslint-disable-next-line no-console
-      console[level](`[${error.code}] ${error.message}`, {
-        userMessage: error.userMessage,
-        context: error.context,
-        timestamp: error.timestamp,
-      });
-    } else {
-      // eslint-disable-next-line no-console
-      console.error("Unhandled error:", error);
-    }
-  }
+  static logError(error: OpenAPIDirectoryError | Error): void {}
 
   /**
killedBy: SecondaryApiClient getProviders should handle and log errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/utils/errors.ts:257:49
    * Log error with appropriate level based on severity
    */
   static logError(error: OpenAPIDirectoryError | Error): void {
-    if (error instanceof OpenAPIDirectoryError) {
-      const level = ErrorHandler.getLogLevel(error.code);
-      // eslint-disable-next-line no-console
-      console[level](`[${error.code}] ${error.message}`, {
-        userMessage: error.userMessage,
-        context: error.context,
-        timestamp: error.timestamp,
-      });
-    } else {
+    if (error instanceof OpenAPIDirectoryError) {} else {
       // eslint-disable-next-line no-console
       console.error("Unhandled error:", error);
killedBy: SecondaryApiClient getProviders should handle and log errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] BlockStatement
src/utils/errors.ts:265:12
         context: error.context,
         timestamp: error.timestamp,
       });
-    } else {
-      // eslint-disable-next-line no-console
-      console.error("Unhandled error:", error);
-    }
+    } else {}
   }
 

[Survived] StringLiteral
src/utils/errors.ts:267:21
       });
     } else {
       // eslint-disable-next-line no-console
-      console.error("Unhandled error:", error);
+      console.error("", error);
     }
   }

[Killed] ConditionalExpression
src/utils/errors.ts:278:7
     switch (code) {
       case ERROR_CODES.NETWORK_ERROR:
       case ERROR_CODES.SERVER_ERROR:
-      case ERROR_CODES.UNKNOWN_ERROR:
-        return "error";
+      case ERROR_CODES.UNKNOWN_ERROR:
 
       case ERROR_CODES.TIMEOUT_ERROR:
killedBy: SecondaryApiClient getProviders should handle and log errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] ConditionalExpression
src/utils/errors.ts:283:7
 
       case ERROR_CODES.TIMEOUT_ERROR:
       case ERROR_CODES.RATE_LIMIT_ERROR:
-      case ERROR_CODES.CACHE_ERROR:
-        return "warn";
+      case ERROR_CODES.CACHE_ERROR:
 
       case ERROR_CODES.NOT_FOUND_ERROR:
