[Survived] ConditionalExpression
src/utils/errors.ts:287:7
         return "warn";
 
       case ERROR_CODES.NOT_FOUND_ERROR:
-      case ERROR_CODES.VALIDATION_ERROR:
-        return "info";
+      case ERROR_CODES.VALIDATION_ERROR:
 
       default:

[NoCoverage] BooleanLiteral
src/utils/errors.ts:300:14
    */
   static isRetryable(error: OpenAPIDirectoryError | Error): boolean {
     if (!(error instanceof OpenAPIDirectoryError)) {
-      return false;
+      return true;
     }
 

[Survived] LogicalOperator
src/utils/errors.ts:330:9
       processedError = new OpenAPIDirectoryError(
         message,
         code,
-        context || {},
+        context && {},
         message,
       );

[Survived] BlockStatement
src/utils/errors.ts:333:24
         context || {},
         message,
       );
-      if (error.stack) {
-        processedError.stack = error.stack;
-      }
+      if (error.stack) {}
     } else {
       processedError = new OpenAPIDirectoryError(
